lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     lpc17_headers//LPC176x5x.h
 * @brief    CMSIS HeaderFile
 * @version  0.2
 * @date     06. February 2020
 * @note     Generated by SVDConv V3.3.27 on Thursday, 06.02.2020 12:13:27
 *           from File 'LPC176x5x_v0.2.svd',
 */



/** @addtogroup 
  * @{
  */


/** @addtogroup LPC176x5x
  * @{
  */


#ifndef LPC176X5X_H
#define LPC176X5X_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M3 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  LPC176x5x Specific Interrupt Numbers  ========================================== */
  WDT_IRQn                  =   0,              /*!< 0  WDT                                                                    */
  TIMER0_IRQn               =   1,              /*!< 1  TIMER0                                                                 */
  TIMER1_IRQn               =   2,              /*!< 2  TIMER1                                                                 */
  TIMER2_IRQn               =   3,              /*!< 3  TIMER2                                                                 */
  TIMER3_IRQn               =   4,              /*!< 4  TIMER3                                                                 */
  UART0_IRQn                =   5,              /*!< 5  UART0                                                                  */
  UART1_IRQn                =   6,              /*!< 6  UART1                                                                  */
  UART2_IRQn                =   7,              /*!< 7  UART2                                                                  */
  UART3_IRQn                =   8,              /*!< 8  UART3                                                                  */
  PWM1_IRQn                 =   9,              /*!< 9  PWM1                                                                   */
  I2C0_IRQn                 =  10,              /*!< 10 I2C0                                                                   */
  I2C1_IRQn                 =  11,              /*!< 11 I2C1                                                                   */
  I2C2_IRQn                 =  12,              /*!< 12 I2C2                                                                   */
  SPI_IRQn                  =  13,              /*!< 13 SPI                                                                    */
  SSP0_IRQn                 =  14,              /*!< 14 SSP0                                                                   */
  SSP1_IRQn                 =  15,              /*!< 15 SSP1                                                                   */
  PLL0_IRQn                 =  16,              /*!< 16 PLL0                                                                   */
  RTC_IRQn                  =  17,              /*!< 17 RTC                                                                    */
  EINT0_IRQn                =  18,              /*!< 18 EINT0                                                                  */
  EINT1_IRQn                =  19,              /*!< 19 EINT1                                                                  */
  EINT2_IRQn                =  20,              /*!< 20 EINT2                                                                  */
  EINT3_IRQn                =  21,              /*!< 21 EINT3                                                                  */
  ADC_IRQn                  =  22,              /*!< 22 ADC                                                                    */
  BOD_IRQn                  =  23,              /*!< 23 BOD                                                                    */
  USB_IRQn                  =  24,              /*!< 24 USB                                                                    */
  CAN_IRQn                  =  25,              /*!< 25 CAN                                                                    */
  DMA_IRQn                  =  26,              /*!< 26 DMA                                                                    */
  I2S_IRQn                  =  27,              /*!< 27 I2S                                                                    */
  ENET_IRQn                 =  28,              /*!< 28 ENET                                                                   */
  RIT_IRQn                  =  29,              /*!< 29 RIT                                                                    */
  MCPWM_IRQn                =  30,              /*!< 30 MCPWM                                                                  */
  QEI_IRQn                  =  31,              /*!< 31 QEI                                                                    */
  PLL1_IRQn                 =  32,              /*!< 32 PLL1                                                                   */
  USBActivity_IRQn          =  33,              /*!< 33 USBActivity                                                            */
  CANActivity_IRQn          =  34               /*!< 34 CANActivity                                                            */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

