lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ===========================  Configuration of the ARM Cortex-M3 Processor and Core Peripherals  =========================== */
#define __CM3_REV                 0x0000U       /*!< CM3 Core Revision                                                         */
#define __NVIC_PRIO_BITS               5        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  0        /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                           /*!< ARM Cortex-M3 processor and core peripherals                              */
// #include "system_LPC176x5x.h"                   /*!< LPC176x5x System                                                          */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer (WDT) (WDT)
  */

typedef struct {                                /*!< (@ 0x40000000) WDT Structure                                              */
  __IOM uint32_t  MOD;                          /*!< (@ 0x00000000) Watchdog mode register. This register determines
                                                                    the basic mode and status of the Watchdog
                                                                    Timer.                                                     */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000004) Watchdog timer constant register. The value in
                                                                    this register determines the time-out value.               */
  __OM  uint32_t  FEED;                         /*!< (@ 0x00000008) Watchdog feed sequence register. Writing 0xAA
                                                                    followed by 0x55 to this register reloads
                                                                    the Watchdog timer with the value contained
                                                                    in WDTC.                                                   */
  __IM  uint32_t  TV;                           /*!< (@ 0x0000000C) Watchdog timer value register. This register
                                                                    reads out the current value of the Watchdog
                                                                    timer.                                                     */
  __IOM uint32_t  CLKSEL;                       /*!< (@ 0x00000010) Watchdog clock select register.                            */
} LPC_WDT_Type;                                 /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer0/1/2/3 (TIMER0)
  */

typedef struct {                                /*!< (@ 0x40004000) TIMER0 Structure                                           */
  __IOM uint32_t  IR;                           /*!< (@ 0x00000000) Interrupt Register. The IR can be written to
                                                                    clear interrupts. The IR can be read to
                                                                    identify which of eight possible interrupt
                                                                    sources are pending.                                       */
  __IOM uint32_t  TCR;                          /*!< (@ 0x00000004) Timer Control Register. The TCR is used to control
                                                                    the Timer Counter functions. The Timer Counter
                                                                    can be disabled or reset through the TCR.                  */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000008) Timer Counter. The 32 bit TC is incremented every
                                                                    PR+1 cycles of PCLK. The TC is controlled
                                                                    through the TCR.                                           */
  __IOM uint32_t  PR;                           /*!< (@ 0x0000000C) Prescale Register. When the Prescale Counter
                                                                    (PC) is equal to this value, the next clock
                                                                    increments the TC and clears the PC.                       */
  __IOM uint32_t  PC;                           /*!< (@ 0x00000010) Prescale Counter. The 32 bit PC is a counter
                                                                    which is incremented to the value stored
                                                                    in PR. When the value in PR is reached,
                                                                    the TC is incremented and the PC is cleared.
                                                                    The PC is observable and controllable through
                                                                    the bus interface.                                         */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000014) Match Control Register. The MCR is used to control
                                                                    if an interrupt is generated and if the
                                                                    TC is reset when a Match occurs.                           */
  __IOM uint32_t  MR[4];                        /*!< (@ 0x00000018) Match Register 0. MR0 can be enabled through
                                                                    the MCR to reset the TC, stop both the TC
                                                                    and PC, and/or generate an interrupt every
                                                                    time MR0 matches the TC.                                   */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000028) Capture Control Register. The CCR controls which
                                                                    edges of the capture inputs are used to
                                                                    load the Capture Registers and whether or
                                                                    not an interrupt is generated when a capture
                                                                    takes place.                                               */
  __IM  uint32_t  CR[2];                        /*!< (@ 0x0000002C) Capture Register 0. CR0 is loaded with the value
                                                                    of TC when there is an event on the CAPn.0
                                                                    input.                                                     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  EMR;                          /*!< (@ 0x0000003C) External Match Register. The EMR controls the
                                                                    external match pins.                                       */
  __IM  uint32_t  RESERVED1[12];
  __IOM uint32_t  CTCR;                         /*!< (@ 0x00000070) Count Control Register. The CTCR selects between
                                                                    Timer and Counter mode, and in Counter mode
                                                                    selects the signal and edge(s) for counting.               */
} LPC_TIMER0_Type;                              /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                          TIMER1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer0/1/2/3 (TIMER1)
  */

typedef struct {                                /*!< (@ 0x40008000) TIMER1 Structure                                           */
  __IOM uint32_t  IR;                           /*!< (@ 0x00000000) Interrupt Register. The IR can be written to
                                                                    clear interrupts. The IR can be read to
                                                                    identify which of eight possible interrupt
                                                                    sources are pending.                                       */
  __IOM uint32_t  TCR;                          /*!< (@ 0x00000004) Timer Control Register. The TCR is used to control
                                                                    the Timer Counter functions. The Timer Counter
                                                                    can be disabled or reset through the TCR.                  */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000008) Timer Counter. The 32 bit TC is incremented every
                                                                    PR+1 cycles of PCLK. The TC is controlled
                                                                    through the TCR.                                           */
  __IOM uint32_t  PR;                           /*!< (@ 0x0000000C) Prescale Register. When the Prescale Counter
                                                                    (PC) is equal to this value, the next clock
                                                                    increments the TC and clears the PC.                       */
  __IOM uint32_t  PC;                           /*!< (@ 0x00000010) Prescale Counter. The 32 bit PC is a counter
                                                                    which is incremented to the value stored
                                                                    in PR. When the value in PR is reached,
                                                                    the TC is incremented and the PC is cleared.
                                                                    The PC is observable and controllable through
                                                                    the bus interface.                                         */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000014) Match Control Register. The MCR is used to control
                                                                    if an interrupt is generated and if the
                                                                    TC is reset when a Match occurs.                           */
  __IOM uint32_t  MR[4];                        /*!< (@ 0x00000018) Match Register 0. MR0 can be enabled through
                                                                    the MCR to reset the TC, stop both the TC
                                                                    and PC, and/or generate an interrupt every
                                                                    time MR0 matches the TC.                                   */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000028) Capture Control Register. The CCR controls which
                                                                    edges of the capture inputs are used to
                                                                    load the Capture Registers and whether or
                                                                    not an interrupt is generated when a capture
                                                                    takes place.                                               */
  __IM  uint32_t  CR[2];                        /*!< (@ 0x0000002C) Capture Register 0. CR0 is loaded with the value
                                                                    of TC when there is an event on the CAPn.0
                                                                    input.                                                     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  EMR;                          /*!< (@ 0x0000003C) External Match Register. The EMR controls the
                                                                    external match pins.                                       */
  __IM  uint32_t  RESERVED1[12];
  __IOM uint32_t  CTCR;                         /*!< (@ 0x00000070) Count Control Register. The CTCR selects between
                                                                    Timer and Counter mode, and in Counter mode
                                                                    selects the signal and edge(s) for counting.               */
} LPC_TIMER1_Type;                              /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART0/2/3 (UART0)
  */

typedef struct {                                /*!< (@ 0x4000C000) UART0 Structure                                            */
  
  union {
    __IM  uint32_t RBR;                         /*!< (@ 0x00000000) Receiver Buffer Register. Contains the next received
                                                                    character to be read (DLAB =0).                            */
    __OM  uint32_t THR;                         /*!< (@ 0x00000000) Transmit Holding Regiter. The next character
                                                                    to be transmitted is written here (DLAB
                                                                    =0).                                                       */
    __IOM uint32_t DLL;                         /*!< (@ 0x00000000) Divisor Latch LSB. Least significant byte of
                                                                    the baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
  };
  
  union {
    __IOM uint32_t DLM;                         /*!< (@ 0x00000004) Divisor Latch MSB. Most significant byte of the
                                                                    baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) Interrupt Enable Register. Contains individual
                                                                    interrupt enable bits for the 7 potential
                                                                    UART interrupts (DLAB =0).                                 */
  };
  
  union {
    __IM  uint32_t IIR;                         /*!< (@ 0x00000008) Interrupt ID Register. Identifies which interrupt(s)
                                                                    are pending.                                               */
    __OM  uint32_t FCR;                         /*!< (@ 0x00000008) FIFO Control Register. Controls UART FIFO usage
                                                                    and modes.                                                 */
  };
  __IOM uint32_t  LCR;                          /*!< (@ 0x0000000C) Line Control Register. Contains controls for
                                                                    frame formatting and break generation.                     */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  LSR;                          /*!< (@ 0x00000014) Line Status Register. Contains flags for transmit
                                                                    and receive status, including line errors.                 */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SCR;                          /*!< (@ 0x0000001C) Scratch Pad Register. 8-bit temporary storage
                                                                    for software.                                              */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000020) Auto-baud Control Register. Contains controls
                                                                    for the auto-baud feature.                                 */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  FDR;                          /*!< (@ 0x00000028) Fractional Divider Register. Generates a clock
                                                                    input for the baud rate divider.                           */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  TER;                          /*!< (@ 0x00000030) Transmit Enable Register. Turns off UART transmitter
                                                                    for use with software flow control.                        */
  __IM  uint32_t  RESERVED4[6];
  __IOM uint32_t  RS485CTRL;                    /*!< (@ 0x0000004C) RS-485/EIA-485 Control. Contains controls to
                                                                    configure various aspects of RS-485/EIA-485
                                                                    modes.                                                     */
  __IOM uint32_t  RS485ADRMATCH;                /*!< (@ 0x00000050) RS-485/EIA-485 address match. Contains the address
                                                                    match value for RS-485/EIA-485 mode.                       */
  __IOM uint32_t  RS485DLY;                     /*!< (@ 0x00000054) RS-485/EIA-485 direction control delay.                    */
} LPC_UART0_Type;                               /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x40010000) UART1 Structure                                            */
  
  union {
    __IM  uint32_t RBR;                         /*!< (@ 0x00000000) DLAB =0 Receiver Buffer Register. Contains the
                                                                    next received character to be read.                        */
    __OM  uint32_t THR;                         /*!< (@ 0x00000000) DLAB =0. Transmit Holding Register. The next
                                                                    character to be transmitted is written here.               */
    __IOM uint32_t DLL;                         /*!< (@ 0x00000000) DLAB =1. Divisor Latch LSB. Least significant
                                                                    byte of the baud rate divisor value. The
                                                                    full divisor is used to generate a baud
                                                                    rate from the fractional rate divider.                     */
  };
  
  union {
    __IOM uint32_t DLM;                         /*!< (@ 0x00000004) DLAB =1. Divisor Latch MSB. Most significant
                                                                    byte of the baud rate divisor value. The
                                                                    full divisor is used to generate a baud
                                                                    rate from the fractional rate divider.                     */
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) DLAB =0. Interrupt Enable Register. Contains
                                                                    individual interrupt enable bits for the
                                                                    7 potential UART1 interrupts.                              */
  };
  
