lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
  union {
    __IM  uint32_t IIR;                         /*!< (@ 0x00000008) Interrupt ID Register. Identifies which interrupt(s)
                                                                    are pending.                                               */
    __OM  uint32_t FCR;                         /*!< (@ 0x00000008) FIFO Control Register. Controls UART1 FIFO usage
                                                                    and modes.                                                 */
  };
  __IOM uint32_t  LCR;                          /*!< (@ 0x0000000C) Line Control Register. Contains controls for
                                                                    frame formatting and break generation.                     */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000010) Modem Control Register. Contains controls for
                                                                    flow control handshaking and loopback mode.                */
  __IM  uint32_t  LSR;                          /*!< (@ 0x00000014) Line Status Register. Contains flags for transmit
                                                                    and receive status, including line errors.                 */
  __IM  uint32_t  MSR;                          /*!< (@ 0x00000018) Modem Status Register. Contains handshake signal
                                                                    status flags.                                              */
  __IOM uint32_t  SCR;                          /*!< (@ 0x0000001C) Scratch Pad Register. 8-bit temporary storage
                                                                    for software.                                              */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000020) Auto-baud Control Register. Contains controls
                                                                    for the auto-baud feature.                                 */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  FDR;                          /*!< (@ 0x00000028) Fractional Divider Register. Generates a clock
                                                                    input for the baud rate divider.                           */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TER;                          /*!< (@ 0x00000030) Transmit Enable Register. Turns off UART transmitter
                                                                    for use with software flow control.                        */
  __IM  uint32_t  RESERVED2[6];
  __IOM uint32_t  RS485CTRL;                    /*!< (@ 0x0000004C) RS-485/EIA-485 Control. Contains controls to
                                                                    configure various aspects of RS-485/EIA-485
                                                                    modes.                                                     */
  __IOM uint32_t  RS485ADRMATCH;                /*!< (@ 0x00000050) RS-485/EIA-485 address match. Contains the address
                                                                    match value for RS-485/EIA-485 mode.                       */
  __IOM uint32_t  RS485DLY;                     /*!< (@ 0x00000054) RS-485/EIA-485 direction control delay.                    */
} LPC_UART1_Type;                               /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           PWM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Pulse Width Modulators (PWM1) (PWM1)
  */

typedef struct {                                /*!< (@ 0x40018000) PWM1 Structure                                             */
  __IOM uint32_t  IR;                           /*!< (@ 0x00000000) Interrupt Register. The IR can be written to
                                                                    clear interrupts, or read to identify which
                                                                    PWM interrupt sources are pending.                         */
  __IOM uint32_t  TCR;                          /*!< (@ 0x00000004) Timer Control Register. The TCR is used to control
                                                                    the Timer Counter functions.                               */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000008) Timer Counter. The 32 bit TC is incremented every
                                                                    PR+1 cycles of PCLK. The TC is controlled
                                                                    through the TCR.                                           */
  __IOM uint32_t  PR;                           /*!< (@ 0x0000000C) Prescale Register. Determines how often the PWM
                                                                    counter is incremented.                                    */
  __IOM uint32_t  PC;                           /*!< (@ 0x00000010) Prescale Counter. Prescaler for the main PWM
                                                                    counter.                                                   */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000014) Match Control Register. The MCR is used to control
                                                                    whether an interrupt is generated and if
                                                                    the PWM counter is reset when a Match occurs.              */
  __IOM uint32_t  MR0;                          /*!< (@ 0x00000018) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  MR1;                          /*!< (@ 0x0000001C) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  MR2;                          /*!< (@ 0x00000020) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  MR3;                          /*!< (@ 0x00000024) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000028) Capture Control Register. The CCR controls which
                                                                    edges of the capture inputs are used to
                                                                    load the Capture Registers and whether or
                                                                    not an interrupt is generated for a capture
                                                                    event.                                                     */
  __IOM uint32_t  CR[2];                        /*!< (@ 0x0000002C) PWM Control Register. Enables PWM outputs and
                                                                    selects either single edge or double edge
                                                                    controlled PWM outputs.                                    */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  MR4;                          /*!< (@ 0x00000040) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  MR5;                          /*!< (@ 0x00000044) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  MR6;                          /*!< (@ 0x00000048) Match Register. Match registersare continuously
                                                                    compared to the PWM counter in order to
                                                                    control PWMoutput edges.                                   */
  __IOM uint32_t  PCR;                          /*!< (@ 0x0000004C) PWM Control Register. Enables PWM outputs and
                                                                    selects either single edge or double edge
                                                                    controlled PWM outputs.                                    */
  __IOM uint32_t  LER;                          /*!< (@ 0x00000050) Load Enable Register. Enables use of updated
                                                                    PWM match values.                                          */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  CTCR;                         /*!< (@ 0x00000070) Count Control Register. The CTCR selects between
                                                                    Timer and Counter mode, and in Counter mode
                                                                    selects the signal and edge(s) for counting.               */
} LPC_PWM1_Type;                                /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C bus interface (I2C0)
  */

typedef struct {                                /*!< (@ 0x4001C000) I2C0 Structure                                             */
  __IOM uint32_t  CONSET;                       /*!< (@ 0x00000000) I2C Control Set Register. When a one is written
                                                                    to a bit of this register, the corresponding
                                                                    bit in the I2C control register is set.
                                                                    Writing a zero has no effect on the corresponding
                                                                    bit in the I2C control register.                           */
  __IM  uint32_t  STAT;                         /*!< (@ 0x00000004) I2C Status Register. During I2C operation, this
                                                                    register provides detailed status codes
                                                                    that allow software to determine the next
                                                                    action needed.                                             */
  __IOM uint32_t  DAT;                          /*!< (@ 0x00000008) I2C Data Register. During master or slave transmit
                                                                    mode, data to be transmitted is written
                                                                    to this register. During master or slave
                                                                    receive mode, data that has been received
                                                                    may be read from this register.                            */
  __IOM uint32_t  ADR0;                         /*!< (@ 0x0000000C) I2C Slave Address Register 0. Contains the 7-bit
                                                                    slave address for operation of the I2C interface
                                                                    in slave mode, and is not used in master
                                                                    mode. The least significant bit determines
                                                                    whether a slave responds to the General
                                                                    Call address.                                              */
  __IOM uint32_t  SCLH;                         /*!< (@ 0x00000010) SCH Duty Cycle Register High Half Word. Determines
                                                                    the high time of the I2C clock.                            */
  __IOM uint32_t  SCLL;                         /*!< (@ 0x00000014) SCL Duty Cycle Register Low Half Word. Determines
                                                                    the low time of the I2C clock. SCLL and
                                                                    SCLH together determine the clock frequency
                                                                    generated by an I2C master and certain times
                                                                    used in slave mode.                                        */
  __OM  uint32_t  CONCLR;                       /*!< (@ 0x00000018) I2C Control Clear Register. When a one is written
                                                                    to a bit of this register, the corresponding
                                                                    bit in the I2C control register is cleared.
                                                                    Writing a zero has no effect on the corresponding
                                                                    bit in the I2C control register.                           */
  __IOM uint32_t  MMCTRL;                       /*!< (@ 0x0000001C) Monitor mode control register.                             */
  __IOM uint32_t  ADR1;                         /*!< (@ 0x00000020) I2C Slave Address Register. Contains the 7-bit
                                                                    slave address for operation of the I2C interface
                                                                    in slave mode, and is not used in master
                                                                    mode. The least significant bit determines
                                                                    whether a slave responds to the General
                                                                    Call address.                                              */
  __IOM uint32_t  ADR2;                         /*!< (@ 0x00000024) I2C Slave Address Register. Contains the 7-bit
                                                                    slave address for operation of the I2C interface
                                                                    in slave mode, and is not used in master
                                                                    mode. The least significant bit determines
                                                                    whether a slave responds to the General
                                                                    Call address.                                              */
  __IOM uint32_t  ADR3;                         /*!< (@ 0x00000028) I2C Slave Address Register. Contains the 7-bit
                                                                    slave address for operation of the I2C interface
                                                                    in slave mode, and is not used in master
                                                                    mode. The least significant bit determines
                                                                    whether a slave responds to the General
                                                                    Call address.                                              */
  __IM  uint32_t  DATA_BUFFER;                  /*!< (@ 0x0000002C) Data buffer register. The contents of the 8 MSBs
                                                                    of the DAT shift register will be transferred
                                                                    to the DATA_BUFFER automatically after every
                                                                    nine bits (8 bits of data plus ACK or NACK)
                                                                    has been received on the bus.                              */
  __IOM uint32_t  MASK[4];                      /*!< (@ 0x00000030) I2C Slave address mask register                            */
} LPC_I2C0_Type;                                /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI (SPI)
  */

