lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x40020000) SPI Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) SPI Control Register. This register controls
                                                                    the operation of the SPI.                                  */
  __IM  uint32_t  SR;                           /*!< (@ 0x00000004) SPI Status Register. This register shows the
                                                                    status of the SPI.                                         */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000008) SPI Data Register. This bi-directional register
                                                                    provides the transmit and receive data for
                                                                    the SPI. Transmit data is provided to the
                                                                    SPI0 by writing to this register. Data received
                                                                    by the SPI0 can be read from this register.                */
  __IOM uint32_t  CCR;                          /*!< (@ 0x0000000C) SPI Clock Counter Register. This register controls
                                                                    the frequency of a master's SCK0.                          */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  INT;                          /*!< (@ 0x0000001C) SPI Interrupt Flag. This register contains the
                                                                    interrupt flag for the SPI interface.                      */
} LPC_SPI_Type;                                 /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (RTC) (RTC)
  */

typedef struct {                                /*!< (@ 0x40024000) RTC Structure                                              */
  __IOM uint32_t  ILR;                          /*!< (@ 0x00000000) Interrupt Location Register                                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000008) Clock Control Register                                     */
  __IOM uint32_t  CIIR;                         /*!< (@ 0x0000000C) Counter Increment Interrupt Register                       */
  __IOM uint32_t  AMR;                          /*!< (@ 0x00000010) Alarm Mask Register                                        */
  __IM  uint32_t  CTIME0;                       /*!< (@ 0x00000014) Consolidated Time Register 0                               */
  __IM  uint32_t  CTIME1;                       /*!< (@ 0x00000018) Consolidated Time Register 1                               */
  __IM  uint32_t  CTIME2;                       /*!< (@ 0x0000001C) Consolidated Time Register 2                               */
  __IOM uint32_t  SEC;                          /*!< (@ 0x00000020) Seconds Counter                                            */
  __IOM uint32_t  MIN;                          /*!< (@ 0x00000024) Minutes Register                                           */
  __IOM uint32_t  HRS;                          /*!< (@ 0x00000028) Hours Register                                             */
  __IOM uint32_t  DOM;                          /*!< (@ 0x0000002C) Day of Month Register                                      */
  __IOM uint32_t  DOW;                          /*!< (@ 0x00000030) Day of Week Register                                       */
  __IOM uint32_t  DOY;                          /*!< (@ 0x00000034) Day of Year Register                                       */
  __IOM uint32_t  MONTH;                        /*!< (@ 0x00000038) Months Register                                            */
  __IOM uint32_t  YEAR;                         /*!< (@ 0x0000003C) Years Register                                             */
  __IOM uint32_t  CALIBRATION;                  /*!< (@ 0x00000040) Calibration Value Register                                 */
  __IOM uint32_t  GPREG0;                       /*!< (@ 0x00000044) General Purpose Register 0                                 */
  __IOM uint32_t  GPREG1;                       /*!< (@ 0x00000048) General Purpose Register 0                                 */
  __IOM uint32_t  GPREG2;                       /*!< (@ 0x0000004C) General Purpose Register 0                                 */
  __IOM uint32_t  GPREG3;                       /*!< (@ 0x00000050) General Purpose Register 0                                 */
  __IOM uint32_t  GPREG4;                       /*!< (@ 0x00000054) General Purpose Register 0                                 */
  __IOM uint32_t  RTC_AUXEN;                    /*!< (@ 0x00000058) RTC Auxiliary Enable register                              */
  __IOM uint32_t  RTC_AUX;                      /*!< (@ 0x0000005C) RTC Auxiliary control register                             */
  __IOM uint32_t  ASEC;                         /*!< (@ 0x00000060) Alarm value for Seconds                                    */
  __IOM uint32_t  AMIN;                         /*!< (@ 0x00000064) Alarm value for Minutes                                    */
  __IOM uint32_t  AHRS;                         /*!< (@ 0x00000068) Alarm value for Hours                                      */
  __IOM uint32_t  ADOM;                         /*!< (@ 0x0000006C) Alarm value for Day of Month                               */
  __IOM uint32_t  ADOW;                         /*!< (@ 0x00000070) Alarm value for Day of Week                                */
  __IOM uint32_t  ADOY;                         /*!< (@ 0x00000074) Alarm value for Day of Year                                */
  __IOM uint32_t  AMON;                         /*!< (@ 0x00000078) Alarm value for Months                                     */
  __IOM uint32_t  AYRS;                         /*!< (@ 0x0000007C) Alarm value for Year                                       */
} LPC_RTC_Type;                                 /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                          GPIOINT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO (GPIOINT)
  */

typedef struct {                                /*!< (@ 0x40028080) GPIOINT Structure                                          */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000000) GPIO overall Interrupt Status.                             */
  __IM  uint32_t  STATR0;                       /*!< (@ 0x00000004) GPIO Interrupt Status for Rising edge for Port
                                                                    0.                                                         */
  __IM  uint32_t  STATF0;                       /*!< (@ 0x00000008) GPIO Interrupt Status for Falling edge for Port
                                                                    0.                                                         */
  __OM  uint32_t  CLR0;                         /*!< (@ 0x0000000C) GPIO Interrupt Clear.                                      */
  __IOM uint32_t  ENR0;                         /*!< (@ 0x00000010) GPIO Interrupt Enable for Rising edge for Port
                                                                    0.                                                         */
  __IOM uint32_t  ENF0;                         /*!< (@ 0x00000014) GPIO Interrupt Enable for Falling edge for Port
                                                                    0.                                                         */
  __IM  uint32_t  RESERVED[3];
  __IM  uint32_t  STATR2;                       /*!< (@ 0x00000024) GPIO Interrupt Status for Rising edge for Port
                                                                    0.                                                         */
  __IM  uint32_t  STATF2;                       /*!< (@ 0x00000028) GPIO Interrupt Status for Falling edge for Port
                                                                    0.                                                         */
  __OM  uint32_t  CLR2;                         /*!< (@ 0x0000002C) GPIO Interrupt Clear.                                      */
  __IOM uint32_t  ENR2;                         /*!< (@ 0x00000030) GPIO Interrupt Enable for Rising edge for Port
                                                                    0.                                                         */
  __IOM uint32_t  ENF2;                         /*!< (@ 0x00000034) GPIO Interrupt Enable for Falling edge for Port
                                                                    0.                                                         */
} LPC_GPIOINT_Type;                             /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                        PINCONNECT                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Pin connect block (PINCONNECT)
  */

typedef struct {                                /*!< (@ 0x4002C000) PINCONNECT Structure                                       */
  __IOM uint32_t  PINSEL0;                      /*!< (@ 0x00000000) Pin function select register 0.                            */
  __IOM uint32_t  PINSEL1;                      /*!< (@ 0x00000004) Pin function select register 1.                            */
  __IOM uint32_t  PINSEL2;                      /*!< (@ 0x00000008) Pin function select register 2.                            */
  __IOM uint32_t  PINSEL3;                      /*!< (@ 0x0000000C) Pin function select register 3.                            */
  __IOM uint32_t  PINSEL4;                      /*!< (@ 0x00000010) Pin function select register 4                             */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  PINSEL7;                      /*!< (@ 0x0000001C) Pin function select register 7                             */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  PINSEL9;                      /*!< (@ 0x00000024) Pin function select register 9                             */
  __IOM uint32_t  PINSEL10;                     /*!< (@ 0x00000028) Pin function select register 10                            */
  __IM  uint32_t  RESERVED2[5];
  __IOM uint32_t  PINMODE0;                     /*!< (@ 0x00000040) Pin mode select register 0                                 */
  __IOM uint32_t  PINMODE1;                     /*!< (@ 0x00000044) Pin mode select register 1                                 */
  __IOM uint32_t  PINMODE2;                     /*!< (@ 0x00000048) Pin mode select register 2                                 */
  __IOM uint32_t  PINMODE3;                     /*!< (@ 0x0000004C) Pin mode select register 3.                                */
  __IOM uint32_t  PINMODE4;                     /*!< (@ 0x00000050) Pin mode select register 4                                 */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  PINMODE7;                     /*!< (@ 0x0000005C) Pin mode select register 7                                 */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  PINMODE9;                     /*!< (@ 0x00000064) Pin mode select register 9                                 */
  __IOM uint32_t  PINMODE_OD0;                  /*!< (@ 0x00000068) Open drain mode control register 0                         */
  __IOM uint32_t  PINMODE_OD1;                  /*!< (@ 0x0000006C) Open drain mode control register 1                         */
  __IOM uint32_t  PINMODE_OD2;                  /*!< (@ 0x00000070) Open drain mode control register 2                         */
  __IOM uint32_t  PINMODE_OD3;                  /*!< (@ 0x00000074) Open drain mode control register 3                         */
  __IOM uint32_t  PINMODE_OD4;                  /*!< (@ 0x00000078) Open drain mode control register 4                         */
  __IOM uint32_t  I2CPADCFG;                    /*!< (@ 0x0000007C) I2C Pin Configuration register                             */
} LPC_PINCONNECT_Type;                          /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                           SSP1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSP1 controller (SSP1)
  */

typedef struct {                                /*!< (@ 0x40030000) SSP1 Structure                                             */
  __IOM uint32_t  CR0;                          /*!< (@ 0x00000000) Control Register 0. Selects the serial clock
                                                                    rate, bus type, and data size.                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000004) Control Register 1. Selects master/slave and
                                                                    other modes.                                               */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000008) Data Register. Writes fill the transmit FIFO,
                                                                    and reads empty the receive FIFO.                          */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000000C) Status Register                                            */
  __IOM uint32_t  CPSR;                         /*!< (@ 0x00000010) Clock Prescale Register                                    */
  __IOM uint32_t  IMSC;                         /*!< (@ 0x00000014) Interrupt Mask Set and Clear Register                      */
  __IM  uint32_t  RIS;                          /*!< (@ 0x00000018) Raw Interrupt Status Register                              */
  __IM  uint32_t  MIS;                          /*!< (@ 0x0000001C) Masked Interrupt Status Register                           */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) SSPICR Interrupt Clear Register                            */
  __IOM uint32_t  DMACR;                        /*!< (@ 0x00000024) SSP0 DMA control register                                  */
} LPC_SSP1_Type;                                /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-Digital Converter (ADC) (ADC)
  */

typedef struct {                                /*!< (@ 0x40034000) ADC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) A/D Control Register. The ADCR register must
                                                                    be written to select the operating mode
                                                                    before A/D conversion can occur.                           */
  __IOM uint32_t  GDR;                          /*!< (@ 0x00000004) A/D Global Data Register. This register contains
                                                                    the ADC's DONE bit and the result of the
                                                                    most recent A/D conversion.                                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INTEN;                        /*!< (@ 0x0000000C) A/D Interrupt Enable Register. This register
                                                                    contains enable bits that allow the DONE
                                                                    flag of each A/D channel to be included
                                                                    or excluded from contributing to the generation
                                                                    of an A/D interrupt.                                       */
  __IM  uint32_t  DR[8];                        /*!< (@ 0x00000010) A/D Channel 0 Data Register. This register contains
                                                                    the result of the most recent conversion
                                                                    completed on channel 0.                                    */
  __IM  uint32_t  STAT;                         /*!< (@ 0x00000030) A/D Status Register. This register contains DONE
                                                                    and OVERRUN flags for all of the A/D channels,
                                                                    as well as the A/D interrupt/DMA flag.                     */
  __IOM uint32_t  TRM;                          /*!< (@ 0x00000034) ADC trim register.                                         */
} LPC_ADC_Type;                                 /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                         CANAFRAM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN acceptance filter RAM (CANAFRAM)
  */

typedef struct {                                /*!< (@ 0x40038000) CANAFRAM Structure                                         */
  __IOM uint32_t  MASK[512];                    /*!< (@ 0x00000000) CAN AF ram access register                                 */
} LPC_CANAFRAM_Type;                            /*!< Size = 2048 (0x800)                                                       */



/* =========================================================================================================================== */
/* ================                                           CANAF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN controller acceptance filter (CANAF)
  */

typedef struct {                                /*!< (@ 0x4003C000) CANAF Structure                                            */
  __IOM uint32_t  AFMR;                         /*!< (@ 0x00000000) Acceptance Filter Register                                 */
  __IOM uint32_t  SFF_SA;                       /*!< (@ 0x00000004) Standard Frame Individual Start Address Register           */
  __IOM uint32_t  SFF_GRP_SA;                   /*!< (@ 0x00000008) Standard Frame Group Start Address Register                */
  __IOM uint32_t  EFF_SA;                       /*!< (@ 0x0000000C) Extended Frame Start Address Register                      */
  __IOM uint32_t  EFF_GRP_SA;                   /*!< (@ 0x00000010) Extended Frame Group Start Address Register                */
  __IOM uint32_t  ENDOFTABLE;                   /*!< (@ 0x00000014) End of AF Tables register                                  */
  __IM  uint32_t  LUTERRAD;                     /*!< (@ 0x00000018) LUT Error Address register                                 */
  __IM  uint32_t  LUTERR;                       /*!< (@ 0x0000001C) LUT Error Register                                         */
  __IOM uint32_t  FCANIE;                       /*!< (@ 0x00000020) FullCAN interrupt enable register                          */
  __IOM uint32_t  FCANIC0;                      /*!< (@ 0x00000024) FullCAN interrupt and capture register0                    */
  __IOM uint32_t  FCANIC1;                      /*!< (@ 0x00000028) FullCAN interrupt and capture register1                    */
} LPC_CANAF_Type;                               /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           CCAN                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Central CAN controller (CCAN)
  */

typedef struct {                                /*!< (@ 0x40040000) CCAN Structure                                             */
  __IM  uint32_t  TXSR;                         /*!< (@ 0x00000000) CAN Central Transmit Status Register                       */
  __IM  uint32_t  RXSR;                         /*!< (@ 0x00000004) CAN Central Receive Status Register                        */
  __IM  uint32_t  MSR;                          /*!< (@ 0x00000008) CAN Central Miscellaneous Register                         */
} LPC_CCAN_Type;                                /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           CAN1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN1 controller (CAN1)
  */

