lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x40044000) CAN1 Structure                                             */
  __IOM uint32_t  MOD;                          /*!< (@ 0x00000000) Controls the operating mode of the CAN Controller.         */
  __OM  uint32_t  CMR;                          /*!< (@ 0x00000004) Command bits that affect the state of the CAN
                                                                    Controller                                                 */
  __IM  uint32_t  GSR;                          /*!< (@ 0x00000008) Global Controller Status and Error Counters.
                                                                    The error counters can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IM  uint32_t  ICR;                          /*!< (@ 0x0000000C) Interrupt status, Arbitration Lost Capture, Error
                                                                    Code Capture                                               */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000010) Interrupt Enable                                           */
  __IOM uint32_t  BTR;                          /*!< (@ 0x00000014) Bus Timing. Can only be written when RM in CANMOD
                                                                    is 1.                                                      */
  __IOM uint32_t  EWL;                          /*!< (@ 0x00000018) Error Warning Limit. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000001C) Status Register                                            */
  __IOM uint32_t  RFS;                          /*!< (@ 0x00000020) Receive frame status. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IOM uint32_t  RID;                          /*!< (@ 0x00000024) Received Identifier. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IOM uint32_t  RDA;                          /*!< (@ 0x00000028) Received data bytes 1-4. Can only be written
                                                                    when RM in CANMOD is 1.                                    */
  __IOM uint32_t  RDB;                          /*!< (@ 0x0000002C) Received data bytes 5-8. Can only be written
                                                                    when RM in CANMOD is 1.                                    */
  __IOM uint32_t  TFI1;                         /*!< (@ 0x00000030) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID1;                         /*!< (@ 0x00000034) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA1;                         /*!< (@ 0x00000038) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB1;                         /*!< (@ 0x0000003C) Transmitdata bytes 5-8 (Tx Buffer )                        */
  __IOM uint32_t  TFI2;                         /*!< (@ 0x00000040) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID2;                         /*!< (@ 0x00000044) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA2;                         /*!< (@ 0x00000048) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB2;                         /*!< (@ 0x0000004C) Transmitdata bytes 5-8 (Tx Buffer )                        */
  __IOM uint32_t  TFI3;                         /*!< (@ 0x00000050) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID3;                         /*!< (@ 0x00000054) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA3;                         /*!< (@ 0x00000058) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB3;                         /*!< (@ 0x0000005C) Transmitdata bytes 5-8 (Tx Buffer )                        */
} LPC_CAN1_Type;                                /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                           CAN2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN1 controller (CAN2)
  */

typedef struct {                                /*!< (@ 0x40048000) CAN2 Structure                                             */
  __IOM uint32_t  MOD;                          /*!< (@ 0x00000000) Controls the operating mode of the CAN Controller.         */
  __OM  uint32_t  CMR;                          /*!< (@ 0x00000004) Command bits that affect the state of the CAN
                                                                    Controller                                                 */
  __IM  uint32_t  GSR;                          /*!< (@ 0x00000008) Global Controller Status and Error Counters.
                                                                    The error counters can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IM  uint32_t  ICR;                          /*!< (@ 0x0000000C) Interrupt status, Arbitration Lost Capture, Error
                                                                    Code Capture                                               */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000010) Interrupt Enable                                           */
  __IOM uint32_t  BTR;                          /*!< (@ 0x00000014) Bus Timing. Can only be written when RM in CANMOD
                                                                    is 1.                                                      */
  __IOM uint32_t  EWL;                          /*!< (@ 0x00000018) Error Warning Limit. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000001C) Status Register                                            */
  __IOM uint32_t  RFS;                          /*!< (@ 0x00000020) Receive frame status. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IOM uint32_t  RID;                          /*!< (@ 0x00000024) Received Identifier. Can only be written when
                                                                    RM in CANMOD is 1.                                         */
  __IOM uint32_t  RDA;                          /*!< (@ 0x00000028) Received data bytes 1-4. Can only be written
                                                                    when RM in CANMOD is 1.                                    */
  __IOM uint32_t  RDB;                          /*!< (@ 0x0000002C) Received data bytes 5-8. Can only be written
                                                                    when RM in CANMOD is 1.                                    */
  __IOM uint32_t  TFI1;                         /*!< (@ 0x00000030) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID1;                         /*!< (@ 0x00000034) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA1;                         /*!< (@ 0x00000038) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB1;                         /*!< (@ 0x0000003C) Transmitdata bytes 5-8 (Tx Buffer )                        */
  __IOM uint32_t  TFI2;                         /*!< (@ 0x00000040) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID2;                         /*!< (@ 0x00000044) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA2;                         /*!< (@ 0x00000048) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB2;                         /*!< (@ 0x0000004C) Transmitdata bytes 5-8 (Tx Buffer )                        */
  __IOM uint32_t  TFI3;                         /*!< (@ 0x00000050) Transmitframe info (Tx Buffer )                            */
  __IOM uint32_t  TID3;                         /*!< (@ 0x00000054) TransmitIdentifier (Tx Buffer)                             */
  __IOM uint32_t  TDA3;                         /*!< (@ 0x00000058) Transmitdata bytes 1-4 (Tx Buffer)                         */
  __IOM uint32_t  TDB3;                         /*!< (@ 0x0000005C) Transmitdata bytes 5-8 (Tx Buffer )                        */
} LPC_CAN2_Type;                                /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                           SSP0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSP controller (SSP0)
  */

typedef struct {                                /*!< (@ 0x40088000) SSP0 Structure                                             */
  __IOM uint32_t  CR0;                          /*!< (@ 0x00000000) Control Register 0. Selects the serial clock
                                                                    rate, bus type, and data size.                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000004) Control Register 1. Selects master/slave and
                                                                    other modes.                                               */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000008) Data Register. Writes fill the transmit FIFO,
                                                                    and reads empty the receive FIFO.                          */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000000C) Status Register                                            */
  __IOM uint32_t  CPSR;                         /*!< (@ 0x00000010) Clock Prescale Register                                    */
  __IOM uint32_t  IMSC;                         /*!< (@ 0x00000014) Interrupt Mask Set and Clear Register                      */
  __IM  uint32_t  RIS;                          /*!< (@ 0x00000018) Raw Interrupt Status Register                              */
  __IM  uint32_t  MIS;                          /*!< (@ 0x0000001C) Masked Interrupt Status Register                           */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) SSPICR Interrupt Clear Register                            */
  __IOM uint32_t  DMACR;                        /*!< (@ 0x00000024) SSP0 DMA control register                                  */
} LPC_SSP0_Type;                                /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-Analog Converter (DAC) (DAC)
  */

typedef struct {                                /*!< (@ 0x4008C000) DAC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) D/A Converter Register. This register contains
                                                                    the digital value to be converted to analog
                                                                    and a power control bit.                                   */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000004) DAC Control register. This register controls
                                                                    DMA and timer operation.                                   */
  __IOM uint32_t  CNTVAL;                       /*!< (@ 0x00000008) DAC Counter Value register. This register contains
                                                                    the reload value for the DAC DMA/Interrupt
                                                                    timer.                                                     */
} LPC_DAC_Type;                                 /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer0/1/2/3 (TIMER2)
  */

typedef struct {                                /*!< (@ 0x40090000) TIMER2 Structure                                           */
  __IOM uint32_t  IR;                           /*!< (@ 0x00000000) Interrupt Register. The IR can be written to
                                                                    clear interrupts. The IR can be read to
                                                                    identify which of eight possible interrupt
                                                                    sources are pending.                                       */
  __IOM uint32_t  TCR;                          /*!< (@ 0x00000004) Timer Control Register. The TCR is used to control
                                                                    the Timer Counter functions. The Timer Counter
                                                                    can be disabled or reset through the TCR.                  */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000008) Timer Counter. The 32 bit TC is incremented every
                                                                    PR+1 cycles of PCLK. The TC is controlled
                                                                    through the TCR.                                           */
  __IOM uint32_t  PR;                           /*!< (@ 0x0000000C) Prescale Register. When the Prescale Counter
                                                                    (PC) is equal to this value, the next clock
                                                                    increments the TC and clears the PC.                       */
  __IOM uint32_t  PC;                           /*!< (@ 0x00000010) Prescale Counter. The 32 bit PC is a counter
                                                                    which is incremented to the value stored
                                                                    in PR. When the value in PR is reached,
                                                                    the TC is incremented and the PC is cleared.
                                                                    The PC is observable and controllable through
                                                                    the bus interface.                                         */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000014) Match Control Register. The MCR is used to control
                                                                    if an interrupt is generated and if the
                                                                    TC is reset when a Match occurs.                           */
  __IOM uint32_t  MR[4];                        /*!< (@ 0x00000018) Match Register 0. MR0 can be enabled through
                                                                    the MCR to reset the TC, stop both the TC
                                                                    and PC, and/or generate an interrupt every
                                                                    time MR0 matches the TC.                                   */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000028) Capture Control Register. The CCR controls which
                                                                    edges of the capture inputs are used to
                                                                    load the Capture Registers and whether or
                                                                    not an interrupt is generated when a capture
                                                                    takes place.                                               */
  __IM  uint32_t  CR[2];                        /*!< (@ 0x0000002C) Capture Register 0. CR0 is loaded with the value
                                                                    of TC when there is an event on the CAPn.0
                                                                    input.                                                     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  EMR;                          /*!< (@ 0x0000003C) External Match Register. The EMR controls the
                                                                    external match pins.                                       */
  __IM  uint32_t  RESERVED1[12];
  __IOM uint32_t  CTCR;                         /*!< (@ 0x00000070) Count Control Register. The CTCR selects between
                                                                    Timer and Counter mode, and in Counter mode
                                                                    selects the signal and edge(s) for counting.               */
} LPC_TIMER2_Type;                              /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                          TIMER3                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer0/1/2/3 (TIMER3)
  */

