lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x40094000) TIMER3 Structure                                           */
  __IOM uint32_t  IR;                           /*!< (@ 0x00000000) Interrupt Register. The IR can be written to
                                                                    clear interrupts. The IR can be read to
                                                                    identify which of eight possible interrupt
                                                                    sources are pending.                                       */
  __IOM uint32_t  TCR;                          /*!< (@ 0x00000004) Timer Control Register. The TCR is used to control
                                                                    the Timer Counter functions. The Timer Counter
                                                                    can be disabled or reset through the TCR.                  */
  __IOM uint32_t  TC;                           /*!< (@ 0x00000008) Timer Counter. The 32 bit TC is incremented every
                                                                    PR+1 cycles of PCLK. The TC is controlled
                                                                    through the TCR.                                           */
  __IOM uint32_t  PR;                           /*!< (@ 0x0000000C) Prescale Register. When the Prescale Counter
                                                                    (PC) is equal to this value, the next clock
                                                                    increments the TC and clears the PC.                       */
  __IOM uint32_t  PC;                           /*!< (@ 0x00000010) Prescale Counter. The 32 bit PC is a counter
                                                                    which is incremented to the value stored
                                                                    in PR. When the value in PR is reached,
                                                                    the TC is incremented and the PC is cleared.
                                                                    The PC is observable and controllable through
                                                                    the bus interface.                                         */
  __IOM uint32_t  MCR;                          /*!< (@ 0x00000014) Match Control Register. The MCR is used to control
                                                                    if an interrupt is generated and if the
                                                                    TC is reset when a Match occurs.                           */
  __IOM uint32_t  MR[4];                        /*!< (@ 0x00000018) Match Register 0. MR0 can be enabled through
                                                                    the MCR to reset the TC, stop both the TC
                                                                    and PC, and/or generate an interrupt every
                                                                    time MR0 matches the TC.                                   */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000028) Capture Control Register. The CCR controls which
                                                                    edges of the capture inputs are used to
                                                                    load the Capture Registers and whether or
                                                                    not an interrupt is generated when a capture
                                                                    takes place.                                               */
  __IM  uint32_t  CR[2];                        /*!< (@ 0x0000002C) Capture Register 0. CR0 is loaded with the value
                                                                    of TC when there is an event on the CAPn.0
                                                                    input.                                                     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  EMR;                          /*!< (@ 0x0000003C) External Match Register. The EMR controls the
                                                                    external match pins.                                       */
  __IM  uint32_t  RESERVED1[12];
  __IOM uint32_t  CTCR;                         /*!< (@ 0x00000070) Count Control Register. The CTCR selects between
                                                                    Timer and Counter mode, and in Counter mode
                                                                    selects the signal and edge(s) for counting.               */
} LPC_TIMER3_Type;                              /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART0/2/3 (UART2)
  */

typedef struct {                                /*!< (@ 0x40098000) UART2 Structure                                            */
  
  union {
    __IM  uint32_t RBR;                         /*!< (@ 0x00000000) Receiver Buffer Register. Contains the next received
                                                                    character to be read (DLAB =0).                            */
    __OM  uint32_t THR;                         /*!< (@ 0x00000000) Transmit Holding Regiter. The next character
                                                                    to be transmitted is written here (DLAB
                                                                    =0).                                                       */
    __IOM uint32_t DLL;                         /*!< (@ 0x00000000) Divisor Latch LSB. Least significant byte of
                                                                    the baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
  };
  
  union {
    __IOM uint32_t DLM;                         /*!< (@ 0x00000004) Divisor Latch MSB. Most significant byte of the
                                                                    baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) Interrupt Enable Register. Contains individual
                                                                    interrupt enable bits for the 7 potential
                                                                    UART interrupts (DLAB =0).                                 */
  };
  
  union {
    __IM  uint32_t IIR;                         /*!< (@ 0x00000008) Interrupt ID Register. Identifies which interrupt(s)
                                                                    are pending.                                               */
    __OM  uint32_t FCR;                         /*!< (@ 0x00000008) FIFO Control Register. Controls UART FIFO usage
                                                                    and modes.                                                 */
  };
  __IOM uint32_t  LCR;                          /*!< (@ 0x0000000C) Line Control Register. Contains controls for
                                                                    frame formatting and break generation.                     */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  LSR;                          /*!< (@ 0x00000014) Line Status Register. Contains flags for transmit
                                                                    and receive status, including line errors.                 */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SCR;                          /*!< (@ 0x0000001C) Scratch Pad Register. 8-bit temporary storage
                                                                    for software.                                              */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000020) Auto-baud Control Register. Contains controls
                                                                    for the auto-baud feature.                                 */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  FDR;                          /*!< (@ 0x00000028) Fractional Divider Register. Generates a clock
                                                                    input for the baud rate divider.                           */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  TER;                          /*!< (@ 0x00000030) Transmit Enable Register. Turns off UART transmitter
                                                                    for use with software flow control.                        */
  __IM  uint32_t  RESERVED4[6];
  __IOM uint32_t  RS485CTRL;                    /*!< (@ 0x0000004C) RS-485/EIA-485 Control. Contains controls to
                                                                    configure various aspects of RS-485/EIA-485
                                                                    modes.                                                     */
  __IOM uint32_t  RS485ADRMATCH;                /*!< (@ 0x00000050) RS-485/EIA-485 address match. Contains the address
                                                                    match value for RS-485/EIA-485 mode.                       */
  __IOM uint32_t  RS485DLY;                     /*!< (@ 0x00000054) RS-485/EIA-485 direction control delay.                    */
} LPC_UART2_Type;                               /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART3                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART0/2/3 (UART3)
  */

typedef struct {                                /*!< (@ 0x4009C000) UART3 Structure                                            */
  
  union {
    __IM  uint32_t RBR;                         /*!< (@ 0x00000000) Receiver Buffer Register. Contains the next received
                                                                    character to be read (DLAB =0).                            */
    __OM  uint32_t THR;                         /*!< (@ 0x00000000) Transmit Holding Regiter. The next character
                                                                    to be transmitted is written here (DLAB
                                                                    =0).                                                       */
    __IOM uint32_t DLL;                         /*!< (@ 0x00000000) Divisor Latch LSB. Least significant byte of
                                                                    the baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
  };
  
  union {
    __IOM uint32_t DLM;                         /*!< (@ 0x00000004) Divisor Latch MSB. Most significant byte of the
                                                                    baud rate divisor value. The full divisor
                                                                    is used to generate a baud rate from the
                                                                    fractional rate divider (DLAB =1).                         */
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) Interrupt Enable Register. Contains individual
                                                                    interrupt enable bits for the 7 potential
                                                                    UART interrupts (DLAB =0).                                 */
  };
  
  union {
    __IM  uint32_t IIR;                         /*!< (@ 0x00000008) Interrupt ID Register. Identifies which interrupt(s)
                                                                    are pending.                                               */
    __OM  uint32_t FCR;                         /*!< (@ 0x00000008) FIFO Control Register. Controls UART FIFO usage
                                                                    and modes.                                                 */
  };
  __IOM uint32_t  LCR;                          /*!< (@ 0x0000000C) Line Control Register. Contains controls for
                                                                    frame formatting and break generation.                     */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  LSR;                          /*!< (@ 0x00000014) Line Status Register. Contains flags for transmit
                                                                    and receive status, including line errors.                 */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SCR;                          /*!< (@ 0x0000001C) Scratch Pad Register. 8-bit temporary storage
                                                                    for software.                                              */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000020) Auto-baud Control Register. Contains controls
                                                                    for the auto-baud feature.                                 */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  FDR;                          /*!< (@ 0x00000028) Fractional Divider Register. Generates a clock
                                                                    input for the baud rate divider.                           */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  TER;                          /*!< (@ 0x00000030) Transmit Enable Register. Turns off UART transmitter
                                                                    for use with software flow control.                        */
  __IM  uint32_t  RESERVED4[6];
  __IOM uint32_t  RS485CTRL;                    /*!< (@ 0x0000004C) RS-485/EIA-485 Control. Contains controls to
                                                                    configure various aspects of RS-485/EIA-485
                                                                    modes.                                                     */
  __IOM uint32_t  RS485ADRMATCH;                /*!< (@ 0x00000050) RS-485/EIA-485 address match. Contains the address
                                                                    match value for RS-485/EIA-485 mode.                       */
  __IOM uint32_t  RS485DLY;                     /*!< (@ 0x00000054) RS-485/EIA-485 direction control delay.                    */
} LPC_UART3_Type;                               /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                            I2S                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2S interface (I2S)
  */

