lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x400A8000) I2S Structure                                              */
  __IOM uint32_t  DAO;                          /*!< (@ 0x00000000) I2S Digital Audio Output Register. Contains control
                                                                    bits for the I2S transmit channel.                         */
  __IOM uint32_t  DAI;                          /*!< (@ 0x00000004) I2S Digital Audio Input Register. Contains control
                                                                    bits for the I2S receive channel.                          */
  __OM  uint32_t  TXFIFO;                       /*!< (@ 0x00000008) I2S Transmit FIFO. Access register for the 8
                                                                    x 32-bit transmitter FIFO.                                 */
  __IM  uint32_t  RXFIFO;                       /*!< (@ 0x0000000C) I2S Receive FIFO. Access register for the 8 x
                                                                    32-bit receiver FIFO.                                      */
  __IM  uint32_t  STATE;                        /*!< (@ 0x00000010) I2S Status Feedback Register. Contains status
                                                                    information about the I2S interface.                       */
  __IOM uint32_t  DMA1;                         /*!< (@ 0x00000014) I2S DMA Configuration Register 1. Contains control
                                                                    information for DMA request 1.                             */
  __IOM uint32_t  DMA2;                         /*!< (@ 0x00000018) I2S DMA Configuration Register 2. Contains control
                                                                    information for DMA request 2.                             */
  __IOM uint32_t  IRQ;                          /*!< (@ 0x0000001C) I2S Interrupt Request Control Register. Contains
                                                                    bits that control how the I2S interrupt
                                                                    request is generated.                                      */
  __IOM uint32_t  TXRATE;                       /*!< (@ 0x00000020) I2S Transmit MCLK divider. This register determines
                                                                    the I2S TX MCLK rate by specifying the value
                                                                    to divide PCLK by in order to produce MCLK.                */
  __IOM uint32_t  RXRATE;                       /*!< (@ 0x00000024) I2S Receive MCLK divider. This register determines
                                                                    the I2S RX MCLK rate by specifying the value
                                                                    to divide PCLK by in order to produce MCLK.                */
  __IOM uint32_t  TXBITRATE;                    /*!< (@ 0x00000028) I2S Transmit bit rate divider. This register
                                                                    determines the I2S transmit bit rate by
                                                                    specifying the value to divide TX_MCLK by
                                                                    in order to produce the transmit bit clock.                */
  __IOM uint32_t  RXBITRATE;                    /*!< (@ 0x0000002C) I2S Receive bit rate divider. This register determines
                                                                    the I2S receive bit rate by specifying the
                                                                    value to divide RX_MCLK by in order to produce
                                                                    the receive bit clock.                                     */
  __IOM uint32_t  TXMODE;                       /*!< (@ 0x00000030) I2S Transmit mode control.                                 */
  __IOM uint32_t  RXMODE;                       /*!< (@ 0x00000034) I2S Receive mode control.                                  */
} LPC_I2S_Type;                                 /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          RITIMER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Repetitive Interrupt Timer (RIT) (RITIMER)
  */

typedef struct {                                /*!< (@ 0x400B0000) RITIMER Structure                                          */
  __IOM uint32_t  COMPVAL;                      /*!< (@ 0x00000000) Compare register                                           */
  __IOM uint32_t  MASK;                         /*!< (@ 0x00000004) Mask register. This register holds the 32-bit
                                                                    mask value. A 1 written to any bit will
                                                                    force a compare on the corresponding bit
                                                                    of the counter and compare register.                       */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000008) Control register.                                          */
  __IOM uint32_t  COUNTER;                      /*!< (@ 0x0000000C) 32-bit counter                                             */
} LPC_RITIMER_Type;                             /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           MCPWM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Motor Control PWM (MCPWM)
  */

typedef struct {                                /*!< (@ 0x400B8000) MCPWM Structure                                            */
  __IM  uint32_t  CON;                          /*!< (@ 0x00000000) PWM Control read address                                   */
  __OM  uint32_t  CON_SET;                      /*!< (@ 0x00000004) PWM Control set address                                    */
  __OM  uint32_t  CON_CLR;                      /*!< (@ 0x00000008) PWM Control clear address                                  */
  __IM  uint32_t  CAPCON;                       /*!< (@ 0x0000000C) Capture Control read address                               */
  __OM  uint32_t  CAPCON_SET;                   /*!< (@ 0x00000010) Capture Control set address                                */
  __OM  uint32_t  CAPCON_CLR;                   /*!< (@ 0x00000014) Event Control clear address                                */
  __IOM uint32_t  TC[3];                        /*!< (@ 0x00000018) Timer Counter register                                     */
  __IOM uint32_t  LIM[3];                       /*!< (@ 0x00000024) Limit register                                             */
  __IOM uint32_t  MAT[3];                       /*!< (@ 0x00000030) Match register                                             */
  __IOM uint32_t  DT;                           /*!< (@ 0x0000003C) Dead time register                                         */
  __IOM uint32_t  CP;                           /*!< (@ 0x00000040) Communication Pattern register                             */
  __IM  uint32_t  CAP[3];                       /*!< (@ 0x00000044) Capture register                                           */
  __IM  uint32_t  INTEN;                        /*!< (@ 0x00000050) Interrupt Enable read address                              */
  __OM  uint32_t  INTEN_SET;                    /*!< (@ 0x00000054) Interrupt Enable set address                               */
  __OM  uint32_t  INTEN_CLR;                    /*!< (@ 0x00000058) Interrupt Enable clear address                             */
  __IM  uint32_t  CNTCON;                       /*!< (@ 0x0000005C) Count Control read address                                 */
  __OM  uint32_t  CNTCON_SET;                   /*!< (@ 0x00000060) Count Control set address                                  */
  __OM  uint32_t  CNTCON_CLR;                   /*!< (@ 0x00000064) Count Control clear address                                */
  __IM  uint32_t  INTF;                         /*!< (@ 0x00000068) Interrupt flags read address                               */
  __OM  uint32_t  INTF_SET;                     /*!< (@ 0x0000006C) Interrupt flags set address                                */
  __OM  uint32_t  INTF_CLR;                     /*!< (@ 0x00000070) Interrupt flags clear address                              */
  __OM  uint32_t  CAP_CLR;                      /*!< (@ 0x00000074) Capture clear address                                      */
} LPC_MCPWM_Type;                               /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                            QEI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Quadrature Encoder Interface (QEI) (QEI)
  */

