lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x400BC000) QEI Structure                                              */
  __OM  uint32_t  CON;                          /*!< (@ 0x00000000) Control register                                           */
  __IM  uint32_t  STAT;                         /*!< (@ 0x00000004) Status register                                            */
  __IOM uint32_t  CONF;                         /*!< (@ 0x00000008) Configuration register                                     */
  __IM  uint32_t  POS;                          /*!< (@ 0x0000000C) Position register                                          */
  __IOM uint32_t  MAXPOS;                       /*!< (@ 0x00000010) Maximum position register                                  */
  __IOM uint32_t  CMPOS0;                       /*!< (@ 0x00000014) Position compare register 0                                */
  __IOM uint32_t  CMPOS1;                       /*!< (@ 0x00000018) Position compare register 1                                */
  __IOM uint32_t  CMPOS2;                       /*!< (@ 0x0000001C) Position compare register 2                                */
  __IM  uint32_t  INXCNT;                       /*!< (@ 0x00000020) Index count register 0                                     */
  __IOM uint32_t  INXCMP0;                      /*!< (@ 0x00000024) Index compare register 0                                   */
  __IOM uint32_t  LOAD;                         /*!< (@ 0x00000028) Velocity timer reload register                             */
  __IM  uint32_t  TIME;                         /*!< (@ 0x0000002C) Velocity timer register                                    */
  __IM  uint32_t  VEL;                          /*!< (@ 0x00000030) Velocity counter register                                  */
  __IM  uint32_t  CAP;                          /*!< (@ 0x00000034) Velocity capture register                                  */
  __IOM uint32_t  VELCOMP;                      /*!< (@ 0x00000038) Velocity compare register                                  */
  __IOM uint32_t  FILTER;                       /*!< (@ 0x0000003C) Digital filter register                                    */
  __IM  uint32_t  RESERVED[998];
  __OM  uint32_t  IEC;                          /*!< (@ 0x00000FD8) Interrupt enable clear register                            */
  __OM  uint32_t  IES;                          /*!< (@ 0x00000FDC) Interrupt enable set register                              */
  __IM  uint32_t  INTSTAT;                      /*!< (@ 0x00000FE0) Interrupt status register                                  */
  __IM  uint32_t  IE;                           /*!< (@ 0x00000FE4) Interrupt enable register                                  */
  __OM  uint32_t  CLR;                          /*!< (@ 0x00000FE8) Interrupt status clear register                            */
  __OM  uint32_t  SET;                          /*!< (@ 0x00000FEC) Interrupt status set register                              */
} LPC_QEI_Type;                                 /*!< Size = 4080 (0xff0)                                                       */



/* =========================================================================================================================== */
/* ================                                          SYSCON                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System and clock control (SYSCON)
  */

typedef struct {                                /*!< (@ 0x400FC000) SYSCON Structure                                           */
  __IOM uint32_t  FLASHCFG;                     /*!< (@ 0x00000000) Flash Accelerator Configuration Register. Controls
                                                                    flash access timing.                                       */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  PLL0CON;                      /*!< (@ 0x00000080) PLL0 Control Register                                      */
  __IOM uint32_t  PLL0CFG;                      /*!< (@ 0x00000084) PLL0 Configuration Register                                */
  __IM  uint32_t  PLL0STAT;                     /*!< (@ 0x00000088) PLL0 Status Register                                       */
  __OM  uint32_t  PLL0FEED;                     /*!< (@ 0x0000008C) PLL0 Feed Register                                         */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  PLL1CON;                      /*!< (@ 0x000000A0) PLL1 Control Register                                      */
  __IOM uint32_t  PLL1CFG;                      /*!< (@ 0x000000A4) PLL1 Configuration Register                                */
  __IM  uint32_t  PLL1STAT;                     /*!< (@ 0x000000A8) PLL1 Status Register                                       */
  __OM  uint32_t  PLL1FEED;                     /*!< (@ 0x000000AC) PLL1 Feed Register                                         */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  PCON;                         /*!< (@ 0x000000C0) Power Control Register                                     */
  __IOM uint32_t  PCONP;                        /*!< (@ 0x000000C4) Power Control for Peripherals Register                     */
  __IM  uint32_t  RESERVED3[15];
  __IOM uint32_t  CCLKCFG;                      /*!< (@ 0x00000104) CPU Clock Configuration Register                           */
  __IOM uint32_t  USBCLKCFG;                    /*!< (@ 0x00000108) USB Clock Configuration Register                           */
  __IOM uint32_t  CLKSRCSEL;                    /*!< (@ 0x0000010C) Clock Source Select Register                               */
  __IOM uint32_t  CANSLEEPCLR;                  /*!< (@ 0x00000110) Allows clearing the current CAN channel sleep
                                                                    state as well as reading that state.                       */
  __IOM uint32_t  CANWAKEFLAGS;                 /*!< (@ 0x00000114) Allows reading the wake-up state of the CAN channels.      */
  __IM  uint32_t  RESERVED4[10];
  __IOM uint32_t  EXTINT;                       /*!< (@ 0x00000140) External Interrupt Flag Register                           */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  EXTMODE;                      /*!< (@ 0x00000148) External Interrupt Mode register                           */
  __IOM uint32_t  EXTPOLAR;                     /*!< (@ 0x0000014C) External Interrupt Polarity Register                       */
  __IM  uint32_t  RESERVED6[12];
  __IOM uint32_t  RSID;                         /*!< (@ 0x00000180) Reset Source Identification Register                       */
  __IM  uint32_t  RESERVED7[7];
  __IOM uint32_t  SCS;                          /*!< (@ 0x000001A0) System control and status                                  */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  PCLKSEL0;                     /*!< (@ 0x000001A8) Peripheral Clock Selection register 0.                     */
  __IOM uint32_t  PCLKSEL1;                     /*!< (@ 0x000001AC) Peripheral Clock Selection register 1.                     */
  __IM  uint32_t  RESERVED9[4];
  __IOM uint32_t  USBINTST;                     /*!< (@ 0x000001C0) USB Interrupt Status                                       */
  __IOM uint32_t  DMACREQSEL;                   /*!< (@ 0x000001C4) Selects between alternative requests on DMA channels
                                                                    0 through 7 and 10 through 15                              */
  __IOM uint32_t  CLKOUTCFG;                    /*!< (@ 0x000001C8) Clock Output Configuration Register                        */
} LPC_SYSCON_Type;                              /*!< Size = 460 (0x1cc)                                                        */



/* =========================================================================================================================== */
/* ================                                           EMAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Ethernet (EMAC)
  */

