lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x50000000) EMAC Structure                                             */
  __IOM uint32_t  MAC1;                         /*!< (@ 0x00000000) MAC configuration register 1.                              */
  __IOM uint32_t  MAC2;                         /*!< (@ 0x00000004) MAC configuration register 2.                              */
  __IOM uint32_t  IPGT;                         /*!< (@ 0x00000008) Back-to-Back Inter-Packet-Gap register.                    */
  __IOM uint32_t  IPGR;                         /*!< (@ 0x0000000C) Non Back-to-Back Inter-Packet-Gap register.                */
  __IOM uint32_t  CLRT;                         /*!< (@ 0x00000010) Collision window / Retry register.                         */
  __IOM uint32_t  MAXF;                         /*!< (@ 0x00000014) Maximum Frame register.                                    */
  __IOM uint32_t  SUPP;                         /*!< (@ 0x00000018) PHY Support register.                                      */
  __IOM uint32_t  TEST;                         /*!< (@ 0x0000001C) Test register.                                             */
  __IOM uint32_t  MCFG;                         /*!< (@ 0x00000020) MII Mgmt Configuration register.                           */
  __IOM uint32_t  MCMD;                         /*!< (@ 0x00000024) MII Mgmt Command register.                                 */
  __IOM uint32_t  MADR;                         /*!< (@ 0x00000028) MII Mgmt Address register.                                 */
  __OM  uint32_t  MWTD;                         /*!< (@ 0x0000002C) MII Mgmt Write Data register.                              */
  __IM  uint32_t  MRDD;                         /*!< (@ 0x00000030) MII Mgmt Read Data register.                               */
  __IM  uint32_t  MIND;                         /*!< (@ 0x00000034) MII Mgmt Indicators register.                              */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  SA0;                          /*!< (@ 0x00000040) Station Address 0 register.                                */
  __IOM uint32_t  SA1;                          /*!< (@ 0x00000044) Station Address 1 register.                                */
  __IOM uint32_t  SA2;                          /*!< (@ 0x00000048) Station Address 2 register.                                */
  __IM  uint32_t  RESERVED1[45];
  __IOM uint32_t  COMMAND;                      /*!< (@ 0x00000100) Command register.                                          */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000104) Status register.                                           */
  __IOM uint32_t  RXDESCRIPTOR;                 /*!< (@ 0x00000108) Receive descriptor base address register.                  */
  __IOM uint32_t  RXSTATUS;                     /*!< (@ 0x0000010C) Receive status base address register.                      */
  __IOM uint32_t  RXDESCRIPTORNUMBER;           /*!< (@ 0x00000110) Receive number of descriptors register.                    */
  __IM  uint32_t  RXPRODUCEINDEX;               /*!< (@ 0x00000114) Receive produce index register.                            */
  __IOM uint32_t  RXCONSUMEINDEX;               /*!< (@ 0x00000118) Receive consume index register.                            */
  __IOM uint32_t  TXDESCRIPTOR;                 /*!< (@ 0x0000011C) Transmit descriptor base address register.                 */
  __IOM uint32_t  TXSTATUS;                     /*!< (@ 0x00000120) Transmit status base address register.                     */
  __IOM uint32_t  TXDESCRIPTORNUMBER;           /*!< (@ 0x00000124) Transmit number of descriptors register.                   */
  __IOM uint32_t  TXPRODUCEINDEX;               /*!< (@ 0x00000128) Transmit produce index register.                           */
  __IM  uint32_t  TXCONSUMEINDEX;               /*!< (@ 0x0000012C) Transmit consume index register.                           */
  __IM  uint32_t  RESERVED2[10];
  __IM  uint32_t  TSV0;                         /*!< (@ 0x00000158) Transmit status vector 0 register.                         */
  __IM  uint32_t  TSV1;                         /*!< (@ 0x0000015C) Transmit status vector 1 register.                         */
  __IM  uint32_t  RSV;                          /*!< (@ 0x00000160) Receive status vector register.                            */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  FLOWCONTROLCOUNTER;           /*!< (@ 0x00000170) Flow control counter register.                             */
  __IM  uint32_t  FLOWCONTROLSTATUS;            /*!< (@ 0x00000174) Flow control status register.                              */
  __IM  uint32_t  RESERVED4[34];
  __IOM uint32_t  RXFILTERCTRL;                 /*!< (@ 0x00000200) Receive filter control register.                           */
  __IM  uint32_t  RXFILTERWOLSTATUS;            /*!< (@ 0x00000204) Receive filter WoL status register.                        */
  __OM  uint32_t  RXFILTERWOLCLEAR;             /*!< (@ 0x00000208) Receive filter WoL clear register.                         */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  HASHFILTERL;                  /*!< (@ 0x00000210) Hash filter table LSBs register.                           */
  __IOM uint32_t  HASHFILTERH;                  /*!< (@ 0x00000214) Hash filter table MSBs register.                           */
  __IM  uint32_t  RESERVED6[882];
  __IM  uint32_t  INTSTATUS;                    /*!< (@ 0x00000FE0) Interrupt status register.                                 */
  __IOM uint32_t  INTENABLE;                    /*!< (@ 0x00000FE4) Interrupt enable register.                                 */
  __OM  uint32_t  INTCLEAR;                     /*!< (@ 0x00000FE8) Interrupt clear register.                                  */
  __OM  uint32_t  INTSET;                       /*!< (@ 0x00000FEC) Interrupt set register.                                    */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  POWERDOWN;                    /*!< (@ 0x00000FF4) Power-down register.                                       */
} LPC_EMAC_Type;                                /*!< Size = 4088 (0xff8)                                                       */



/* =========================================================================================================================== */
/* ================                                           GPDMA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose DMA controller (GPDMA)
  */

