lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x50004000) GPDMA Structure                                            */
  __IM  uint32_t  INTSTAT;                      /*!< (@ 0x00000000) DMA Interrupt Status Register                              */
  __IM  uint32_t  INTTCSTAT;                    /*!< (@ 0x00000004) DMA Interrupt Terminal Count Request Status Register       */
  __OM  uint32_t  INTTCCLEAR;                   /*!< (@ 0x00000008) DMA Interrupt Terminal Count Request Clear Register        */
  __IM  uint32_t  INTERRSTAT;                   /*!< (@ 0x0000000C) DMA Interrupt Error Status Register                        */
  __OM  uint32_t  INTERRCLR;                    /*!< (@ 0x00000010) DMA Interrupt Error Clear Register                         */
  __IM  uint32_t  RAWINTTCSTAT;                 /*!< (@ 0x00000014) DMA Raw Interrupt Terminal Count Status Register           */
  __IM  uint32_t  RAWINTERRSTAT;                /*!< (@ 0x00000018) DMA Raw Error Interrupt Status Register                    */
  __IM  uint32_t  ENBLDCHNS;                    /*!< (@ 0x0000001C) DMA Enabled Channel Register                               */
  __IOM uint32_t  SOFTBREQ;                     /*!< (@ 0x00000020) DMA Software Burst Request Register                        */
  __IOM uint32_t  SOFTSREQ;                     /*!< (@ 0x00000024) DMA Software Single Request Register                       */
  __IOM uint32_t  SOFTLBREQ;                    /*!< (@ 0x00000028) DMA Software Last Burst Request Register                   */
  __IOM uint32_t  SOFTLSREQ;                    /*!< (@ 0x0000002C) DMA Software Last Single Request Register                  */
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x00000030) DMA Configuration Register                                 */
  __IOM uint32_t  SYNC;                         /*!< (@ 0x00000034) DMA Synchronization Register                               */
  __IM  uint32_t  RESERVED[50];
  __IOM uint32_t  SRCADDR0;                     /*!< (@ 0x00000100) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR0;                    /*!< (@ 0x00000104) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI0;                         /*!< (@ 0x00000108) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL0;                     /*!< (@ 0x0000010C) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG0;                      /*!< (@ 0x00000110) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  SRCADDR1;                     /*!< (@ 0x00000120) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR1;                    /*!< (@ 0x00000124) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI1;                         /*!< (@ 0x00000128) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL1;                     /*!< (@ 0x0000012C) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG1;                      /*!< (@ 0x00000130) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  SRCADDR2;                     /*!< (@ 0x00000140) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR2;                    /*!< (@ 0x00000144) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI2;                         /*!< (@ 0x00000148) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL2;                     /*!< (@ 0x0000014C) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG2;                      /*!< (@ 0x00000150) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  SRCADDR3;                     /*!< (@ 0x00000160) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR3;                    /*!< (@ 0x00000164) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI3;                         /*!< (@ 0x00000168) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL3;                     /*!< (@ 0x0000016C) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG3;                      /*!< (@ 0x00000170) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED4[3];
  __IOM uint32_t  SRCADDR4;                     /*!< (@ 0x00000180) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR4;                    /*!< (@ 0x00000184) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI4;                         /*!< (@ 0x00000188) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL4;                     /*!< (@ 0x0000018C) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG4;                      /*!< (@ 0x00000190) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  SRCADDR5;                     /*!< (@ 0x000001A0) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR5;                    /*!< (@ 0x000001A4) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI5;                         /*!< (@ 0x000001A8) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL5;                     /*!< (@ 0x000001AC) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG5;                      /*!< (@ 0x000001B0) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED6[3];
  __IOM uint32_t  SRCADDR6;                     /*!< (@ 0x000001C0) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR6;                    /*!< (@ 0x000001C4) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI6;                         /*!< (@ 0x000001C8) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL6;                     /*!< (@ 0x000001CC) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG6;                      /*!< (@ 0x000001D0) DMA Channel 0 Configuration Register[1]                    */
  __IM  uint32_t  RESERVED7[3];
  __IOM uint32_t  SRCADDR7;                     /*!< (@ 0x000001E0) DMA Channel 0 Source Address Register                      */
  __IOM uint32_t  DESTADDR7;                    /*!< (@ 0x000001E4) DMA Channel 0 Destination Address Register                 */
  __IOM uint32_t  LLI7;                         /*!< (@ 0x000001E8) DMA Channel 0 Linked List Item Register                    */
  __IOM uint32_t  CONTROL7;                     /*!< (@ 0x000001EC) DMA Channel 0 Control Register                             */
  __IOM uint32_t  CONFIG7;                      /*!< (@ 0x000001F0) DMA Channel 0 Configuration Register[1]                    */
} LPC_GPDMA_Type;                               /*!< Size = 500 (0x1f4)                                                        */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB device/host/OTG controller (USB)
  */

