lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
typedef struct {                                /*!< (@ 0x50008000) USB Structure                                              */
  __IM  uint32_t  RESERVED[55];
  __IM  uint32_t  RXPLEN;                       /*!< (@ 0x000000DC) USB Receive Packet Length                                  */
  __IM  uint32_t  RESERVED1[8];
  __IM  uint32_t  INTST;                        /*!< (@ 0x00000100) OTG Interrupt Status                                       */
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000104) OTG Interrupt Enable                                       */
  __OM  uint32_t  INTSET;                       /*!< (@ 0x00000108) OTG Interrupt Set                                          */
  __OM  uint32_t  INTCLR;                       /*!< (@ 0x0000010C) OTG Interrupt Clear                                        */
  __IOM uint32_t  STCTRL;                       /*!< (@ 0x00000110) OTG Status and Control and USB port select                 */
  __IOM uint32_t  TMR;                          /*!< (@ 0x00000114) OTG Timer                                                  */
  __IM  uint32_t  RESERVED2[58];
  __IM  uint32_t  DEVINTST;                     /*!< (@ 0x00000200) USB Device Interrupt Status                                */
  __IOM uint32_t  DEVINTEN;                     /*!< (@ 0x00000204) USB Device Interrupt Enable                                */
  __OM  uint32_t  DEVINTCLR;                    /*!< (@ 0x00000208) USB Device Interrupt Clear                                 */
  __OM  uint32_t  DEVINTSET;                    /*!< (@ 0x0000020C) USB Device Interrupt Set                                   */
  __OM  uint32_t  CMDCODE;                      /*!< (@ 0x00000210) USB Command Code                                           */
  __IM  uint32_t  CMDDATA;                      /*!< (@ 0x00000214) USB Command Data                                           */
  __IM  uint32_t  RXDATA;                       /*!< (@ 0x00000218) USB Receive Data                                           */
  __OM  uint32_t  TXDATA;                       /*!< (@ 0x0000021C) USB Transmit Data                                          */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  TXPLEN;                       /*!< (@ 0x00000224) USB Transmit Packet Length                                 */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000228) USB Control                                                */
  __OM  uint32_t  DEVINTPRI;                    /*!< (@ 0x0000022C) USB Device Interrupt Priority                              */
  __IM  uint32_t  EPINTST;                      /*!< (@ 0x00000230) USB Endpoint Interrupt Status                              */
  __IOM uint32_t  EPINTEN;                      /*!< (@ 0x00000234) USB Endpoint Interrupt Enable                              */
  __OM  uint32_t  EPINTCLR;                     /*!< (@ 0x00000238) USB Endpoint Interrupt Clear                               */
  __OM  uint32_t  EPINTSET;                     /*!< (@ 0x0000023C) USB Endpoint Interrupt Set                                 */
  __OM  uint32_t  EPINTPRI;                     /*!< (@ 0x00000240) USB Endpoint Priority                                      */
  __IOM uint32_t  REEP;                         /*!< (@ 0x00000244) USB Realize Endpoint                                       */
  __OM  uint32_t  EPIND;                        /*!< (@ 0x00000248) USB Endpoint Index                                         */
  __IOM uint32_t  MAXPSIZE;                     /*!< (@ 0x0000024C) USB MaxPacketSize                                          */
  __IM  uint32_t  DMARST;                       /*!< (@ 0x00000250) USB DMA Request Status                                     */
  __OM  uint32_t  DMARCLR;                      /*!< (@ 0x00000254) USB DMA Request Clear                                      */
  __OM  uint32_t  DMARSET;                      /*!< (@ 0x00000258) USB DMA Request Set                                        */
  __IM  uint32_t  RESERVED4[9];
  __IOM uint32_t  UDCAH;                        /*!< (@ 0x00000280) USB UDCA Head                                              */
  __IM  uint32_t  EPDMAST;                      /*!< (@ 0x00000284) USB Endpoint DMA Status                                    */
  __OM  uint32_t  EPDMAEN;                      /*!< (@ 0x00000288) USB Endpoint DMA Enable                                    */
  __OM  uint32_t  EPDMADIS;                     /*!< (@ 0x0000028C) USB Endpoint DMA Disable                                   */
  __IM  uint32_t  DMAINTST;                     /*!< (@ 0x00000290) USB DMA Interrupt Status                                   */
  __IOM uint32_t  DMAINTEN;                     /*!< (@ 0x00000294) USB DMA Interrupt Enable                                   */
  __IM  uint32_t  RESERVED5[2];
  __IM  uint32_t  EOTINTST;                     /*!< (@ 0x000002A0) USB End of Transfer Interrupt Status                       */
  __OM  uint32_t  EOTINTCLR;                    /*!< (@ 0x000002A4) USB End of Transfer Interrupt Clear                        */
  __OM  uint32_t  EOTINTSET;                    /*!< (@ 0x000002A8) USB End of Transfer Interrupt Set                          */
  __IM  uint32_t  NDDRINTST;                    /*!< (@ 0x000002AC) USB New DD Request Interrupt Status                        */
  __OM  uint32_t  NDDRINTCLR;                   /*!< (@ 0x000002B0) USB New DD Request Interrupt Clear                         */
  __OM  uint32_t  NDDRINTSET;                   /*!< (@ 0x000002B4) USB New DD Request Interrupt Set                           */
  __IM  uint32_t  SYSERRINTST;                  /*!< (@ 0x000002B8) USB System Error Interrupt Status                          */
  __OM  uint32_t  SYSERRINTCLR;                 /*!< (@ 0x000002BC) USB System Error Interrupt Clear                           */
  __OM  uint32_t  SYSERRINTSET;                 /*!< (@ 0x000002C0) USB System Error Interrupt Set                             */
  __IM  uint32_t  RESERVED6[15];
  
  union {
    __IM  uint32_t I2C_RX;                      /*!< (@ 0x00000300) I2C Receive                                                */
    __OM  uint32_t I2C_WO;                      /*!< (@ 0x00000300) I2C Transmit                                               */
  };
  __IM  uint32_t  I2C_STS;                      /*!< (@ 0x00000304) I2C Status                                                 */
  __IOM uint32_t  I2C_CTL;                      /*!< (@ 0x00000308) I2C Control                                                */
  __IOM uint32_t  I2C_CLKHI;                    /*!< (@ 0x0000030C) I2C Clock High                                             */
  __OM  uint32_t  I2C_CLKLO;                    /*!< (@ 0x00000310) I2C Clock Low                                              */
  __IM  uint32_t  RESERVED7[824];
  
  union {
    __IOM uint32_t USBCLKCTRL;                  /*!< (@ 0x00000FF4) USB Clock Control                                          */
    __IOM uint32_t OTGCLKCTRL;                  /*!< (@ 0x00000FF4) OTG clock controller                                       */
  };
  
  union {
    __IM  uint32_t USBCLKST;                    /*!< (@ 0x00000FF8) USB Clock Status                                           */
    __IM  uint32_t OTGCLKST;                    /*!< (@ 0x00000FF8) OTG clock status                                           */
  };
} LPC_USB_Type;                                 /*!< Size = 4092 (0xffc)                                                       */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose I/O (GPIO)
  */

typedef struct {                                /*!< (@ 0x2009C000) GPIO Structure                                             */
  __IOM uint32_t  DIR0;                         /*!< (@ 0x00000000) GPIO Port Direction control register.                      */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  MASK0;                        /*!< (@ 0x00000010) Mask register for Port.                                    */
  __IOM uint32_t  PIN0;                         /*!< (@ 0x00000014) Port Pin value register using FIOMASK.                     */
  __IOM uint32_t  SET0;                         /*!< (@ 0x00000018) Port Output Set register using FIOMASK.                    */
  __OM  uint32_t  CLR0;                         /*!< (@ 0x0000001C) Port Output Clear register using FIOMASK.                  */
  __IOM uint32_t  DIR1;                         /*!< (@ 0x00000020) GPIO Port Direction control register.                      */
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  MASK1;                        /*!< (@ 0x00000030) Mask register for Port.                                    */
  __IOM uint32_t  PIN1;                         /*!< (@ 0x00000034) Port Pin value register using FIOMASK.                     */
  __IOM uint32_t  SET1;                         /*!< (@ 0x00000038) Port Output Set register using FIOMASK.                    */
  __OM  uint32_t  CLR1;                         /*!< (@ 0x0000003C) Port Output Clear register using FIOMASK.                  */
  __IOM uint32_t  DIR2;                         /*!< (@ 0x00000040) GPIO Port Direction control register.                      */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  MASK2;                        /*!< (@ 0x00000050) Mask register for Port.                                    */
  __IOM uint32_t  PIN2;                         /*!< (@ 0x00000054) Port Pin value register using FIOMASK.                     */
  __IOM uint32_t  SET2;                         /*!< (@ 0x00000058) Port Output Set register using FIOMASK.                    */
  __OM  uint32_t  CLR2;                         /*!< (@ 0x0000005C) Port Output Clear register using FIOMASK.                  */
  __IOM uint32_t  DIR3;                         /*!< (@ 0x00000060) GPIO Port Direction control register.                      */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  MASK3;                        /*!< (@ 0x00000070) Mask register for Port.                                    */
  __IOM uint32_t  PIN3;                         /*!< (@ 0x00000074) Port Pin value register using FIOMASK.                     */
  __IOM uint32_t  SET3;                         /*!< (@ 0x00000078) Port Output Set register using FIOMASK.                    */
  __OM  uint32_t  CLR3;                         /*!< (@ 0x0000007C) Port Output Clear register using FIOMASK.                  */
  __IOM uint32_t  DIR4;                         /*!< (@ 0x00000080) GPIO Port Direction control register.                      */
  __IM  uint32_t  RESERVED4[3];
  __IOM uint32_t  MASK4;                        /*!< (@ 0x00000090) Mask register for Port.                                    */
  __IOM uint32_t  PIN4;                         /*!< (@ 0x00000094) Port Pin value register using FIOMASK.                     */
  __IOM uint32_t  SET4;                         /*!< (@ 0x00000098) Port Output Set register using FIOMASK.                    */
  __OM  uint32_t  CLR4;                         /*!< (@ 0x0000009C) Port Output Clear register using FIOMASK.                  */
} LPC_GPIO_Type;                                /*!< Size = 160 (0xa0)                                                         */


