lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define LPC_WDT_BASE                0x40000000UL
#define LPC_TIMER0_BASE             0x40004000UL
#define LPC_TIMER1_BASE             0x40008000UL
#define LPC_UART0_BASE              0x4000C000UL
#define LPC_UART1_BASE              0x40010000UL
#define LPC_PWM1_BASE               0x40018000UL
#define LPC_I2C0_BASE               0x4001C000UL
#define LPC_SPI_BASE                0x40020000UL
#define LPC_RTC_BASE                0x40024000UL
#define LPC_GPIOINT_BASE            0x40028080UL
#define LPC_PINCONNECT_BASE         0x4002C000UL
#define LPC_SSP1_BASE               0x40030000UL
#define LPC_ADC_BASE                0x40034000UL
#define LPC_CANAFRAM_BASE           0x40038000UL
#define LPC_CANAF_BASE              0x4003C000UL
#define LPC_CCAN_BASE               0x40040000UL
#define LPC_CAN1_BASE               0x40044000UL
#define LPC_CAN2_BASE               0x40048000UL
#define LPC_I2C1_BASE               0x4005C000UL
#define LPC_SSP0_BASE               0x40088000UL
#define LPC_DAC_BASE                0x4008C000UL
#define LPC_TIMER2_BASE             0x40090000UL
#define LPC_TIMER3_BASE             0x40094000UL
#define LPC_UART2_BASE              0x40098000UL
#define LPC_UART3_BASE              0x4009C000UL
#define LPC_I2C2_BASE               0x400A0000UL
#define LPC_I2S_BASE                0x400A8000UL
#define LPC_RITIMER_BASE            0x400B0000UL
#define LPC_MCPWM_BASE              0x400B8000UL
#define LPC_QEI_BASE                0x400BC000UL
#define LPC_SYSCON_BASE             0x400FC000UL
#define LPC_EMAC_BASE               0x50000000UL
#define LPC_GPDMA_BASE              0x50004000UL
#define LPC_USB_BASE                0x50008000UL
#define LPC_GPIO_BASE               0x2009C000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define LPC_WDT                     ((LPC_WDT_Type*)           LPC_WDT_BASE)
#define LPC_TIMER0                  ((LPC_TIMER0_Type*)        LPC_TIMER0_BASE)
#define LPC_TIMER1                  ((LPC_TIMER1_Type*)        LPC_TIMER1_BASE)
#define LPC_UART0                   ((LPC_UART0_Type*)         LPC_UART0_BASE)
#define LPC_UART1                   ((LPC_UART1_Type*)         LPC_UART1_BASE)
#define LPC_PWM1                    ((LPC_PWM1_Type*)          LPC_PWM1_BASE)
#define LPC_I2C0                    ((LPC_I2C0_Type*)          LPC_I2C0_BASE)
#define LPC_SPI                     ((LPC_SPI_Type*)           LPC_SPI_BASE)
#define LPC_RTC                     ((LPC_RTC_Type*)           LPC_RTC_BASE)
#define LPC_GPIOINT                 ((LPC_GPIOINT_Type*)       LPC_GPIOINT_BASE)
#define LPC_PINCONNECT              ((LPC_PINCONNECT_Type*)    LPC_PINCONNECT_BASE)
#define LPC_SSP1                    ((LPC_SSP1_Type*)          LPC_SSP1_BASE)
#define LPC_ADC                     ((LPC_ADC_Type*)           LPC_ADC_BASE)
#define LPC_CANAFRAM                ((LPC_CANAFRAM_Type*)      LPC_CANAFRAM_BASE)
#define LPC_CANAF                   ((LPC_CANAF_Type*)         LPC_CANAF_BASE)
#define LPC_CCAN                    ((LPC_CCAN_Type*)          LPC_CCAN_BASE)
#define LPC_CAN1                    ((LPC_CAN1_Type*)          LPC_CAN1_BASE)
#define LPC_CAN2                    ((LPC_CAN2_Type*)          LPC_CAN2_BASE)
#define LPC_I2C1                    ((LPC_I2C0_Type*)          LPC_I2C1_BASE)
#define LPC_SSP0                    ((LPC_SSP0_Type*)          LPC_SSP0_BASE)
#define LPC_DAC                     ((LPC_DAC_Type*)           LPC_DAC_BASE)
#define LPC_TIMER2                  ((LPC_TIMER2_Type*)        LPC_TIMER2_BASE)
#define LPC_TIMER3                  ((LPC_TIMER3_Type*)        LPC_TIMER3_BASE)
#define LPC_UART2                   ((LPC_UART2_Type*)         LPC_UART2_BASE)
#define LPC_UART3                   ((LPC_UART3_Type*)         LPC_UART3_BASE)
#define LPC_I2C2                    ((LPC_I2C0_Type*)          LPC_I2C2_BASE)
#define LPC_I2S                     ((LPC_I2S_Type*)           LPC_I2S_BASE)
#define LPC_RITIMER                 ((LPC_RITIMER_Type*)       LPC_RITIMER_BASE)
#define LPC_MCPWM                   ((LPC_MCPWM_Type*)         LPC_MCPWM_BASE)
#define LPC_QEI                     ((LPC_QEI_Type*)           LPC_QEI_BASE)
#define LPC_SYSCON                  ((LPC_SYSCON_Type*)        LPC_SYSCON_BASE)
#define LPC_EMAC                    ((LPC_EMAC_Type*)          LPC_EMAC_BASE)
#define LPC_GPDMA                   ((LPC_GPDMA_Type*)         LPC_GPDMA_BASE)
#define LPC_USB                     ((LPC_USB_Type*)           LPC_USB_BASE)
#define LPC_GPIO                    ((LPC_GPIO_Type*)          LPC_GPIO_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          LPC_WDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  MOD  ========================================================== */
#define WDT_MOD_WDEN_Pos                  (0UL)                     /*!< WDEN (Bit 0)                                          */
#define WDT_MOD_WDEN_Msk                  (0x1UL)                   /*!< WDEN (Bitfield-Mask: 0x01)                            */
#define WDT_MOD_WDRESET_Pos               (1UL)                     /*!< WDRESET (Bit 1)                                       */
#define WDT_MOD_WDRESET_Msk               (0x2UL)                   /*!< WDRESET (Bitfield-Mask: 0x01)                         */
#define WDT_MOD_WDTOF_Pos                 (2UL)                     /*!< WDTOF (Bit 2)                                         */
#define WDT_MOD_WDTOF_Msk                 (0x4UL)                   /*!< WDTOF (Bitfield-Mask: 0x01)                           */
#define WDT_MOD_WDINT_Pos                 (3UL)                     /*!< WDINT (Bit 3)                                         */
#define WDT_MOD_WDINT_Msk                 (0x8UL)                   /*!< WDINT (Bitfield-Mask: 0x01)                           */
/* ==========================================================  TC  =========================================================== */
#define WDT_TC_Count_Pos                  (0UL)                     /*!< Count (Bit 0)                                         */
#define WDT_TC_Count_Msk                  (0xffffffffUL)            /*!< Count (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  FEED  ========================================================== */
#define WDT_FEED_Feed_Pos                 (0UL)                     /*!< Feed (Bit 0)                                          */
#define WDT_FEED_Feed_Msk                 (0xffUL)                  /*!< Feed (Bitfield-Mask: 0xff)                            */
/* ==========================================================  TV  =========================================================== */
#define WDT_TV_Count_Pos                  (0UL)                     /*!< Count (Bit 0)                                         */
#define WDT_TV_Count_Msk                  (0xffffffffUL)            /*!< Count (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CLKSEL  ========================================================= */
#define WDT_CLKSEL_CLKSEL_Pos             (0UL)                     /*!< CLKSEL (Bit 0)                                        */
#define WDT_CLKSEL_CLKSEL_Msk             (0x3UL)                   /*!< CLKSEL (Bitfield-Mask: 0x03)                          */
#define WDT_CLKSEL_LOCK_Pos               (31UL)                    /*!< LOCK (Bit 31)                                         */
#define WDT_CLKSEL_LOCK_Msk               (0x80000000UL)            /*!< LOCK (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                        LPC_TIMER0                                         ================ */
/* =========================================================================================================================== */

