lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  IR  =========================================================== */
#define TIMER0_IR_MR0INT_Pos              (0UL)                     /*!< MR0INT (Bit 0)                                        */
#define TIMER0_IR_MR0INT_Msk              (0x1UL)                   /*!< MR0INT (Bitfield-Mask: 0x01)                          */
#define TIMER0_IR_MR1INT_Pos              (1UL)                     /*!< MR1INT (Bit 1)                                        */
#define TIMER0_IR_MR1INT_Msk              (0x2UL)                   /*!< MR1INT (Bitfield-Mask: 0x01)                          */
#define TIMER0_IR_MR2INT_Pos              (2UL)                     /*!< MR2INT (Bit 2)                                        */
#define TIMER0_IR_MR2INT_Msk              (0x4UL)                   /*!< MR2INT (Bitfield-Mask: 0x01)                          */
#define TIMER0_IR_MR3INT_Pos              (3UL)                     /*!< MR3INT (Bit 3)                                        */
#define TIMER0_IR_MR3INT_Msk              (0x8UL)                   /*!< MR3INT (Bitfield-Mask: 0x01)                          */
#define TIMER0_IR_CR0INT_Pos              (4UL)                     /*!< CR0INT (Bit 4)                                        */
#define TIMER0_IR_CR0INT_Msk              (0x10UL)                  /*!< CR0INT (Bitfield-Mask: 0x01)                          */
#define TIMER0_IR_CR1INT_Pos              (5UL)                     /*!< CR1INT (Bit 5)                                        */
#define TIMER0_IR_CR1INT_Msk              (0x20UL)                  /*!< CR1INT (Bitfield-Mask: 0x01)                          */
/* ==========================================================  TCR  ========================================================== */
#define TIMER0_TCR_CEN_Pos                (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER0_TCR_CEN_Msk                (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
#define TIMER0_TCR_CRST_Pos               (1UL)                     /*!< CRST (Bit 1)                                          */
#define TIMER0_TCR_CRST_Msk               (0x2UL)                   /*!< CRST (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TC  =========================================================== */
#define TIMER0_TC_TC_Pos                  (0UL)                     /*!< TC (Bit 0)                                            */
#define TIMER0_TC_TC_Msk                  (0xffffffffUL)            /*!< TC (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  PR  =========================================================== */
#define TIMER0_PR_PM_Pos                  (0UL)                     /*!< PM (Bit 0)                                            */
#define TIMER0_PR_PM_Msk                  (0xffffffffUL)            /*!< PM (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  PC  =========================================================== */
#define TIMER0_PC_PC_Pos                  (0UL)                     /*!< PC (Bit 0)                                            */
#define TIMER0_PC_PC_Msk                  (0xffffffffUL)            /*!< PC (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  MCR  ========================================================== */
#define TIMER0_MCR_MR0I_Pos               (0UL)                     /*!< MR0I (Bit 0)                                          */
#define TIMER0_MCR_MR0I_Msk               (0x1UL)                   /*!< MR0I (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR0R_Pos               (1UL)                     /*!< MR0R (Bit 1)                                          */
#define TIMER0_MCR_MR0R_Msk               (0x2UL)                   /*!< MR0R (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR0S_Pos               (2UL)                     /*!< MR0S (Bit 2)                                          */
#define TIMER0_MCR_MR0S_Msk               (0x4UL)                   /*!< MR0S (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR1I_Pos               (3UL)                     /*!< MR1I (Bit 3)                                          */
#define TIMER0_MCR_MR1I_Msk               (0x8UL)                   /*!< MR1I (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR1R_Pos               (4UL)                     /*!< MR1R (Bit 4)                                          */
#define TIMER0_MCR_MR1R_Msk               (0x10UL)                  /*!< MR1R (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR1S_Pos               (5UL)                     /*!< MR1S (Bit 5)                                          */
#define TIMER0_MCR_MR1S_Msk               (0x20UL)                  /*!< MR1S (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR2I_Pos               (6UL)                     /*!< MR2I (Bit 6)                                          */
#define TIMER0_MCR_MR2I_Msk               (0x40UL)                  /*!< MR2I (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR2R_Pos               (7UL)                     /*!< MR2R (Bit 7)                                          */
#define TIMER0_MCR_MR2R_Msk               (0x80UL)                  /*!< MR2R (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR2S_Pos               (8UL)                     /*!< MR2S (Bit 8)                                          */
#define TIMER0_MCR_MR2S_Msk               (0x100UL)                 /*!< MR2S (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR3I_Pos               (9UL)                     /*!< MR3I (Bit 9)                                          */
#define TIMER0_MCR_MR3I_Msk               (0x200UL)                 /*!< MR3I (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR3R_Pos               (10UL)                    /*!< MR3R (Bit 10)                                         */
#define TIMER0_MCR_MR3R_Msk               (0x400UL)                 /*!< MR3R (Bitfield-Mask: 0x01)                            */
#define TIMER0_MCR_MR3S_Pos               (11UL)                    /*!< MR3S (Bit 11)                                         */
#define TIMER0_MCR_MR3S_Msk               (0x800UL)                 /*!< MR3S (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CCR  ========================================================== */
#define TIMER0_CCR_CAP0RE_Pos             (0UL)                     /*!< CAP0RE (Bit 0)                                        */
#define TIMER0_CCR_CAP0RE_Msk             (0x1UL)                   /*!< CAP0RE (Bitfield-Mask: 0x01)                          */
#define TIMER0_CCR_CAP0FE_Pos             (1UL)                     /*!< CAP0FE (Bit 1)                                        */
#define TIMER0_CCR_CAP0FE_Msk             (0x2UL)                   /*!< CAP0FE (Bitfield-Mask: 0x01)                          */
#define TIMER0_CCR_CAP0I_Pos              (2UL)                     /*!< CAP0I (Bit 2)                                         */
#define TIMER0_CCR_CAP0I_Msk              (0x4UL)                   /*!< CAP0I (Bitfield-Mask: 0x01)                           */
#define TIMER0_CCR_CAP1RE_Pos             (3UL)                     /*!< CAP1RE (Bit 3)                                        */
#define TIMER0_CCR_CAP1RE_Msk             (0x8UL)                   /*!< CAP1RE (Bitfield-Mask: 0x01)                          */
#define TIMER0_CCR_CAP1FE_Pos             (4UL)                     /*!< CAP1FE (Bit 4)                                        */
#define TIMER0_CCR_CAP1FE_Msk             (0x10UL)                  /*!< CAP1FE (Bitfield-Mask: 0x01)                          */
#define TIMER0_CCR_CAP1I_Pos              (5UL)                     /*!< CAP1I (Bit 5)                                         */
#define TIMER0_CCR_CAP1I_Msk              (0x20UL)                  /*!< CAP1I (Bitfield-Mask: 0x01)                           */
/* ==========================================================  EMR  ========================================================== */
#define TIMER0_EMR_EM0_Pos                (0UL)                     /*!< EM0 (Bit 0)                                           */
#define TIMER0_EMR_EM0_Msk                (0x1UL)                   /*!< EM0 (Bitfield-Mask: 0x01)                             */
#define TIMER0_EMR_EM1_Pos                (1UL)                     /*!< EM1 (Bit 1)                                           */
#define TIMER0_EMR_EM1_Msk                (0x2UL)                   /*!< EM1 (Bitfield-Mask: 0x01)                             */
#define TIMER0_EMR_EM2_Pos                (2UL)                     /*!< EM2 (Bit 2)                                           */
#define TIMER0_EMR_EM2_Msk                (0x4UL)                   /*!< EM2 (Bitfield-Mask: 0x01)                             */
#define TIMER0_EMR_EM3_Pos                (3UL)                     /*!< EM3 (Bit 3)                                           */
#define TIMER0_EMR_EM3_Msk                (0x8UL)                   /*!< EM3 (Bitfield-Mask: 0x01)                             */
#define TIMER0_EMR_EMC0_Pos               (4UL)                     /*!< EMC0 (Bit 4)                                          */
#define TIMER0_EMR_EMC0_Msk               (0x30UL)                  /*!< EMC0 (Bitfield-Mask: 0x03)                            */
#define TIMER0_EMR_EMC1_Pos               (6UL)                     /*!< EMC1 (Bit 6)                                          */
#define TIMER0_EMR_EMC1_Msk               (0xc0UL)                  /*!< EMC1 (Bitfield-Mask: 0x03)                            */
#define TIMER0_EMR_EMC2_Pos               (8UL)                     /*!< EMC2 (Bit 8)                                          */
#define TIMER0_EMR_EMC2_Msk               (0x300UL)                 /*!< EMC2 (Bitfield-Mask: 0x03)                            */
#define TIMER0_EMR_EMC3_Pos               (10UL)                    /*!< EMC3 (Bit 10)                                         */
#define TIMER0_EMR_EMC3_Msk               (0xc00UL)                 /*!< EMC3 (Bitfield-Mask: 0x03)                            */
/* =========================================================  CTCR  ========================================================== */
#define TIMER0_CTCR_CTMODE_Pos            (0UL)                     /*!< CTMODE (Bit 0)                                        */
#define TIMER0_CTCR_CTMODE_Msk            (0x3UL)                   /*!< CTMODE (Bitfield-Mask: 0x03)                          */
#define TIMER0_CTCR_CINSEL_Pos            (2UL)                     /*!< CINSEL (Bit 2)                                        */
#define TIMER0_CTCR_CINSEL_Msk            (0xcUL)                   /*!< CINSEL (Bitfield-Mask: 0x03)                          */


/* =========================================================================================================================== */
/* ================                                        LPC_TIMER1                                         ================ */
/* =========================================================================================================================== */

