lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  RBR  ========================================================== */
#define UART1_RBR_RBR_Pos                 (0UL)                     /*!< RBR (Bit 0)                                           */
#define UART1_RBR_RBR_Msk                 (0xffUL)                  /*!< RBR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  THR  ========================================================== */
#define UART1_THR_THR_Pos                 (0UL)                     /*!< THR (Bit 0)                                           */
#define UART1_THR_THR_Msk                 (0xffUL)                  /*!< THR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  DLL  ========================================================== */
#define UART1_DLL_DLLSB_Pos               (0UL)                     /*!< DLLSB (Bit 0)                                         */
#define UART1_DLL_DLLSB_Msk               (0xffUL)                  /*!< DLLSB (Bitfield-Mask: 0xff)                           */
/* ==========================================================  DLM  ========================================================== */
#define UART1_DLM_DLMSB_Pos               (0UL)                     /*!< DLMSB (Bit 0)                                         */
#define UART1_DLM_DLMSB_Msk               (0xffUL)                  /*!< DLMSB (Bitfield-Mask: 0xff)                           */
/* ==========================================================  IER  ========================================================== */
#define UART1_IER_RBRIE_Pos               (0UL)                     /*!< RBRIE (Bit 0)                                         */
#define UART1_IER_RBRIE_Msk               (0x1UL)                   /*!< RBRIE (Bitfield-Mask: 0x01)                           */
#define UART1_IER_THREIE_Pos              (1UL)                     /*!< THREIE (Bit 1)                                        */
#define UART1_IER_THREIE_Msk              (0x2UL)                   /*!< THREIE (Bitfield-Mask: 0x01)                          */
#define UART1_IER_RXIE_Pos                (2UL)                     /*!< RXIE (Bit 2)                                          */
#define UART1_IER_RXIE_Msk                (0x4UL)                   /*!< RXIE (Bitfield-Mask: 0x01)                            */
#define UART1_IER_MSIE_Pos                (3UL)                     /*!< MSIE (Bit 3)                                          */
#define UART1_IER_MSIE_Msk                (0x8UL)                   /*!< MSIE (Bitfield-Mask: 0x01)                            */
#define UART1_IER_CTSIE_Pos               (7UL)                     /*!< CTSIE (Bit 7)                                         */
#define UART1_IER_CTSIE_Msk               (0x80UL)                  /*!< CTSIE (Bitfield-Mask: 0x01)                           */
#define UART1_IER_ABEOIE_Pos              (8UL)                     /*!< ABEOIE (Bit 8)                                        */
#define UART1_IER_ABEOIE_Msk              (0x100UL)                 /*!< ABEOIE (Bitfield-Mask: 0x01)                          */
#define UART1_IER_ABTOIE_Pos              (9UL)                     /*!< ABTOIE (Bit 9)                                        */
#define UART1_IER_ABTOIE_Msk              (0x200UL)                 /*!< ABTOIE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  IIR  ========================================================== */
#define UART1_IIR_INTSTATUS_Pos           (0UL)                     /*!< INTSTATUS (Bit 0)                                     */
#define UART1_IIR_INTSTATUS_Msk           (0x1UL)                   /*!< INTSTATUS (Bitfield-Mask: 0x01)                       */
#define UART1_IIR_INTID_Pos               (1UL)                     /*!< INTID (Bit 1)                                         */
#define UART1_IIR_INTID_Msk               (0xeUL)                   /*!< INTID (Bitfield-Mask: 0x07)                           */
#define UART1_IIR_FIFOENABLE_Pos          (6UL)                     /*!< FIFOENABLE (Bit 6)                                    */
#define UART1_IIR_FIFOENABLE_Msk          (0xc0UL)                  /*!< FIFOENABLE (Bitfield-Mask: 0x03)                      */
#define UART1_IIR_ABEOINT_Pos             (8UL)                     /*!< ABEOINT (Bit 8)                                       */
#define UART1_IIR_ABEOINT_Msk             (0x100UL)                 /*!< ABEOINT (Bitfield-Mask: 0x01)                         */
#define UART1_IIR_ABTOINT_Pos             (9UL)                     /*!< ABTOINT (Bit 9)                                       */
#define UART1_IIR_ABTOINT_Msk             (0x200UL)                 /*!< ABTOINT (Bitfield-Mask: 0x01)                         */
/* ==========================================================  FCR  ========================================================== */
#define UART1_FCR_FIFOEN_Pos              (0UL)                     /*!< FIFOEN (Bit 0)                                        */
#define UART1_FCR_FIFOEN_Msk              (0x1UL)                   /*!< FIFOEN (Bitfield-Mask: 0x01)                          */
#define UART1_FCR_RXFIFORES_Pos           (1UL)                     /*!< RXFIFORES (Bit 1)                                     */
#define UART1_FCR_RXFIFORES_Msk           (0x2UL)                   /*!< RXFIFORES (Bitfield-Mask: 0x01)                       */
#define UART1_FCR_TXFIFORES_Pos           (2UL)                     /*!< TXFIFORES (Bit 2)                                     */
#define UART1_FCR_TXFIFORES_Msk           (0x4UL)                   /*!< TXFIFORES (Bitfield-Mask: 0x01)                       */
#define UART1_FCR_DMAMODE_Pos             (3UL)                     /*!< DMAMODE (Bit 3)                                       */
#define UART1_FCR_DMAMODE_Msk             (0x8UL)                   /*!< DMAMODE (Bitfield-Mask: 0x01)                         */
#define UART1_FCR_RXTRIGLVL_Pos           (6UL)                     /*!< RXTRIGLVL (Bit 6)                                     */
#define UART1_FCR_RXTRIGLVL_Msk           (0xc0UL)                  /*!< RXTRIGLVL (Bitfield-Mask: 0x03)                       */
/* ==========================================================  LCR  ========================================================== */
#define UART1_LCR_WLS_Pos                 (0UL)                     /*!< WLS (Bit 0)                                           */
#define UART1_LCR_WLS_Msk                 (0x3UL)                   /*!< WLS (Bitfield-Mask: 0x03)                             */
#define UART1_LCR_SBS_Pos                 (2UL)                     /*!< SBS (Bit 2)                                           */
#define UART1_LCR_SBS_Msk                 (0x4UL)                   /*!< SBS (Bitfield-Mask: 0x01)                             */
#define UART1_LCR_PE_Pos                  (3UL)                     /*!< PE (Bit 3)                                            */
#define UART1_LCR_PE_Msk                  (0x8UL)                   /*!< PE (Bitfield-Mask: 0x01)                              */
#define UART1_LCR_PS_Pos                  (4UL)                     /*!< PS (Bit 4)                                            */
#define UART1_LCR_PS_Msk                  (0x30UL)                  /*!< PS (Bitfield-Mask: 0x03)                              */
#define UART1_LCR_BC_Pos                  (6UL)                     /*!< BC (Bit 6)                                            */
#define UART1_LCR_BC_Msk                  (0x40UL)                  /*!< BC (Bitfield-Mask: 0x01)                              */
#define UART1_LCR_DLAB_Pos                (7UL)                     /*!< DLAB (Bit 7)                                          */
#define UART1_LCR_DLAB_Msk                (0x80UL)                  /*!< DLAB (Bitfield-Mask: 0x01)                            */
/* ==========================================================  MCR  ========================================================== */
#define UART1_MCR_DTRCTRL_Pos             (0UL)                     /*!< DTRCTRL (Bit 0)                                       */
#define UART1_MCR_DTRCTRL_Msk             (0x1UL)                   /*!< DTRCTRL (Bitfield-Mask: 0x01)                         */
#define UART1_MCR_RTSCTRL_Pos             (1UL)                     /*!< RTSCTRL (Bit 1)                                       */
#define UART1_MCR_RTSCTRL_Msk             (0x2UL)                   /*!< RTSCTRL (Bitfield-Mask: 0x01)                         */
#define UART1_MCR_LMS_Pos                 (4UL)                     /*!< LMS (Bit 4)                                           */
#define UART1_MCR_LMS_Msk                 (0x10UL)                  /*!< LMS (Bitfield-Mask: 0x01)                             */
#define UART1_MCR_RTSEN_Pos               (6UL)                     /*!< RTSEN (Bit 6)                                         */
#define UART1_MCR_RTSEN_Msk               (0x40UL)                  /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UART1_MCR_CTSEN_Pos               (7UL)                     /*!< CTSEN (Bit 7)                                         */
#define UART1_MCR_CTSEN_Msk               (0x80UL)                  /*!< CTSEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  LSR  ========================================================== */
#define UART1_LSR_RDR_Pos                 (0UL)                     /*!< RDR (Bit 0)                                           */
#define UART1_LSR_RDR_Msk                 (0x1UL)                   /*!< RDR (Bitfield-Mask: 0x01)                             */
#define UART1_LSR_OE_Pos                  (1UL)                     /*!< OE (Bit 1)                                            */
#define UART1_LSR_OE_Msk                  (0x2UL)                   /*!< OE (Bitfield-Mask: 0x01)                              */
#define UART1_LSR_PE_Pos                  (2UL)                     /*!< PE (Bit 2)                                            */
#define UART1_LSR_PE_Msk                  (0x4UL)                   /*!< PE (Bitfield-Mask: 0x01)                              */
#define UART1_LSR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UART1_LSR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UART1_LSR_BI_Pos                  (4UL)                     /*!< BI (Bit 4)                                            */
#define UART1_LSR_BI_Msk                  (0x10UL)                  /*!< BI (Bitfield-Mask: 0x01)                              */
#define UART1_LSR_THRE_Pos                (5UL)                     /*!< THRE (Bit 5)                                          */
#define UART1_LSR_THRE_Msk                (0x20UL)                  /*!< THRE (Bitfield-Mask: 0x01)                            */
#define UART1_LSR_TEMT_Pos                (6UL)                     /*!< TEMT (Bit 6)                                          */
#define UART1_LSR_TEMT_Msk                (0x40UL)                  /*!< TEMT (Bitfield-Mask: 0x01)                            */
#define UART1_LSR_RXFE_Pos                (7UL)                     /*!< RXFE (Bit 7)                                          */
#define UART1_LSR_RXFE_Msk                (0x80UL)                  /*!< RXFE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  MSR  ========================================================== */
#define UART1_MSR_DCTS_Pos                (0UL)                     /*!< DCTS (Bit 0)                                          */
#define UART1_MSR_DCTS_Msk                (0x1UL)                   /*!< DCTS (Bitfield-Mask: 0x01)                            */
#define UART1_MSR_DDSR_Pos                (1UL)                     /*!< DDSR (Bit 1)                                          */
#define UART1_MSR_DDSR_Msk                (0x2UL)                   /*!< DDSR (Bitfield-Mask: 0x01)                            */
#define UART1_MSR_TERI_Pos                (2UL)                     /*!< TERI (Bit 2)                                          */
#define UART1_MSR_TERI_Msk                (0x4UL)                   /*!< TERI (Bitfield-Mask: 0x01)                            */
#define UART1_MSR_DDCD_Pos                (3UL)                     /*!< DDCD (Bit 3)                                          */
#define UART1_MSR_DDCD_Msk                (0x8UL)                   /*!< DDCD (Bitfield-Mask: 0x01)                            */
#define UART1_MSR_CTS_Pos                 (4UL)                     /*!< CTS (Bit 4)                                           */
#define UART1_MSR_CTS_Msk                 (0x10UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UART1_MSR_DSR_Pos                 (5UL)                     /*!< DSR (Bit 5)                                           */
#define UART1_MSR_DSR_Msk                 (0x20UL)                  /*!< DSR (Bitfield-Mask: 0x01)                             */
#define UART1_MSR_RI_Pos                  (6UL)                     /*!< RI (Bit 6)                                            */
#define UART1_MSR_RI_Msk                  (0x40UL)                  /*!< RI (Bitfield-Mask: 0x01)                              */
#define UART1_MSR_DCD_Pos                 (7UL)                     /*!< DCD (Bit 7)                                           */
#define UART1_MSR_DCD_Msk                 (0x80UL)                  /*!< DCD (Bitfield-Mask: 0x01)                             */
/* ==========================================================  SCR  ========================================================== */
#define UART1_SCR_Pad_Pos                 (0UL)                     /*!< Pad (Bit 0)                                           */
#define UART1_SCR_Pad_Msk                 (0xffUL)                  /*!< Pad (Bitfield-Mask: 0xff)                             */
/* ==========================================================  ACR  ========================================================== */
#define UART1_ACR_START_Pos               (0UL)                     /*!< START (Bit 0)                                         */
#define UART1_ACR_START_Msk               (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
#define UART1_ACR_MODE_Pos                (1UL)                     /*!< MODE (Bit 1)                                          */
#define UART1_ACR_MODE_Msk                (0x2UL)                   /*!< MODE (Bitfield-Mask: 0x01)                            */
#define UART1_ACR_AUTORESTART_Pos         (2UL)                     /*!< AUTORESTART (Bit 2)                                   */
#define UART1_ACR_AUTORESTART_Msk         (0x4UL)                   /*!< AUTORESTART (Bitfield-Mask: 0x01)                     */
#define UART1_ACR_ABEOINTCLR_Pos          (8UL)                     /*!< ABEOINTCLR (Bit 8)                                    */
#define UART1_ACR_ABEOINTCLR_Msk          (0x100UL)                 /*!< ABEOINTCLR (Bitfield-Mask: 0x01)                      */
#define UART1_ACR_ABTOINTCLR_Pos          (9UL)                     /*!< ABTOINTCLR (Bit 9)                                    */
#define UART1_ACR_ABTOINTCLR_Msk          (0x200UL)                 /*!< ABTOINTCLR (Bitfield-Mask: 0x01)                      */
/* ==========================================================  FDR  ========================================================== */
#define UART1_FDR_DIVADDVAL_Pos           (0UL)                     /*!< DIVADDVAL (Bit 0)                                     */
#define UART1_FDR_DIVADDVAL_Msk           (0xfUL)                   /*!< DIVADDVAL (Bitfield-Mask: 0x0f)                       */
#define UART1_FDR_MULVAL_Pos              (4UL)                     /*!< MULVAL (Bit 4)                                        */
#define UART1_FDR_MULVAL_Msk              (0xf0UL)                  /*!< MULVAL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  TER  ========================================================== */
#define UART1_TER_TXEN_Pos                (7UL)                     /*!< TXEN (Bit 7)                                          */
#define UART1_TER_TXEN_Msk                (0x80UL)                  /*!< TXEN (Bitfield-Mask: 0x01)                            */
/* =======================================================  RS485CTRL  ======================================================= */
#define UART1_RS485CTRL_NMMEN_Pos         (0UL)                     /*!< NMMEN (Bit 0)                                         */
#define UART1_RS485CTRL_NMMEN_Msk         (0x1UL)                   /*!< NMMEN (Bitfield-Mask: 0x01)                           */
#define UART1_RS485CTRL_RXDIS_Pos         (1UL)                     /*!< RXDIS (Bit 1)                                         */
#define UART1_RS485CTRL_RXDIS_Msk         (0x2UL)                   /*!< RXDIS (Bitfield-Mask: 0x01)                           */
#define UART1_RS485CTRL_AADEN_Pos         (2UL)                     /*!< AADEN (Bit 2)                                         */
#define UART1_RS485CTRL_AADEN_Msk         (0x4UL)                   /*!< AADEN (Bitfield-Mask: 0x01)                           */
#define UART1_RS485CTRL_SEL_Pos           (3UL)                     /*!< SEL (Bit 3)                                           */
#define UART1_RS485CTRL_SEL_Msk           (0x8UL)                   /*!< SEL (Bitfield-Mask: 0x01)                             */
#define UART1_RS485CTRL_DCTRL_Pos         (4UL)                     /*!< DCTRL (Bit 4)                                         */
#define UART1_RS485CTRL_DCTRL_Msk         (0x10UL)                  /*!< DCTRL (Bitfield-Mask: 0x01)                           */
#define UART1_RS485CTRL_OINV_Pos          (5UL)                     /*!< OINV (Bit 5)                                          */
#define UART1_RS485CTRL_OINV_Msk          (0x20UL)                  /*!< OINV (Bitfield-Mask: 0x01)                            */
/* =====================================================  RS485ADRMATCH  ===================================================== */
#define UART1_RS485ADRMATCH_ADRMATCH_Pos  (0UL)                     /*!< ADRMATCH (Bit 0)                                      */
#define UART1_RS485ADRMATCH_ADRMATCH_Msk  (0xffUL)                  /*!< ADRMATCH (Bitfield-Mask: 0xff)                        */
/* =======================================================  RS485DLY  ======================================================== */
#define UART1_RS485DLY_DLY_Pos            (0UL)                     /*!< DLY (Bit 0)                                           */
#define UART1_RS485DLY_DLY_Msk            (0xffUL)                  /*!< DLY (Bitfield-Mask: 0xff)                             */


/* =========================================================================================================================== */
/* ================                                         LPC_PWM1                                          ================ */
/* =========================================================================================================================== */

