lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  IR  =========================================================== */
#define PWM1_IR_PWMMR0INT_Pos             (0UL)                     /*!< PWMMR0INT (Bit 0)                                     */
#define PWM1_IR_PWMMR0INT_Msk             (0x1UL)                   /*!< PWMMR0INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMMR1INT_Pos             (1UL)                     /*!< PWMMR1INT (Bit 1)                                     */
#define PWM1_IR_PWMMR1INT_Msk             (0x2UL)                   /*!< PWMMR1INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMMR2INT_Pos             (2UL)                     /*!< PWMMR2INT (Bit 2)                                     */
#define PWM1_IR_PWMMR2INT_Msk             (0x4UL)                   /*!< PWMMR2INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMMR3INT_Pos             (3UL)                     /*!< PWMMR3INT (Bit 3)                                     */
#define PWM1_IR_PWMMR3INT_Msk             (0x8UL)                   /*!< PWMMR3INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMCAP0INT_Pos            (4UL)                     /*!< PWMCAP0INT (Bit 4)                                    */
#define PWM1_IR_PWMCAP0INT_Msk            (0x10UL)                  /*!< PWMCAP0INT (Bitfield-Mask: 0x01)                      */
#define PWM1_IR_PWMCAP1INT_Pos            (5UL)                     /*!< PWMCAP1INT (Bit 5)                                    */
#define PWM1_IR_PWMCAP1INT_Msk            (0x20UL)                  /*!< PWMCAP1INT (Bitfield-Mask: 0x01)                      */
#define PWM1_IR_PWMMR4INT_Pos             (8UL)                     /*!< PWMMR4INT (Bit 8)                                     */
#define PWM1_IR_PWMMR4INT_Msk             (0x100UL)                 /*!< PWMMR4INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMMR5INT_Pos             (9UL)                     /*!< PWMMR5INT (Bit 9)                                     */
#define PWM1_IR_PWMMR5INT_Msk             (0x200UL)                 /*!< PWMMR5INT (Bitfield-Mask: 0x01)                       */
#define PWM1_IR_PWMMR6INT_Pos             (10UL)                    /*!< PWMMR6INT (Bit 10)                                    */
#define PWM1_IR_PWMMR6INT_Msk             (0x400UL)                 /*!< PWMMR6INT (Bitfield-Mask: 0x01)                       */
/* ==========================================================  TCR  ========================================================== */
#define PWM1_TCR_CE_Pos                   (0UL)                     /*!< CE (Bit 0)                                            */
#define PWM1_TCR_CE_Msk                   (0x1UL)                   /*!< CE (Bitfield-Mask: 0x01)                              */
#define PWM1_TCR_CR_Pos                   (1UL)                     /*!< CR (Bit 1)                                            */
#define PWM1_TCR_CR_Msk                   (0x2UL)                   /*!< CR (Bitfield-Mask: 0x01)                              */
#define PWM1_TCR_PWMEN_Pos                (3UL)                     /*!< PWMEN (Bit 3)                                         */
#define PWM1_TCR_PWMEN_Msk                (0x8UL)                   /*!< PWMEN (Bitfield-Mask: 0x01)                           */
#define PWM1_TCR_MDIS_Pos                 (4UL)                     /*!< MDIS (Bit 4)                                          */
#define PWM1_TCR_MDIS_Msk                 (0x10UL)                  /*!< MDIS (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TC  =========================================================== */
#define PWM1_TC_TC_Pos                    (0UL)                     /*!< TC (Bit 0)                                            */
#define PWM1_TC_TC_Msk                    (0xffffffffUL)            /*!< TC (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  PR  =========================================================== */
#define PWM1_PR_PM_Pos                    (0UL)                     /*!< PM (Bit 0)                                            */
#define PWM1_PR_PM_Msk                    (0xffffffffUL)            /*!< PM (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  PC  =========================================================== */
#define PWM1_PC_PC_Pos                    (0UL)                     /*!< PC (Bit 0)                                            */
#define PWM1_PC_PC_Msk                    (0xffffffffUL)            /*!< PC (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  MCR  ========================================================== */
#define PWM1_MCR_PWMMR0I_Pos              (0UL)                     /*!< PWMMR0I (Bit 0)                                       */
#define PWM1_MCR_PWMMR0I_Msk              (0x1UL)                   /*!< PWMMR0I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR0R_Pos              (1UL)                     /*!< PWMMR0R (Bit 1)                                       */
#define PWM1_MCR_PWMMR0R_Msk              (0x2UL)                   /*!< PWMMR0R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR0S_Pos              (2UL)                     /*!< PWMMR0S (Bit 2)                                       */
#define PWM1_MCR_PWMMR0S_Msk              (0x4UL)                   /*!< PWMMR0S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR1I_Pos              (3UL)                     /*!< PWMMR1I (Bit 3)                                       */
#define PWM1_MCR_PWMMR1I_Msk              (0x8UL)                   /*!< PWMMR1I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR1R_Pos              (4UL)                     /*!< PWMMR1R (Bit 4)                                       */
#define PWM1_MCR_PWMMR1R_Msk              (0x10UL)                  /*!< PWMMR1R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR1S_Pos              (5UL)                     /*!< PWMMR1S (Bit 5)                                       */
#define PWM1_MCR_PWMMR1S_Msk              (0x20UL)                  /*!< PWMMR1S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR2I_Pos              (6UL)                     /*!< PWMMR2I (Bit 6)                                       */
#define PWM1_MCR_PWMMR2I_Msk              (0x40UL)                  /*!< PWMMR2I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR2R_Pos              (7UL)                     /*!< PWMMR2R (Bit 7)                                       */
#define PWM1_MCR_PWMMR2R_Msk              (0x80UL)                  /*!< PWMMR2R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR2S_Pos              (8UL)                     /*!< PWMMR2S (Bit 8)                                       */
#define PWM1_MCR_PWMMR2S_Msk              (0x100UL)                 /*!< PWMMR2S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR3I_Pos              (9UL)                     /*!< PWMMR3I (Bit 9)                                       */
#define PWM1_MCR_PWMMR3I_Msk              (0x200UL)                 /*!< PWMMR3I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR3R_Pos              (10UL)                    /*!< PWMMR3R (Bit 10)                                      */
#define PWM1_MCR_PWMMR3R_Msk              (0x400UL)                 /*!< PWMMR3R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR3S_Pos              (11UL)                    /*!< PWMMR3S (Bit 11)                                      */
#define PWM1_MCR_PWMMR3S_Msk              (0x800UL)                 /*!< PWMMR3S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR4I_Pos              (12UL)                    /*!< PWMMR4I (Bit 12)                                      */
#define PWM1_MCR_PWMMR4I_Msk              (0x1000UL)                /*!< PWMMR4I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR4R_Pos              (13UL)                    /*!< PWMMR4R (Bit 13)                                      */
#define PWM1_MCR_PWMMR4R_Msk              (0x2000UL)                /*!< PWMMR4R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR4S_Pos              (14UL)                    /*!< PWMMR4S (Bit 14)                                      */
#define PWM1_MCR_PWMMR4S_Msk              (0x4000UL)                /*!< PWMMR4S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR5I_Pos              (15UL)                    /*!< PWMMR5I (Bit 15)                                      */
#define PWM1_MCR_PWMMR5I_Msk              (0x8000UL)                /*!< PWMMR5I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR5R_Pos              (16UL)                    /*!< PWMMR5R (Bit 16)                                      */
#define PWM1_MCR_PWMMR5R_Msk              (0x10000UL)               /*!< PWMMR5R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR5S_Pos              (17UL)                    /*!< PWMMR5S (Bit 17)                                      */
#define PWM1_MCR_PWMMR5S_Msk              (0x20000UL)               /*!< PWMMR5S (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR6I_Pos              (18UL)                    /*!< PWMMR6I (Bit 18)                                      */
#define PWM1_MCR_PWMMR6I_Msk              (0x40000UL)               /*!< PWMMR6I (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR6R_Pos              (19UL)                    /*!< PWMMR6R (Bit 19)                                      */
#define PWM1_MCR_PWMMR6R_Msk              (0x80000UL)               /*!< PWMMR6R (Bitfield-Mask: 0x01)                         */
#define PWM1_MCR_PWMMR6S_Pos              (20UL)                    /*!< PWMMR6S (Bit 20)                                      */
#define PWM1_MCR_PWMMR6S_Msk              (0x100000UL)              /*!< PWMMR6S (Bitfield-Mask: 0x01)                         */
/* ==========================================================  MR0  ========================================================== */
#define PWM1_MR0_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR0_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  MR1  ========================================================== */
#define PWM1_MR1_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR1_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  MR2  ========================================================== */
#define PWM1_MR2_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR2_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  MR3  ========================================================== */
#define PWM1_MR3_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR3_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  CCR  ========================================================== */
#define PWM1_CCR_CAP0_R_Pos               (0UL)                     /*!< CAP0_R (Bit 0)                                        */
#define PWM1_CCR_CAP0_R_Msk               (0x1UL)                   /*!< CAP0_R (Bitfield-Mask: 0x01)                          */
#define PWM1_CCR_CAP0_F_Pos               (1UL)                     /*!< CAP0_F (Bit 1)                                        */
#define PWM1_CCR_CAP0_F_Msk               (0x2UL)                   /*!< CAP0_F (Bitfield-Mask: 0x01)                          */
#define PWM1_CCR_CAP0_I_Pos               (2UL)                     /*!< CAP0_I (Bit 2)                                        */
#define PWM1_CCR_CAP0_I_Msk               (0x4UL)                   /*!< CAP0_I (Bitfield-Mask: 0x01)                          */
#define PWM1_CCR_CAP1_R_Pos               (3UL)                     /*!< CAP1_R (Bit 3)                                        */
#define PWM1_CCR_CAP1_R_Msk               (0x8UL)                   /*!< CAP1_R (Bitfield-Mask: 0x01)                          */
#define PWM1_CCR_CAP1_F_Pos               (4UL)                     /*!< CAP1_F (Bit 4)                                        */
#define PWM1_CCR_CAP1_F_Msk               (0x10UL)                  /*!< CAP1_F (Bitfield-Mask: 0x01)                          */
#define PWM1_CCR_CAP1_I_Pos               (5UL)                     /*!< CAP1_I (Bit 5)                                        */
#define PWM1_CCR_CAP1_I_Msk               (0x20UL)                  /*!< CAP1_I (Bitfield-Mask: 0x01)                          */
/* ==========================================================  MR4  ========================================================== */
#define PWM1_MR4_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR4_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  MR5  ========================================================== */
#define PWM1_MR5_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR5_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  MR6  ========================================================== */
#define PWM1_MR6_MATCH_Pos                (0UL)                     /*!< MATCH (Bit 0)                                         */
#define PWM1_MR6_MATCH_Msk                (0xffffffffUL)            /*!< MATCH (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  PCR  ========================================================== */
#define PWM1_PCR_PWMSEL2_Pos              (2UL)                     /*!< PWMSEL2 (Bit 2)                                       */
#define PWM1_PCR_PWMSEL2_Msk              (0x4UL)                   /*!< PWMSEL2 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMSEL3_Pos              (3UL)                     /*!< PWMSEL3 (Bit 3)                                       */
#define PWM1_PCR_PWMSEL3_Msk              (0x8UL)                   /*!< PWMSEL3 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMSEL4_Pos              (4UL)                     /*!< PWMSEL4 (Bit 4)                                       */
#define PWM1_PCR_PWMSEL4_Msk              (0x10UL)                  /*!< PWMSEL4 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMSEL5_Pos              (5UL)                     /*!< PWMSEL5 (Bit 5)                                       */
#define PWM1_PCR_PWMSEL5_Msk              (0x20UL)                  /*!< PWMSEL5 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMSEL6_Pos              (6UL)                     /*!< PWMSEL6 (Bit 6)                                       */
#define PWM1_PCR_PWMSEL6_Msk              (0x40UL)                  /*!< PWMSEL6 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA1_Pos              (9UL)                     /*!< PWMENA1 (Bit 9)                                       */
#define PWM1_PCR_PWMENA1_Msk              (0x200UL)                 /*!< PWMENA1 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA2_Pos              (10UL)                    /*!< PWMENA2 (Bit 10)                                      */
#define PWM1_PCR_PWMENA2_Msk              (0x400UL)                 /*!< PWMENA2 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA3_Pos              (11UL)                    /*!< PWMENA3 (Bit 11)                                      */
#define PWM1_PCR_PWMENA3_Msk              (0x800UL)                 /*!< PWMENA3 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA4_Pos              (12UL)                    /*!< PWMENA4 (Bit 12)                                      */
#define PWM1_PCR_PWMENA4_Msk              (0x1000UL)                /*!< PWMENA4 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA5_Pos              (13UL)                    /*!< PWMENA5 (Bit 13)                                      */
#define PWM1_PCR_PWMENA5_Msk              (0x2000UL)                /*!< PWMENA5 (Bitfield-Mask: 0x01)                         */
#define PWM1_PCR_PWMENA6_Pos              (14UL)                    /*!< PWMENA6 (Bit 14)                                      */
#define PWM1_PCR_PWMENA6_Msk              (0x4000UL)                /*!< PWMENA6 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  LER  ========================================================== */
#define PWM1_LER_MAT0LATCHEN_Pos          (0UL)                     /*!< MAT0LATCHEN (Bit 0)                                   */
#define PWM1_LER_MAT0LATCHEN_Msk          (0x1UL)                   /*!< MAT0LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT1LATCHEN_Pos          (1UL)                     /*!< MAT1LATCHEN (Bit 1)                                   */
#define PWM1_LER_MAT1LATCHEN_Msk          (0x2UL)                   /*!< MAT1LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT2LATCHEN_Pos          (2UL)                     /*!< MAT2LATCHEN (Bit 2)                                   */
#define PWM1_LER_MAT2LATCHEN_Msk          (0x4UL)                   /*!< MAT2LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT3LATCHEN_Pos          (3UL)                     /*!< MAT3LATCHEN (Bit 3)                                   */
#define PWM1_LER_MAT3LATCHEN_Msk          (0x8UL)                   /*!< MAT3LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT4LATCHEN_Pos          (4UL)                     /*!< MAT4LATCHEN (Bit 4)                                   */
#define PWM1_LER_MAT4LATCHEN_Msk          (0x10UL)                  /*!< MAT4LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT5LATCHEN_Pos          (5UL)                     /*!< MAT5LATCHEN (Bit 5)                                   */
#define PWM1_LER_MAT5LATCHEN_Msk          (0x20UL)                  /*!< MAT5LATCHEN (Bitfield-Mask: 0x01)                     */
#define PWM1_LER_MAT6LATCHEN_Pos          (6UL)                     /*!< MAT6LATCHEN (Bit 6)                                   */
#define PWM1_LER_MAT6LATCHEN_Msk          (0x40UL)                  /*!< MAT6LATCHEN (Bitfield-Mask: 0x01)                     */
/* =========================================================  CTCR  ========================================================== */
#define PWM1_CTCR_MOD_Pos                 (0UL)                     /*!< MOD (Bit 0)                                           */
#define PWM1_CTCR_MOD_Msk                 (0x3UL)                   /*!< MOD (Bitfield-Mask: 0x03)                             */
#define PWM1_CTCR_CIS_Pos                 (2UL)                     /*!< CIS (Bit 2)                                           */
#define PWM1_CTCR_CIS_Msk                 (0xcUL)                   /*!< CIS (Bitfield-Mask: 0x03)                             */


/* =========================================================================================================================== */
/* ================                                         LPC_I2C0                                          ================ */
/* =========================================================================================================================== */

