lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ========================================================  CONSET  ========================================================= */
#define I2C0_CONSET_AA_Pos                (2UL)                     /*!< AA (Bit 2)                                            */
#define I2C0_CONSET_AA_Msk                (0x4UL)                   /*!< AA (Bitfield-Mask: 0x01)                              */
#define I2C0_CONSET_SI_Pos                (3UL)                     /*!< SI (Bit 3)                                            */
#define I2C0_CONSET_SI_Msk                (0x8UL)                   /*!< SI (Bitfield-Mask: 0x01)                              */
#define I2C0_CONSET_STO_Pos               (4UL)                     /*!< STO (Bit 4)                                           */
#define I2C0_CONSET_STO_Msk               (0x10UL)                  /*!< STO (Bitfield-Mask: 0x01)                             */
#define I2C0_CONSET_STA_Pos               (5UL)                     /*!< STA (Bit 5)                                           */
#define I2C0_CONSET_STA_Msk               (0x20UL)                  /*!< STA (Bitfield-Mask: 0x01)                             */
#define I2C0_CONSET_I2EN_Pos              (6UL)                     /*!< I2EN (Bit 6)                                          */
#define I2C0_CONSET_I2EN_Msk              (0x40UL)                  /*!< I2EN (Bitfield-Mask: 0x01)                            */
/* =========================================================  STAT  ========================================================== */
#define I2C0_STAT_Status_Pos              (3UL)                     /*!< Status (Bit 3)                                        */
#define I2C0_STAT_Status_Msk              (0xf8UL)                  /*!< Status (Bitfield-Mask: 0x1f)                          */
/* ==========================================================  DAT  ========================================================== */
#define I2C0_DAT_Data_Pos                 (0UL)                     /*!< Data (Bit 0)                                          */
#define I2C0_DAT_Data_Msk                 (0xffUL)                  /*!< Data (Bitfield-Mask: 0xff)                            */
/* =========================================================  ADR0  ========================================================== */
#define I2C0_ADR0_GC_Pos                  (0UL)                     /*!< GC (Bit 0)                                            */
#define I2C0_ADR0_GC_Msk                  (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2C0_ADR0_Address_Pos             (1UL)                     /*!< Address (Bit 1)                                       */
#define I2C0_ADR0_Address_Msk             (0xfeUL)                  /*!< Address (Bitfield-Mask: 0x7f)                         */
/* =========================================================  SCLH  ========================================================== */
#define I2C0_SCLH_SCLH_Pos                (0UL)                     /*!< SCLH (Bit 0)                                          */
#define I2C0_SCLH_SCLH_Msk                (0xffffUL)                /*!< SCLH (Bitfield-Mask: 0xffff)                          */
/* =========================================================  SCLL  ========================================================== */
#define I2C0_SCLL_SCLL_Pos                (0UL)                     /*!< SCLL (Bit 0)                                          */
#define I2C0_SCLL_SCLL_Msk                (0xffffUL)                /*!< SCLL (Bitfield-Mask: 0xffff)                          */
/* ========================================================  CONCLR  ========================================================= */
#define I2C0_CONCLR_AAC_Pos               (2UL)                     /*!< AAC (Bit 2)                                           */
#define I2C0_CONCLR_AAC_Msk               (0x4UL)                   /*!< AAC (Bitfield-Mask: 0x01)                             */
#define I2C0_CONCLR_SIC_Pos               (3UL)                     /*!< SIC (Bit 3)                                           */
#define I2C0_CONCLR_SIC_Msk               (0x8UL)                   /*!< SIC (Bitfield-Mask: 0x01)                             */
#define I2C0_CONCLR_STAC_Pos              (5UL)                     /*!< STAC (Bit 5)                                          */
#define I2C0_CONCLR_STAC_Msk              (0x20UL)                  /*!< STAC (Bitfield-Mask: 0x01)                            */
#define I2C0_CONCLR_I2ENC_Pos             (6UL)                     /*!< I2ENC (Bit 6)                                         */
#define I2C0_CONCLR_I2ENC_Msk             (0x40UL)                  /*!< I2ENC (Bitfield-Mask: 0x01)                           */
/* ========================================================  MMCTRL  ========================================================= */
#define I2C0_MMCTRL_MM_ENA_Pos            (0UL)                     /*!< MM_ENA (Bit 0)                                        */
#define I2C0_MMCTRL_MM_ENA_Msk            (0x1UL)                   /*!< MM_ENA (Bitfield-Mask: 0x01)                          */
#define I2C0_MMCTRL_ENA_SCL_Pos           (1UL)                     /*!< ENA_SCL (Bit 1)                                       */
#define I2C0_MMCTRL_ENA_SCL_Msk           (0x2UL)                   /*!< ENA_SCL (Bitfield-Mask: 0x01)                         */
#define I2C0_MMCTRL_MATCH_ALL_Pos         (2UL)                     /*!< MATCH_ALL (Bit 2)                                     */
#define I2C0_MMCTRL_MATCH_ALL_Msk         (0x4UL)                   /*!< MATCH_ALL (Bitfield-Mask: 0x01)                       */
/* =========================================================  ADR1  ========================================================== */
#define I2C0_ADR1_GC_Pos                  (0UL)                     /*!< GC (Bit 0)                                            */
#define I2C0_ADR1_GC_Msk                  (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2C0_ADR1_Address_Pos             (1UL)                     /*!< Address (Bit 1)                                       */
#define I2C0_ADR1_Address_Msk             (0xfeUL)                  /*!< Address (Bitfield-Mask: 0x7f)                         */
/* =========================================================  ADR2  ========================================================== */
#define I2C0_ADR2_GC_Pos                  (0UL)                     /*!< GC (Bit 0)                                            */
#define I2C0_ADR2_GC_Msk                  (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2C0_ADR2_Address_Pos             (1UL)                     /*!< Address (Bit 1)                                       */
#define I2C0_ADR2_Address_Msk             (0xfeUL)                  /*!< Address (Bitfield-Mask: 0x7f)                         */
/* =========================================================  ADR3  ========================================================== */
#define I2C0_ADR3_GC_Pos                  (0UL)                     /*!< GC (Bit 0)                                            */
#define I2C0_ADR3_GC_Msk                  (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2C0_ADR3_Address_Pos             (1UL)                     /*!< Address (Bit 1)                                       */
#define I2C0_ADR3_Address_Msk             (0xfeUL)                  /*!< Address (Bitfield-Mask: 0x7f)                         */
/* ======================================================  DATA_BUFFER  ====================================================== */
#define I2C0_DATA_BUFFER_Data_Pos         (0UL)                     /*!< Data (Bit 0)                                          */
#define I2C0_DATA_BUFFER_Data_Msk         (0xffUL)                  /*!< Data (Bitfield-Mask: 0xff)                            */


/* =========================================================================================================================== */
/* ================                                          LPC_SPI                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define SPI_CR_BITENABLE_Pos              (2UL)                     /*!< BITENABLE (Bit 2)                                     */
#define SPI_CR_BITENABLE_Msk              (0x4UL)                   /*!< BITENABLE (Bitfield-Mask: 0x01)                       */
#define SPI_CR_CPHA_Pos                   (3UL)                     /*!< CPHA (Bit 3)                                          */
#define SPI_CR_CPHA_Msk                   (0x8UL)                   /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define SPI_CR_CPOL_Pos                   (4UL)                     /*!< CPOL (Bit 4)                                          */
#define SPI_CR_CPOL_Msk                   (0x10UL)                  /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SPI_CR_MSTR_Pos                   (5UL)                     /*!< MSTR (Bit 5)                                          */
#define SPI_CR_MSTR_Msk                   (0x20UL)                  /*!< MSTR (Bitfield-Mask: 0x01)                            */
#define SPI_CR_LSBF_Pos                   (6UL)                     /*!< LSBF (Bit 6)                                          */
#define SPI_CR_LSBF_Msk                   (0x40UL)                  /*!< LSBF (Bitfield-Mask: 0x01)                            */
#define SPI_CR_SPIE_Pos                   (7UL)                     /*!< SPIE (Bit 7)                                          */
#define SPI_CR_SPIE_Msk                   (0x80UL)                  /*!< SPIE (Bitfield-Mask: 0x01)                            */
#define SPI_CR_BITS_Pos                   (8UL)                     /*!< BITS (Bit 8)                                          */
#define SPI_CR_BITS_Msk                   (0xf00UL)                 /*!< BITS (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  SR  =========================================================== */
#define SPI_SR_ABRT_Pos                   (3UL)                     /*!< ABRT (Bit 3)                                          */
#define SPI_SR_ABRT_Msk                   (0x8UL)                   /*!< ABRT (Bitfield-Mask: 0x01)                            */
#define SPI_SR_MODF_Pos                   (4UL)                     /*!< MODF (Bit 4)                                          */
#define SPI_SR_MODF_Msk                   (0x10UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPI_SR_ROVR_Pos                   (5UL)                     /*!< ROVR (Bit 5)                                          */
#define SPI_SR_ROVR_Msk                   (0x20UL)                  /*!< ROVR (Bitfield-Mask: 0x01)                            */
#define SPI_SR_WCOL_Pos                   (6UL)                     /*!< WCOL (Bit 6)                                          */
#define SPI_SR_WCOL_Msk                   (0x40UL)                  /*!< WCOL (Bitfield-Mask: 0x01)                            */
#define SPI_SR_SPIF_Pos                   (7UL)                     /*!< SPIF (Bit 7)                                          */
#define SPI_SR_SPIF_Msk                   (0x80UL)                  /*!< SPIF (Bitfield-Mask: 0x01)                            */
/* ==========================================================  DR  =========================================================== */
#define SPI_DR_DATALOW_Pos                (0UL)                     /*!< DATALOW (Bit 0)                                       */
#define SPI_DR_DATALOW_Msk                (0xffUL)                  /*!< DATALOW (Bitfield-Mask: 0xff)                         */
#define SPI_DR_DATAHIGH_Pos               (8UL)                     /*!< DATAHIGH (Bit 8)                                      */
#define SPI_DR_DATAHIGH_Msk               (0xff00UL)                /*!< DATAHIGH (Bitfield-Mask: 0xff)                        */
/* ==========================================================  CCR  ========================================================== */
#define SPI_CCR_COUNTER_Pos               (0UL)                     /*!< COUNTER (Bit 0)                                       */
#define SPI_CCR_COUNTER_Msk               (0xffUL)                  /*!< COUNTER (Bitfield-Mask: 0xff)                         */
/* ==========================================================  INT  ========================================================== */
#define SPI_INT_SPIF_Pos                  (0UL)                     /*!< SPIF (Bit 0)                                          */
#define SPI_INT_SPIF_Msk                  (0x1UL)                   /*!< SPIF (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                          LPC_RTC                                          ================ */
/* =========================================================================================================================== */

