lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  ILR  ========================================================== */
#define RTC_ILR_RTCCIF_Pos                (0UL)                     /*!< RTCCIF (Bit 0)                                        */
#define RTC_ILR_RTCCIF_Msk                (0x1UL)                   /*!< RTCCIF (Bitfield-Mask: 0x01)                          */
#define RTC_ILR_RTCALF_Pos                (1UL)                     /*!< RTCALF (Bit 1)                                        */
#define RTC_ILR_RTCALF_Msk                (0x2UL)                   /*!< RTCALF (Bitfield-Mask: 0x01)                          */
/* ==========================================================  CCR  ========================================================== */
#define RTC_CCR_CLKEN_Pos                 (0UL)                     /*!< CLKEN (Bit 0)                                         */
#define RTC_CCR_CLKEN_Msk                 (0x1UL)                   /*!< CLKEN (Bitfield-Mask: 0x01)                           */
#define RTC_CCR_CTCRST_Pos                (1UL)                     /*!< CTCRST (Bit 1)                                        */
#define RTC_CCR_CTCRST_Msk                (0x2UL)                   /*!< CTCRST (Bitfield-Mask: 0x01)                          */
#define RTC_CCR_CCALEN_Pos                (4UL)                     /*!< CCALEN (Bit 4)                                        */
#define RTC_CCR_CCALEN_Msk                (0x10UL)                  /*!< CCALEN (Bitfield-Mask: 0x01)                          */
/* =========================================================  CIIR  ========================================================== */
#define RTC_CIIR_IMSEC_Pos                (0UL)                     /*!< IMSEC (Bit 0)                                         */
#define RTC_CIIR_IMSEC_Msk                (0x1UL)                   /*!< IMSEC (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMMIN_Pos                (1UL)                     /*!< IMMIN (Bit 1)                                         */
#define RTC_CIIR_IMMIN_Msk                (0x2UL)                   /*!< IMMIN (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMHOUR_Pos               (2UL)                     /*!< IMHOUR (Bit 2)                                        */
#define RTC_CIIR_IMHOUR_Msk               (0x4UL)                   /*!< IMHOUR (Bitfield-Mask: 0x01)                          */
#define RTC_CIIR_IMDOM_Pos                (3UL)                     /*!< IMDOM (Bit 3)                                         */
#define RTC_CIIR_IMDOM_Msk                (0x8UL)                   /*!< IMDOM (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMDOW_Pos                (4UL)                     /*!< IMDOW (Bit 4)                                         */
#define RTC_CIIR_IMDOW_Msk                (0x10UL)                  /*!< IMDOW (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMDOY_Pos                (5UL)                     /*!< IMDOY (Bit 5)                                         */
#define RTC_CIIR_IMDOY_Msk                (0x20UL)                  /*!< IMDOY (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMMON_Pos                (6UL)                     /*!< IMMON (Bit 6)                                         */
#define RTC_CIIR_IMMON_Msk                (0x40UL)                  /*!< IMMON (Bitfield-Mask: 0x01)                           */
#define RTC_CIIR_IMYEAR_Pos               (7UL)                     /*!< IMYEAR (Bit 7)                                        */
#define RTC_CIIR_IMYEAR_Msk               (0x80UL)                  /*!< IMYEAR (Bitfield-Mask: 0x01)                          */
/* ==========================================================  AMR  ========================================================== */
#define RTC_AMR_AMRSEC_Pos                (0UL)                     /*!< AMRSEC (Bit 0)                                        */
#define RTC_AMR_AMRSEC_Msk                (0x1UL)                   /*!< AMRSEC (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRMIN_Pos                (1UL)                     /*!< AMRMIN (Bit 1)                                        */
#define RTC_AMR_AMRMIN_Msk                (0x2UL)                   /*!< AMRMIN (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRHOUR_Pos               (2UL)                     /*!< AMRHOUR (Bit 2)                                       */
#define RTC_AMR_AMRHOUR_Msk               (0x4UL)                   /*!< AMRHOUR (Bitfield-Mask: 0x01)                         */
#define RTC_AMR_AMRDOM_Pos                (3UL)                     /*!< AMRDOM (Bit 3)                                        */
#define RTC_AMR_AMRDOM_Msk                (0x8UL)                   /*!< AMRDOM (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRDOW_Pos                (4UL)                     /*!< AMRDOW (Bit 4)                                        */
#define RTC_AMR_AMRDOW_Msk                (0x10UL)                  /*!< AMRDOW (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRDOY_Pos                (5UL)                     /*!< AMRDOY (Bit 5)                                        */
#define RTC_AMR_AMRDOY_Msk                (0x20UL)                  /*!< AMRDOY (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRMON_Pos                (6UL)                     /*!< AMRMON (Bit 6)                                        */
#define RTC_AMR_AMRMON_Msk                (0x40UL)                  /*!< AMRMON (Bitfield-Mask: 0x01)                          */
#define RTC_AMR_AMRYEAR_Pos               (7UL)                     /*!< AMRYEAR (Bit 7)                                       */
#define RTC_AMR_AMRYEAR_Msk               (0x80UL)                  /*!< AMRYEAR (Bitfield-Mask: 0x01)                         */
/* ========================================================  CTIME0  ========================================================= */
#define RTC_CTIME0_SECONDS_Pos            (0UL)                     /*!< SECONDS (Bit 0)                                       */
#define RTC_CTIME0_SECONDS_Msk            (0x3fUL)                  /*!< SECONDS (Bitfield-Mask: 0x3f)                         */
#define RTC_CTIME0_MINUTES_Pos            (8UL)                     /*!< MINUTES (Bit 8)                                       */
#define RTC_CTIME0_MINUTES_Msk            (0x3f00UL)                /*!< MINUTES (Bitfield-Mask: 0x3f)                         */
#define RTC_CTIME0_HOURS_Pos              (16UL)                    /*!< HOURS (Bit 16)                                        */
#define RTC_CTIME0_HOURS_Msk              (0x1f0000UL)              /*!< HOURS (Bitfield-Mask: 0x1f)                           */
#define RTC_CTIME0_DOW_Pos                (24UL)                    /*!< DOW (Bit 24)                                          */
#define RTC_CTIME0_DOW_Msk                (0x7000000UL)             /*!< DOW (Bitfield-Mask: 0x07)                             */
/* ========================================================  CTIME1  ========================================================= */
#define RTC_CTIME1_DOM_Pos                (0UL)                     /*!< DOM (Bit 0)                                           */
#define RTC_CTIME1_DOM_Msk                (0x1fUL)                  /*!< DOM (Bitfield-Mask: 0x1f)                             */
#define RTC_CTIME1_MONTH_Pos              (8UL)                     /*!< MONTH (Bit 8)                                         */
#define RTC_CTIME1_MONTH_Msk              (0xf00UL)                 /*!< MONTH (Bitfield-Mask: 0x0f)                           */
#define RTC_CTIME1_YEAR_Pos               (16UL)                    /*!< YEAR (Bit 16)                                         */
#define RTC_CTIME1_YEAR_Msk               (0xfff0000UL)             /*!< YEAR (Bitfield-Mask: 0xfff)                           */
/* ========================================================  CTIME2  ========================================================= */
#define RTC_CTIME2_DOY_Pos                (0UL)                     /*!< DOY (Bit 0)                                           */
#define RTC_CTIME2_DOY_Msk                (0xfffUL)                 /*!< DOY (Bitfield-Mask: 0xfff)                            */
/* ==========================================================  SEC  ========================================================== */
#define RTC_SEC_SECONDS_Pos               (0UL)                     /*!< SECONDS (Bit 0)                                       */
#define RTC_SEC_SECONDS_Msk               (0x3fUL)                  /*!< SECONDS (Bitfield-Mask: 0x3f)                         */
/* ==========================================================  MIN  ========================================================== */
#define RTC_MIN_MINUTES_Pos               (0UL)                     /*!< MINUTES (Bit 0)                                       */
#define RTC_MIN_MINUTES_Msk               (0x3fUL)                  /*!< MINUTES (Bitfield-Mask: 0x3f)                         */
/* ==========================================================  HRS  ========================================================== */
#define RTC_HRS_HOURS_Pos                 (0UL)                     /*!< HOURS (Bit 0)                                         */
#define RTC_HRS_HOURS_Msk                 (0x1fUL)                  /*!< HOURS (Bitfield-Mask: 0x1f)                           */
/* ==========================================================  DOM  ========================================================== */
#define RTC_DOM_DOM_Pos                   (0UL)                     /*!< DOM (Bit 0)                                           */
#define RTC_DOM_DOM_Msk                   (0x1fUL)                  /*!< DOM (Bitfield-Mask: 0x1f)                             */
/* ==========================================================  DOW  ========================================================== */
#define RTC_DOW_DOW_Pos                   (0UL)                     /*!< DOW (Bit 0)                                           */
#define RTC_DOW_DOW_Msk                   (0x7UL)                   /*!< DOW (Bitfield-Mask: 0x07)                             */
/* ==========================================================  DOY  ========================================================== */
#define RTC_DOY_DOY_Pos                   (0UL)                     /*!< DOY (Bit 0)                                           */
#define RTC_DOY_DOY_Msk                   (0x1ffUL)                 /*!< DOY (Bitfield-Mask: 0x1ff)                            */
/* =========================================================  MONTH  ========================================================= */
#define RTC_MONTH_MONTH_Pos               (0UL)                     /*!< MONTH (Bit 0)                                         */
#define RTC_MONTH_MONTH_Msk               (0xfUL)                   /*!< MONTH (Bitfield-Mask: 0x0f)                           */
/* =========================================================  YEAR  ========================================================== */
#define RTC_YEAR_YEAR_Pos                 (0UL)                     /*!< YEAR (Bit 0)                                          */
#define RTC_YEAR_YEAR_Msk                 (0xfffUL)                 /*!< YEAR (Bitfield-Mask: 0xfff)                           */
/* ======================================================  CALIBRATION  ====================================================== */
#define RTC_CALIBRATION_CALVAL_Pos        (0UL)                     /*!< CALVAL (Bit 0)                                        */
#define RTC_CALIBRATION_CALVAL_Msk        (0x1ffffUL)               /*!< CALVAL (Bitfield-Mask: 0x1ffff)                       */
#define RTC_CALIBRATION_CALDIR_Pos        (17UL)                    /*!< CALDIR (Bit 17)                                       */
#define RTC_CALIBRATION_CALDIR_Msk        (0x20000UL)               /*!< CALDIR (Bitfield-Mask: 0x01)                          */
/* ========================================================  GPREG0  ========================================================= */
#define RTC_GPREG0_GP_Pos                 (0UL)                     /*!< GP (Bit 0)                                            */
#define RTC_GPREG0_GP_Msk                 (0xffffffffUL)            /*!< GP (Bitfield-Mask: 0xffffffff)                        */
/* ========================================================  GPREG1  ========================================================= */
#define RTC_GPREG1_GP_Pos                 (0UL)                     /*!< GP (Bit 0)                                            */
#define RTC_GPREG1_GP_Msk                 (0xffffffffUL)            /*!< GP (Bitfield-Mask: 0xffffffff)                        */
/* ========================================================  GPREG2  ========================================================= */
#define RTC_GPREG2_GP_Pos                 (0UL)                     /*!< GP (Bit 0)                                            */
#define RTC_GPREG2_GP_Msk                 (0xffffffffUL)            /*!< GP (Bitfield-Mask: 0xffffffff)                        */
/* ========================================================  GPREG3  ========================================================= */
#define RTC_GPREG3_GP_Pos                 (0UL)                     /*!< GP (Bit 0)                                            */
#define RTC_GPREG3_GP_Msk                 (0xffffffffUL)            /*!< GP (Bitfield-Mask: 0xffffffff)                        */
/* ========================================================  GPREG4  ========================================================= */
#define RTC_GPREG4_GP_Pos                 (0UL)                     /*!< GP (Bit 0)                                            */
#define RTC_GPREG4_GP_Msk                 (0xffffffffUL)            /*!< GP (Bitfield-Mask: 0xffffffff)                        */
/* ========================================================  RTC_AUX  ======================================================== */
#define RTC_RTC_AUX_RTC_OSCF_Pos          (4UL)                     /*!< RTC_OSCF (Bit 4)                                      */
#define RTC_RTC_AUX_RTC_OSCF_Msk          (0x10UL)                  /*!< RTC_OSCF (Bitfield-Mask: 0x01)                        */
#define RTC_RTC_AUX_RTC_PDOUT_Pos         (6UL)                     /*!< RTC_PDOUT (Bit 6)                                     */
#define RTC_RTC_AUX_RTC_PDOUT_Msk         (0x40UL)                  /*!< RTC_PDOUT (Bitfield-Mask: 0x01)                       */
/* =======================================================  RTC_AUXEN  ======================================================= */
#define RTC_RTC_AUXEN_RTC_OSCFEN_Pos      (4UL)                     /*!< RTC_OSCFEN (Bit 4)                                    */
#define RTC_RTC_AUXEN_RTC_OSCFEN_Msk      (0x10UL)                  /*!< RTC_OSCFEN (Bitfield-Mask: 0x01)                      */
/* =========================================================  ASEC  ========================================================== */
#define RTC_ASEC_SECONDS_Pos              (0UL)                     /*!< SECONDS (Bit 0)                                       */
#define RTC_ASEC_SECONDS_Msk              (0x3fUL)                  /*!< SECONDS (Bitfield-Mask: 0x3f)                         */
/* =========================================================  AMIN  ========================================================== */
#define RTC_AMIN_MINUTES_Pos              (0UL)                     /*!< MINUTES (Bit 0)                                       */
#define RTC_AMIN_MINUTES_Msk              (0x3fUL)                  /*!< MINUTES (Bitfield-Mask: 0x3f)                         */
/* =========================================================  AHRS  ========================================================== */
#define RTC_AHRS_HOURS_Pos                (0UL)                     /*!< HOURS (Bit 0)                                         */
#define RTC_AHRS_HOURS_Msk                (0x1fUL)                  /*!< HOURS (Bitfield-Mask: 0x1f)                           */
/* =========================================================  ADOM  ========================================================== */
#define RTC_ADOM_DOM_Pos                  (0UL)                     /*!< DOM (Bit 0)                                           */
#define RTC_ADOM_DOM_Msk                  (0x1fUL)                  /*!< DOM (Bitfield-Mask: 0x1f)                             */
/* =========================================================  ADOW  ========================================================== */
#define RTC_ADOW_DOW_Pos                  (0UL)                     /*!< DOW (Bit 0)                                           */
#define RTC_ADOW_DOW_Msk                  (0x7UL)                   /*!< DOW (Bitfield-Mask: 0x07)                             */
/* =========================================================  ADOY  ========================================================== */
#define RTC_ADOY_DOY_Pos                  (0UL)                     /*!< DOY (Bit 0)                                           */
#define RTC_ADOY_DOY_Msk                  (0x1ffUL)                 /*!< DOY (Bitfield-Mask: 0x1ff)                            */
/* =========================================================  AMON  ========================================================== */
#define RTC_AMON_MONTH_Pos                (0UL)                     /*!< MONTH (Bit 0)                                         */
#define RTC_AMON_MONTH_Msk                (0xfUL)                   /*!< MONTH (Bitfield-Mask: 0x0f)                           */
/* =========================================================  AYRS  ========================================================== */
#define RTC_AYRS_YEAR_Pos                 (0UL)                     /*!< YEAR (Bit 0)                                          */
#define RTC_AYRS_YEAR_Msk                 (0xfffUL)                 /*!< YEAR (Bitfield-Mask: 0xfff)                           */


/* =========================================================================================================================== */
/* ================                                        LPC_GPIOINT                                        ================ */
/* =========================================================================================================================== */

