lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ========================================================  STATUS  ========================================================= */
#define GPIOINT_STATUS_P0INT_Pos          (0UL)                     /*!< P0INT (Bit 0)                                         */
#define GPIOINT_STATUS_P0INT_Msk          (0x1UL)                   /*!< P0INT (Bitfield-Mask: 0x01)                           */
#define GPIOINT_STATUS_P2INT_Pos          (2UL)                     /*!< P2INT (Bit 2)                                         */
#define GPIOINT_STATUS_P2INT_Msk          (0x4UL)                   /*!< P2INT (Bitfield-Mask: 0x01)                           */
/* ========================================================  STATR0  ========================================================= */
#define GPIOINT_STATR0_P0_0REI_Pos        (0UL)                     /*!< P0_0REI (Bit 0)                                       */
#define GPIOINT_STATR0_P0_0REI_Msk        (0x1UL)                   /*!< P0_0REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_1REI_Pos        (1UL)                     /*!< P0_1REI (Bit 1)                                       */
#define GPIOINT_STATR0_P0_1REI_Msk        (0x2UL)                   /*!< P0_1REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_2REI_Pos        (2UL)                     /*!< P0_2REI (Bit 2)                                       */
#define GPIOINT_STATR0_P0_2REI_Msk        (0x4UL)                   /*!< P0_2REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_3REI_Pos        (3UL)                     /*!< P0_3REI (Bit 3)                                       */
#define GPIOINT_STATR0_P0_3REI_Msk        (0x8UL)                   /*!< P0_3REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_4REI_Pos        (4UL)                     /*!< P0_4REI (Bit 4)                                       */
#define GPIOINT_STATR0_P0_4REI_Msk        (0x10UL)                  /*!< P0_4REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_5REI_Pos        (5UL)                     /*!< P0_5REI (Bit 5)                                       */
#define GPIOINT_STATR0_P0_5REI_Msk        (0x20UL)                  /*!< P0_5REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_6REI_Pos        (6UL)                     /*!< P0_6REI (Bit 6)                                       */
#define GPIOINT_STATR0_P0_6REI_Msk        (0x40UL)                  /*!< P0_6REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_7REI_Pos        (7UL)                     /*!< P0_7REI (Bit 7)                                       */
#define GPIOINT_STATR0_P0_7REI_Msk        (0x80UL)                  /*!< P0_7REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_8REI_Pos        (8UL)                     /*!< P0_8REI (Bit 8)                                       */
#define GPIOINT_STATR0_P0_8REI_Msk        (0x100UL)                 /*!< P0_8REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_9REI_Pos        (9UL)                     /*!< P0_9REI (Bit 9)                                       */
#define GPIOINT_STATR0_P0_9REI_Msk        (0x200UL)                 /*!< P0_9REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR0_P0_10REI_Pos       (10UL)                    /*!< P0_10REI (Bit 10)                                     */
#define GPIOINT_STATR0_P0_10REI_Msk       (0x400UL)                 /*!< P0_10REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_11REI_Pos       (11UL)                    /*!< P0_11REI (Bit 11)                                     */
#define GPIOINT_STATR0_P0_11REI_Msk       (0x800UL)                 /*!< P0_11REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_12REI_Pos       (12UL)                    /*!< P0_12REI (Bit 12)                                     */
#define GPIOINT_STATR0_P0_12REI_Msk       (0x1000UL)                /*!< P0_12REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_13REI_Pos       (13UL)                    /*!< P0_13REI (Bit 13)                                     */
#define GPIOINT_STATR0_P0_13REI_Msk       (0x2000UL)                /*!< P0_13REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_14REI_Pos       (14UL)                    /*!< P0_14REI (Bit 14)                                     */
#define GPIOINT_STATR0_P0_14REI_Msk       (0x4000UL)                /*!< P0_14REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_15REI_Pos       (15UL)                    /*!< P0_15REI (Bit 15)                                     */
#define GPIOINT_STATR0_P0_15REI_Msk       (0x8000UL)                /*!< P0_15REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_16REI_Pos       (16UL)                    /*!< P0_16REI (Bit 16)                                     */
#define GPIOINT_STATR0_P0_16REI_Msk       (0x10000UL)               /*!< P0_16REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_17REI_Pos       (17UL)                    /*!< P0_17REI (Bit 17)                                     */
#define GPIOINT_STATR0_P0_17REI_Msk       (0x20000UL)               /*!< P0_17REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_18REI_Pos       (18UL)                    /*!< P0_18REI (Bit 18)                                     */
#define GPIOINT_STATR0_P0_18REI_Msk       (0x40000UL)               /*!< P0_18REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_19REI_Pos       (19UL)                    /*!< P0_19REI (Bit 19)                                     */
#define GPIOINT_STATR0_P0_19REI_Msk       (0x80000UL)               /*!< P0_19REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_20REI_Pos       (20UL)                    /*!< P0_20REI (Bit 20)                                     */
#define GPIOINT_STATR0_P0_20REI_Msk       (0x100000UL)              /*!< P0_20REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_21REI_Pos       (21UL)                    /*!< P0_21REI (Bit 21)                                     */
#define GPIOINT_STATR0_P0_21REI_Msk       (0x200000UL)              /*!< P0_21REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_22REI_Pos       (22UL)                    /*!< P0_22REI (Bit 22)                                     */
#define GPIOINT_STATR0_P0_22REI_Msk       (0x400000UL)              /*!< P0_22REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_23REI_Pos       (23UL)                    /*!< P0_23REI (Bit 23)                                     */
#define GPIOINT_STATR0_P0_23REI_Msk       (0x800000UL)              /*!< P0_23REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_24REI_Pos       (24UL)                    /*!< P0_24REI (Bit 24)                                     */
#define GPIOINT_STATR0_P0_24REI_Msk       (0x1000000UL)             /*!< P0_24REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_25REI_Pos       (25UL)                    /*!< P0_25REI (Bit 25)                                     */
#define GPIOINT_STATR0_P0_25REI_Msk       (0x2000000UL)             /*!< P0_25REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_26REI_Pos       (26UL)                    /*!< P0_26REI (Bit 26)                                     */
#define GPIOINT_STATR0_P0_26REI_Msk       (0x4000000UL)             /*!< P0_26REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_27REI_Pos       (27UL)                    /*!< P0_27REI (Bit 27)                                     */
#define GPIOINT_STATR0_P0_27REI_Msk       (0x8000000UL)             /*!< P0_27REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_28REI_Pos       (28UL)                    /*!< P0_28REI (Bit 28)                                     */
#define GPIOINT_STATR0_P0_28REI_Msk       (0x10000000UL)            /*!< P0_28REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_29REI_Pos       (29UL)                    /*!< P0_29REI (Bit 29)                                     */
#define GPIOINT_STATR0_P0_29REI_Msk       (0x20000000UL)            /*!< P0_29REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR0_P0_30REI_Pos       (30UL)                    /*!< P0_30REI (Bit 30)                                     */
#define GPIOINT_STATR0_P0_30REI_Msk       (0x40000000UL)            /*!< P0_30REI (Bitfield-Mask: 0x01)                        */
/* ========================================================  STATF0  ========================================================= */
#define GPIOINT_STATF0_P0_0FEI_Pos        (0UL)                     /*!< P0_0FEI (Bit 0)                                       */
#define GPIOINT_STATF0_P0_0FEI_Msk        (0x1UL)                   /*!< P0_0FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_1FEI_Pos        (1UL)                     /*!< P0_1FEI (Bit 1)                                       */
#define GPIOINT_STATF0_P0_1FEI_Msk        (0x2UL)                   /*!< P0_1FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_2FEI_Pos        (2UL)                     /*!< P0_2FEI (Bit 2)                                       */
#define GPIOINT_STATF0_P0_2FEI_Msk        (0x4UL)                   /*!< P0_2FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_3FEI_Pos        (3UL)                     /*!< P0_3FEI (Bit 3)                                       */
#define GPIOINT_STATF0_P0_3FEI_Msk        (0x8UL)                   /*!< P0_3FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_4FEI_Pos        (4UL)                     /*!< P0_4FEI (Bit 4)                                       */
#define GPIOINT_STATF0_P0_4FEI_Msk        (0x10UL)                  /*!< P0_4FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_5FEI_Pos        (5UL)                     /*!< P0_5FEI (Bit 5)                                       */
#define GPIOINT_STATF0_P0_5FEI_Msk        (0x20UL)                  /*!< P0_5FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_6FEI_Pos        (6UL)                     /*!< P0_6FEI (Bit 6)                                       */
#define GPIOINT_STATF0_P0_6FEI_Msk        (0x40UL)                  /*!< P0_6FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_7FEI_Pos        (7UL)                     /*!< P0_7FEI (Bit 7)                                       */
#define GPIOINT_STATF0_P0_7FEI_Msk        (0x80UL)                  /*!< P0_7FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_8FEI_Pos        (8UL)                     /*!< P0_8FEI (Bit 8)                                       */
#define GPIOINT_STATF0_P0_8FEI_Msk        (0x100UL)                 /*!< P0_8FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_9FEI_Pos        (9UL)                     /*!< P0_9FEI (Bit 9)                                       */
#define GPIOINT_STATF0_P0_9FEI_Msk        (0x200UL)                 /*!< P0_9FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF0_P0_10FEI_Pos       (10UL)                    /*!< P0_10FEI (Bit 10)                                     */
#define GPIOINT_STATF0_P0_10FEI_Msk       (0x400UL)                 /*!< P0_10FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_11FEI_Pos       (11UL)                    /*!< P0_11FEI (Bit 11)                                     */
#define GPIOINT_STATF0_P0_11FEI_Msk       (0x800UL)                 /*!< P0_11FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_12FEI_Pos       (12UL)                    /*!< P0_12FEI (Bit 12)                                     */
#define GPIOINT_STATF0_P0_12FEI_Msk       (0x1000UL)                /*!< P0_12FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_13FEI_Pos       (13UL)                    /*!< P0_13FEI (Bit 13)                                     */
#define GPIOINT_STATF0_P0_13FEI_Msk       (0x2000UL)                /*!< P0_13FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_14FEI_Pos       (14UL)                    /*!< P0_14FEI (Bit 14)                                     */
#define GPIOINT_STATF0_P0_14FEI_Msk       (0x4000UL)                /*!< P0_14FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_15FEI_Pos       (15UL)                    /*!< P0_15FEI (Bit 15)                                     */
#define GPIOINT_STATF0_P0_15FEI_Msk       (0x8000UL)                /*!< P0_15FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_16FEI_Pos       (16UL)                    /*!< P0_16FEI (Bit 16)                                     */
#define GPIOINT_STATF0_P0_16FEI_Msk       (0x10000UL)               /*!< P0_16FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_17FEI_Pos       (17UL)                    /*!< P0_17FEI (Bit 17)                                     */
#define GPIOINT_STATF0_P0_17FEI_Msk       (0x20000UL)               /*!< P0_17FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_18FEI_Pos       (18UL)                    /*!< P0_18FEI (Bit 18)                                     */
#define GPIOINT_STATF0_P0_18FEI_Msk       (0x40000UL)               /*!< P0_18FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_19FEI_Pos       (19UL)                    /*!< P0_19FEI (Bit 19)                                     */
#define GPIOINT_STATF0_P0_19FEI_Msk       (0x80000UL)               /*!< P0_19FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_20FEI_Pos       (20UL)                    /*!< P0_20FEI (Bit 20)                                     */
#define GPIOINT_STATF0_P0_20FEI_Msk       (0x100000UL)              /*!< P0_20FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_21FEI_Pos       (21UL)                    /*!< P0_21FEI (Bit 21)                                     */
#define GPIOINT_STATF0_P0_21FEI_Msk       (0x200000UL)              /*!< P0_21FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_22FEI_Pos       (22UL)                    /*!< P0_22FEI (Bit 22)                                     */
#define GPIOINT_STATF0_P0_22FEI_Msk       (0x400000UL)              /*!< P0_22FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_23FEI_Pos       (23UL)                    /*!< P0_23FEI (Bit 23)                                     */
#define GPIOINT_STATF0_P0_23FEI_Msk       (0x800000UL)              /*!< P0_23FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_24FEI_Pos       (24UL)                    /*!< P0_24FEI (Bit 24)                                     */
#define GPIOINT_STATF0_P0_24FEI_Msk       (0x1000000UL)             /*!< P0_24FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_25FEI_Pos       (25UL)                    /*!< P0_25FEI (Bit 25)                                     */
#define GPIOINT_STATF0_P0_25FEI_Msk       (0x2000000UL)             /*!< P0_25FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_26FEI_Pos       (26UL)                    /*!< P0_26FEI (Bit 26)                                     */
#define GPIOINT_STATF0_P0_26FEI_Msk       (0x4000000UL)             /*!< P0_26FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_27FEI_Pos       (27UL)                    /*!< P0_27FEI (Bit 27)                                     */
#define GPIOINT_STATF0_P0_27FEI_Msk       (0x8000000UL)             /*!< P0_27FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_28FEI_Pos       (28UL)                    /*!< P0_28FEI (Bit 28)                                     */
#define GPIOINT_STATF0_P0_28FEI_Msk       (0x10000000UL)            /*!< P0_28FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_29FEI_Pos       (29UL)                    /*!< P0_29FEI (Bit 29)                                     */
#define GPIOINT_STATF0_P0_29FEI_Msk       (0x20000000UL)            /*!< P0_29FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF0_P0_30FEI_Pos       (30UL)                    /*!< P0_30FEI (Bit 30)                                     */
#define GPIOINT_STATF0_P0_30FEI_Msk       (0x40000000UL)            /*!< P0_30FEI (Bitfield-Mask: 0x01)                        */
/* =========================================================  CLR0  ========================================================== */
#define GPIOINT_CLR0_P0_0CI_Pos           (0UL)                     /*!< P0_0CI (Bit 0)                                        */
#define GPIOINT_CLR0_P0_0CI_Msk           (0x1UL)                   /*!< P0_0CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_1CI_Pos           (1UL)                     /*!< P0_1CI (Bit 1)                                        */
#define GPIOINT_CLR0_P0_1CI_Msk           (0x2UL)                   /*!< P0_1CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_2CI_Pos           (2UL)                     /*!< P0_2CI (Bit 2)                                        */
#define GPIOINT_CLR0_P0_2CI_Msk           (0x4UL)                   /*!< P0_2CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_3CI_Pos           (3UL)                     /*!< P0_3CI (Bit 3)                                        */
#define GPIOINT_CLR0_P0_3CI_Msk           (0x8UL)                   /*!< P0_3CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_4CI_Pos           (4UL)                     /*!< P0_4CI (Bit 4)                                        */
#define GPIOINT_CLR0_P0_4CI_Msk           (0x10UL)                  /*!< P0_4CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_5CI_Pos           (5UL)                     /*!< P0_5CI (Bit 5)                                        */
#define GPIOINT_CLR0_P0_5CI_Msk           (0x20UL)                  /*!< P0_5CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_6CI_Pos           (6UL)                     /*!< P0_6CI (Bit 6)                                        */
#define GPIOINT_CLR0_P0_6CI_Msk           (0x40UL)                  /*!< P0_6CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_7CI_Pos           (7UL)                     /*!< P0_7CI (Bit 7)                                        */
#define GPIOINT_CLR0_P0_7CI_Msk           (0x80UL)                  /*!< P0_7CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_8CI_Pos           (8UL)                     /*!< P0_8CI (Bit 8)                                        */
#define GPIOINT_CLR0_P0_8CI_Msk           (0x100UL)                 /*!< P0_8CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_9CI_Pos           (9UL)                     /*!< P0_9CI (Bit 9)                                        */
#define GPIOINT_CLR0_P0_9CI_Msk           (0x200UL)                 /*!< P0_9CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR0_P0_10CI_Pos          (10UL)                    /*!< P0_10CI (Bit 10)                                      */
#define GPIOINT_CLR0_P0_10CI_Msk          (0x400UL)                 /*!< P0_10CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_11CI_Pos          (11UL)                    /*!< P0_11CI (Bit 11)                                      */
#define GPIOINT_CLR0_P0_11CI_Msk          (0x800UL)                 /*!< P0_11CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_12CI_Pos          (12UL)                    /*!< P0_12CI (Bit 12)                                      */
#define GPIOINT_CLR0_P0_12CI_Msk          (0x1000UL)                /*!< P0_12CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_13CI_Pos          (13UL)                    /*!< P0_13CI (Bit 13)                                      */
#define GPIOINT_CLR0_P0_13CI_Msk          (0x2000UL)                /*!< P0_13CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_14CI_Pos          (14UL)                    /*!< P0_14CI (Bit 14)                                      */
#define GPIOINT_CLR0_P0_14CI_Msk          (0x4000UL)                /*!< P0_14CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_15CI_Pos          (15UL)                    /*!< P0_15CI (Bit 15)                                      */
#define GPIOINT_CLR0_P0_15CI_Msk          (0x8000UL)                /*!< P0_15CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_16CI_Pos          (16UL)                    /*!< P0_16CI (Bit 16)                                      */
#define GPIOINT_CLR0_P0_16CI_Msk          (0x10000UL)               /*!< P0_16CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_17CI_Pos          (17UL)                    /*!< P0_17CI (Bit 17)                                      */
#define GPIOINT_CLR0_P0_17CI_Msk          (0x20000UL)               /*!< P0_17CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_18CI_Pos          (18UL)                    /*!< P0_18CI (Bit 18)                                      */
#define GPIOINT_CLR0_P0_18CI_Msk          (0x40000UL)               /*!< P0_18CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_19CI_Pos          (19UL)                    /*!< P0_19CI (Bit 19)                                      */
#define GPIOINT_CLR0_P0_19CI_Msk          (0x80000UL)               /*!< P0_19CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_20CI_Pos          (20UL)                    /*!< P0_20CI (Bit 20)                                      */
#define GPIOINT_CLR0_P0_20CI_Msk          (0x100000UL)              /*!< P0_20CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_21CI_Pos          (21UL)                    /*!< P0_21CI (Bit 21)                                      */
#define GPIOINT_CLR0_P0_21CI_Msk          (0x200000UL)              /*!< P0_21CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_22CI_Pos          (22UL)                    /*!< P0_22CI (Bit 22)                                      */
#define GPIOINT_CLR0_P0_22CI_Msk          (0x400000UL)              /*!< P0_22CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_23CI_Pos          (23UL)                    /*!< P0_23CI (Bit 23)                                      */
#define GPIOINT_CLR0_P0_23CI_Msk          (0x800000UL)              /*!< P0_23CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_24CI_Pos          (24UL)                    /*!< P0_24CI (Bit 24)                                      */
#define GPIOINT_CLR0_P0_24CI_Msk          (0x1000000UL)             /*!< P0_24CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_25CI_Pos          (25UL)                    /*!< P0_25CI (Bit 25)                                      */
#define GPIOINT_CLR0_P0_25CI_Msk          (0x2000000UL)             /*!< P0_25CI (Bitfield-Mask: 0x01)                         */
