lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIOINT_CLR0_P0_26CI_Pos          (26UL)                    /*!< P0_26CI (Bit 26)                                      */
#define GPIOINT_CLR0_P0_26CI_Msk          (0x4000000UL)             /*!< P0_26CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_27CI_Pos          (27UL)                    /*!< P0_27CI (Bit 27)                                      */
#define GPIOINT_CLR0_P0_27CI_Msk          (0x8000000UL)             /*!< P0_27CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_28CI_Pos          (28UL)                    /*!< P0_28CI (Bit 28)                                      */
#define GPIOINT_CLR0_P0_28CI_Msk          (0x10000000UL)            /*!< P0_28CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_29CI_Pos          (29UL)                    /*!< P0_29CI (Bit 29)                                      */
#define GPIOINT_CLR0_P0_29CI_Msk          (0x20000000UL)            /*!< P0_29CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR0_P0_30CI_Pos          (30UL)                    /*!< P0_30CI (Bit 30)                                      */
#define GPIOINT_CLR0_P0_30CI_Msk          (0x40000000UL)            /*!< P0_30CI (Bitfield-Mask: 0x01)                         */
/* =========================================================  ENR0  ========================================================== */
#define GPIOINT_ENR0_P0_0ER_Pos           (0UL)                     /*!< P0_0ER (Bit 0)                                        */
#define GPIOINT_ENR0_P0_0ER_Msk           (0x1UL)                   /*!< P0_0ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_1ER_Pos           (1UL)                     /*!< P0_1ER (Bit 1)                                        */
#define GPIOINT_ENR0_P0_1ER_Msk           (0x2UL)                   /*!< P0_1ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_2ER_Pos           (2UL)                     /*!< P0_2ER (Bit 2)                                        */
#define GPIOINT_ENR0_P0_2ER_Msk           (0x4UL)                   /*!< P0_2ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_3ER_Pos           (3UL)                     /*!< P0_3ER (Bit 3)                                        */
#define GPIOINT_ENR0_P0_3ER_Msk           (0x8UL)                   /*!< P0_3ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_4ER_Pos           (4UL)                     /*!< P0_4ER (Bit 4)                                        */
#define GPIOINT_ENR0_P0_4ER_Msk           (0x10UL)                  /*!< P0_4ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_5ER_Pos           (5UL)                     /*!< P0_5ER (Bit 5)                                        */
#define GPIOINT_ENR0_P0_5ER_Msk           (0x20UL)                  /*!< P0_5ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_6ER_Pos           (6UL)                     /*!< P0_6ER (Bit 6)                                        */
#define GPIOINT_ENR0_P0_6ER_Msk           (0x40UL)                  /*!< P0_6ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_7ER_Pos           (7UL)                     /*!< P0_7ER (Bit 7)                                        */
#define GPIOINT_ENR0_P0_7ER_Msk           (0x80UL)                  /*!< P0_7ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_8ER_Pos           (8UL)                     /*!< P0_8ER (Bit 8)                                        */
#define GPIOINT_ENR0_P0_8ER_Msk           (0x100UL)                 /*!< P0_8ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_9ER_Pos           (9UL)                     /*!< P0_9ER (Bit 9)                                        */
#define GPIOINT_ENR0_P0_9ER_Msk           (0x200UL)                 /*!< P0_9ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR0_P0_10ER_Pos          (10UL)                    /*!< P0_10ER (Bit 10)                                      */
#define GPIOINT_ENR0_P0_10ER_Msk          (0x400UL)                 /*!< P0_10ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_11ER_Pos          (11UL)                    /*!< P0_11ER (Bit 11)                                      */
#define GPIOINT_ENR0_P0_11ER_Msk          (0x800UL)                 /*!< P0_11ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_12ER_Pos          (12UL)                    /*!< P0_12ER (Bit 12)                                      */
#define GPIOINT_ENR0_P0_12ER_Msk          (0x1000UL)                /*!< P0_12ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_13ER_Pos          (13UL)                    /*!< P0_13ER (Bit 13)                                      */
#define GPIOINT_ENR0_P0_13ER_Msk          (0x2000UL)                /*!< P0_13ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_14ER_Pos          (14UL)                    /*!< P0_14ER (Bit 14)                                      */
#define GPIOINT_ENR0_P0_14ER_Msk          (0x4000UL)                /*!< P0_14ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_15ER_Pos          (15UL)                    /*!< P0_15ER (Bit 15)                                      */
#define GPIOINT_ENR0_P0_15ER_Msk          (0x8000UL)                /*!< P0_15ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_16ER_Pos          (16UL)                    /*!< P0_16ER (Bit 16)                                      */
#define GPIOINT_ENR0_P0_16ER_Msk          (0x10000UL)               /*!< P0_16ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_17ER_Pos          (17UL)                    /*!< P0_17ER (Bit 17)                                      */
#define GPIOINT_ENR0_P0_17ER_Msk          (0x20000UL)               /*!< P0_17ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_18ER_Pos          (18UL)                    /*!< P0_18ER (Bit 18)                                      */
#define GPIOINT_ENR0_P0_18ER_Msk          (0x40000UL)               /*!< P0_18ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_19ER_Pos          (19UL)                    /*!< P0_19ER (Bit 19)                                      */
#define GPIOINT_ENR0_P0_19ER_Msk          (0x80000UL)               /*!< P0_19ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_20ER_Pos          (20UL)                    /*!< P0_20ER (Bit 20)                                      */
#define GPIOINT_ENR0_P0_20ER_Msk          (0x100000UL)              /*!< P0_20ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_21ER_Pos          (21UL)                    /*!< P0_21ER (Bit 21)                                      */
#define GPIOINT_ENR0_P0_21ER_Msk          (0x200000UL)              /*!< P0_21ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_22ER_Pos          (22UL)                    /*!< P0_22ER (Bit 22)                                      */
#define GPIOINT_ENR0_P0_22ER_Msk          (0x400000UL)              /*!< P0_22ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_23ER_Pos          (23UL)                    /*!< P0_23ER (Bit 23)                                      */
#define GPIOINT_ENR0_P0_23ER_Msk          (0x800000UL)              /*!< P0_23ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_24ER_Pos          (24UL)                    /*!< P0_24ER (Bit 24)                                      */
#define GPIOINT_ENR0_P0_24ER_Msk          (0x1000000UL)             /*!< P0_24ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_25ER_Pos          (25UL)                    /*!< P0_25ER (Bit 25)                                      */
#define GPIOINT_ENR0_P0_25ER_Msk          (0x2000000UL)             /*!< P0_25ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_26ER_Pos          (26UL)                    /*!< P0_26ER (Bit 26)                                      */
#define GPIOINT_ENR0_P0_26ER_Msk          (0x4000000UL)             /*!< P0_26ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_27ER_Pos          (27UL)                    /*!< P0_27ER (Bit 27)                                      */
#define GPIOINT_ENR0_P0_27ER_Msk          (0x8000000UL)             /*!< P0_27ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_28ER_Pos          (28UL)                    /*!< P0_28ER (Bit 28)                                      */
#define GPIOINT_ENR0_P0_28ER_Msk          (0x10000000UL)            /*!< P0_28ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_29ER_Pos          (29UL)                    /*!< P0_29ER (Bit 29)                                      */
#define GPIOINT_ENR0_P0_29ER_Msk          (0x20000000UL)            /*!< P0_29ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR0_P0_30ER_Pos          (30UL)                    /*!< P0_30ER (Bit 30)                                      */
#define GPIOINT_ENR0_P0_30ER_Msk          (0x40000000UL)            /*!< P0_30ER (Bitfield-Mask: 0x01)                         */
/* =========================================================  ENF0  ========================================================== */
#define GPIOINT_ENF0_P0_0EF_Pos           (0UL)                     /*!< P0_0EF (Bit 0)                                        */
#define GPIOINT_ENF0_P0_0EF_Msk           (0x1UL)                   /*!< P0_0EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_1EF_Pos           (1UL)                     /*!< P0_1EF (Bit 1)                                        */
#define GPIOINT_ENF0_P0_1EF_Msk           (0x2UL)                   /*!< P0_1EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_2EF_Pos           (2UL)                     /*!< P0_2EF (Bit 2)                                        */
#define GPIOINT_ENF0_P0_2EF_Msk           (0x4UL)                   /*!< P0_2EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_3EF_Pos           (3UL)                     /*!< P0_3EF (Bit 3)                                        */
#define GPIOINT_ENF0_P0_3EF_Msk           (0x8UL)                   /*!< P0_3EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_4EF_Pos           (4UL)                     /*!< P0_4EF (Bit 4)                                        */
#define GPIOINT_ENF0_P0_4EF_Msk           (0x10UL)                  /*!< P0_4EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_5EF_Pos           (5UL)                     /*!< P0_5EF (Bit 5)                                        */
#define GPIOINT_ENF0_P0_5EF_Msk           (0x20UL)                  /*!< P0_5EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_6EF_Pos           (6UL)                     /*!< P0_6EF (Bit 6)                                        */
#define GPIOINT_ENF0_P0_6EF_Msk           (0x40UL)                  /*!< P0_6EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_7EF_Pos           (7UL)                     /*!< P0_7EF (Bit 7)                                        */
#define GPIOINT_ENF0_P0_7EF_Msk           (0x80UL)                  /*!< P0_7EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_8EF_Pos           (8UL)                     /*!< P0_8EF (Bit 8)                                        */
#define GPIOINT_ENF0_P0_8EF_Msk           (0x100UL)                 /*!< P0_8EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_9EF_Pos           (9UL)                     /*!< P0_9EF (Bit 9)                                        */
#define GPIOINT_ENF0_P0_9EF_Msk           (0x200UL)                 /*!< P0_9EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF0_P0_10EF_Pos          (10UL)                    /*!< P0_10EF (Bit 10)                                      */
#define GPIOINT_ENF0_P0_10EF_Msk          (0x400UL)                 /*!< P0_10EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_11EF_Pos          (11UL)                    /*!< P0_11EF (Bit 11)                                      */
#define GPIOINT_ENF0_P0_11EF_Msk          (0x800UL)                 /*!< P0_11EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_12EF_Pos          (12UL)                    /*!< P0_12EF (Bit 12)                                      */
#define GPIOINT_ENF0_P0_12EF_Msk          (0x1000UL)                /*!< P0_12EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_13EF_Pos          (13UL)                    /*!< P0_13EF (Bit 13)                                      */
#define GPIOINT_ENF0_P0_13EF_Msk          (0x2000UL)                /*!< P0_13EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_14EF_Pos          (14UL)                    /*!< P0_14EF (Bit 14)                                      */
#define GPIOINT_ENF0_P0_14EF_Msk          (0x4000UL)                /*!< P0_14EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_15EF_Pos          (15UL)                    /*!< P0_15EF (Bit 15)                                      */
#define GPIOINT_ENF0_P0_15EF_Msk          (0x8000UL)                /*!< P0_15EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_16EF_Pos          (16UL)                    /*!< P0_16EF (Bit 16)                                      */
#define GPIOINT_ENF0_P0_16EF_Msk          (0x10000UL)               /*!< P0_16EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_17EF_Pos          (17UL)                    /*!< P0_17EF (Bit 17)                                      */
#define GPIOINT_ENF0_P0_17EF_Msk          (0x20000UL)               /*!< P0_17EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_18EF_Pos          (18UL)                    /*!< P0_18EF (Bit 18)                                      */
#define GPIOINT_ENF0_P0_18EF_Msk          (0x40000UL)               /*!< P0_18EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_19EF_Pos          (19UL)                    /*!< P0_19EF (Bit 19)                                      */
#define GPIOINT_ENF0_P0_19EF_Msk          (0x80000UL)               /*!< P0_19EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_20EF_Pos          (20UL)                    /*!< P0_20EF (Bit 20)                                      */
#define GPIOINT_ENF0_P0_20EF_Msk          (0x100000UL)              /*!< P0_20EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_21EF_Pos          (21UL)                    /*!< P0_21EF (Bit 21)                                      */
#define GPIOINT_ENF0_P0_21EF_Msk          (0x200000UL)              /*!< P0_21EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_22EF_Pos          (22UL)                    /*!< P0_22EF (Bit 22)                                      */
#define GPIOINT_ENF0_P0_22EF_Msk          (0x400000UL)              /*!< P0_22EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_23EF_Pos          (23UL)                    /*!< P0_23EF (Bit 23)                                      */
#define GPIOINT_ENF0_P0_23EF_Msk          (0x800000UL)              /*!< P0_23EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_24EF_Pos          (24UL)                    /*!< P0_24EF (Bit 24)                                      */
#define GPIOINT_ENF0_P0_24EF_Msk          (0x1000000UL)             /*!< P0_24EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_25EF_Pos          (25UL)                    /*!< P0_25EF (Bit 25)                                      */
#define GPIOINT_ENF0_P0_25EF_Msk          (0x2000000UL)             /*!< P0_25EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_26EF_Pos          (26UL)                    /*!< P0_26EF (Bit 26)                                      */
#define GPIOINT_ENF0_P0_26EF_Msk          (0x4000000UL)             /*!< P0_26EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_27EF_Pos          (27UL)                    /*!< P0_27EF (Bit 27)                                      */
#define GPIOINT_ENF0_P0_27EF_Msk          (0x8000000UL)             /*!< P0_27EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_28EF_Pos          (28UL)                    /*!< P0_28EF (Bit 28)                                      */
#define GPIOINT_ENF0_P0_28EF_Msk          (0x10000000UL)            /*!< P0_28EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_29EF_Pos          (29UL)                    /*!< P0_29EF (Bit 29)                                      */
#define GPIOINT_ENF0_P0_29EF_Msk          (0x20000000UL)            /*!< P0_29EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF0_P0_30EF_Pos          (30UL)                    /*!< P0_30EF (Bit 30)                                      */
#define GPIOINT_ENF0_P0_30EF_Msk          (0x40000000UL)            /*!< P0_30EF (Bitfield-Mask: 0x01)                         */
/* ========================================================  STATR2  ========================================================= */
#define GPIOINT_STATR2_P2_0REI_Pos        (0UL)                     /*!< P2_0REI (Bit 0)                                       */
#define GPIOINT_STATR2_P2_0REI_Msk        (0x1UL)                   /*!< P2_0REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_1REI_Pos        (1UL)                     /*!< P2_1REI (Bit 1)                                       */
#define GPIOINT_STATR2_P2_1REI_Msk        (0x2UL)                   /*!< P2_1REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_2REI_Pos        (2UL)                     /*!< P2_2REI (Bit 2)                                       */
#define GPIOINT_STATR2_P2_2REI_Msk        (0x4UL)                   /*!< P2_2REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_3REI_Pos        (3UL)                     /*!< P2_3REI (Bit 3)                                       */
#define GPIOINT_STATR2_P2_3REI_Msk        (0x8UL)                   /*!< P2_3REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_4REI_Pos        (4UL)                     /*!< P2_4REI (Bit 4)                                       */
#define GPIOINT_STATR2_P2_4REI_Msk        (0x10UL)                  /*!< P2_4REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_5REI_Pos        (5UL)                     /*!< P2_5REI (Bit 5)                                       */
#define GPIOINT_STATR2_P2_5REI_Msk        (0x20UL)                  /*!< P2_5REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_6REI_Pos        (6UL)                     /*!< P2_6REI (Bit 6)                                       */
#define GPIOINT_STATR2_P2_6REI_Msk        (0x40UL)                  /*!< P2_6REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_7REI_Pos        (7UL)                     /*!< P2_7REI (Bit 7)                                       */
#define GPIOINT_STATR2_P2_7REI_Msk        (0x80UL)                  /*!< P2_7REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_8REI_Pos        (8UL)                     /*!< P2_8REI (Bit 8)                                       */
#define GPIOINT_STATR2_P2_8REI_Msk        (0x100UL)                 /*!< P2_8REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_9REI_Pos        (9UL)                     /*!< P2_9REI (Bit 9)                                       */
#define GPIOINT_STATR2_P2_9REI_Msk        (0x200UL)                 /*!< P2_9REI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATR2_P2_10REI_Pos       (10UL)                    /*!< P2_10REI (Bit 10)                                     */
#define GPIOINT_STATR2_P2_10REI_Msk       (0x400UL)                 /*!< P2_10REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR2_P2_11REI_Pos       (11UL)                    /*!< P2_11REI (Bit 11)                                     */
#define GPIOINT_STATR2_P2_11REI_Msk       (0x800UL)                 /*!< P2_11REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR2_P2_12REI_Pos       (12UL)                    /*!< P2_12REI (Bit 12)                                     */
#define GPIOINT_STATR2_P2_12REI_Msk       (0x1000UL)                /*!< P2_12REI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATR2_P2_13REI_Pos       (13UL)                    /*!< P2_13REI (Bit 13)                                     */
#define GPIOINT_STATR2_P2_13REI_Msk       (0x2000UL)                /*!< P2_13REI (Bitfield-Mask: 0x01)                        */
/* ========================================================  STATF2  ========================================================= */
#define GPIOINT_STATF2_P2_0FEI_Pos        (0UL)                     /*!< P2_0FEI (Bit 0)                                       */
#define GPIOINT_STATF2_P2_0FEI_Msk        (0x1UL)                   /*!< P2_0FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_1FEI_Pos        (1UL)                     /*!< P2_1FEI (Bit 1)                                       */
#define GPIOINT_STATF2_P2_1FEI_Msk        (0x2UL)                   /*!< P2_1FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_2FEI_Pos        (2UL)                     /*!< P2_2FEI (Bit 2)                                       */
#define GPIOINT_STATF2_P2_2FEI_Msk        (0x4UL)                   /*!< P2_2FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_3FEI_Pos        (3UL)                     /*!< P2_3FEI (Bit 3)                                       */
#define GPIOINT_STATF2_P2_3FEI_Msk        (0x8UL)                   /*!< P2_3FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_4FEI_Pos        (4UL)                     /*!< P2_4FEI (Bit 4)                                       */
#define GPIOINT_STATF2_P2_4FEI_Msk        (0x10UL)                  /*!< P2_4FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_5FEI_Pos        (5UL)                     /*!< P2_5FEI (Bit 5)                                       */
#define GPIOINT_STATF2_P2_5FEI_Msk        (0x20UL)                  /*!< P2_5FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_6FEI_Pos        (6UL)                     /*!< P2_6FEI (Bit 6)                                       */
#define GPIOINT_STATF2_P2_6FEI_Msk        (0x40UL)                  /*!< P2_6FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_7FEI_Pos        (7UL)                     /*!< P2_7FEI (Bit 7)                                       */
#define GPIOINT_STATF2_P2_7FEI_Msk        (0x80UL)                  /*!< P2_7FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_8FEI_Pos        (8UL)                     /*!< P2_8FEI (Bit 8)                                       */
#define GPIOINT_STATF2_P2_8FEI_Msk        (0x100UL)                 /*!< P2_8FEI (Bitfield-Mask: 0x01)                         */
