lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIOINT_STATF2_P2_9FEI_Pos        (9UL)                     /*!< P2_9FEI (Bit 9)                                       */
#define GPIOINT_STATF2_P2_9FEI_Msk        (0x200UL)                 /*!< P2_9FEI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_STATF2_P2_10FEI_Pos       (10UL)                    /*!< P2_10FEI (Bit 10)                                     */
#define GPIOINT_STATF2_P2_10FEI_Msk       (0x400UL)                 /*!< P2_10FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF2_P2_11FEI_Pos       (11UL)                    /*!< P2_11FEI (Bit 11)                                     */
#define GPIOINT_STATF2_P2_11FEI_Msk       (0x800UL)                 /*!< P2_11FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF2_P2_12FEI_Pos       (12UL)                    /*!< P2_12FEI (Bit 12)                                     */
#define GPIOINT_STATF2_P2_12FEI_Msk       (0x1000UL)                /*!< P2_12FEI (Bitfield-Mask: 0x01)                        */
#define GPIOINT_STATF2_P2_13FEI_Pos       (13UL)                    /*!< P2_13FEI (Bit 13)                                     */
#define GPIOINT_STATF2_P2_13FEI_Msk       (0x2000UL)                /*!< P2_13FEI (Bitfield-Mask: 0x01)                        */
/* =========================================================  CLR2  ========================================================== */
#define GPIOINT_CLR2_P2_0CI_Pos           (0UL)                     /*!< P2_0CI (Bit 0)                                        */
#define GPIOINT_CLR2_P2_0CI_Msk           (0x1UL)                   /*!< P2_0CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_1CI_Pos           (1UL)                     /*!< P2_1CI (Bit 1)                                        */
#define GPIOINT_CLR2_P2_1CI_Msk           (0x2UL)                   /*!< P2_1CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_2CI_Pos           (2UL)                     /*!< P2_2CI (Bit 2)                                        */
#define GPIOINT_CLR2_P2_2CI_Msk           (0x4UL)                   /*!< P2_2CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_3CI_Pos           (3UL)                     /*!< P2_3CI (Bit 3)                                        */
#define GPIOINT_CLR2_P2_3CI_Msk           (0x8UL)                   /*!< P2_3CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_4CI_Pos           (4UL)                     /*!< P2_4CI (Bit 4)                                        */
#define GPIOINT_CLR2_P2_4CI_Msk           (0x10UL)                  /*!< P2_4CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_5CI_Pos           (5UL)                     /*!< P2_5CI (Bit 5)                                        */
#define GPIOINT_CLR2_P2_5CI_Msk           (0x20UL)                  /*!< P2_5CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_6CI_Pos           (6UL)                     /*!< P2_6CI (Bit 6)                                        */
#define GPIOINT_CLR2_P2_6CI_Msk           (0x40UL)                  /*!< P2_6CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_7CI_Pos           (7UL)                     /*!< P2_7CI (Bit 7)                                        */
#define GPIOINT_CLR2_P2_7CI_Msk           (0x80UL)                  /*!< P2_7CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_8CI_Pos           (8UL)                     /*!< P2_8CI (Bit 8)                                        */
#define GPIOINT_CLR2_P2_8CI_Msk           (0x100UL)                 /*!< P2_8CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_9CI_Pos           (9UL)                     /*!< P2_9CI (Bit 9)                                        */
#define GPIOINT_CLR2_P2_9CI_Msk           (0x200UL)                 /*!< P2_9CI (Bitfield-Mask: 0x01)                          */
#define GPIOINT_CLR2_P2_10CI_Pos          (10UL)                    /*!< P2_10CI (Bit 10)                                      */
#define GPIOINT_CLR2_P2_10CI_Msk          (0x400UL)                 /*!< P2_10CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR2_P2_11CI_Pos          (11UL)                    /*!< P2_11CI (Bit 11)                                      */
#define GPIOINT_CLR2_P2_11CI_Msk          (0x800UL)                 /*!< P2_11CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR2_P2_12CI_Pos          (12UL)                    /*!< P2_12CI (Bit 12)                                      */
#define GPIOINT_CLR2_P2_12CI_Msk          (0x1000UL)                /*!< P2_12CI (Bitfield-Mask: 0x01)                         */
#define GPIOINT_CLR2_P2_13CI_Pos          (13UL)                    /*!< P2_13CI (Bit 13)                                      */
#define GPIOINT_CLR2_P2_13CI_Msk          (0x2000UL)                /*!< P2_13CI (Bitfield-Mask: 0x01)                         */
/* =========================================================  ENR2  ========================================================== */
#define GPIOINT_ENR2_P2_0ER_Pos           (0UL)                     /*!< P2_0ER (Bit 0)                                        */
#define GPIOINT_ENR2_P2_0ER_Msk           (0x1UL)                   /*!< P2_0ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_1ER_Pos           (1UL)                     /*!< P2_1ER (Bit 1)                                        */
#define GPIOINT_ENR2_P2_1ER_Msk           (0x2UL)                   /*!< P2_1ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_2ER_Pos           (2UL)                     /*!< P2_2ER (Bit 2)                                        */
#define GPIOINT_ENR2_P2_2ER_Msk           (0x4UL)                   /*!< P2_2ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_3ER_Pos           (3UL)                     /*!< P2_3ER (Bit 3)                                        */
#define GPIOINT_ENR2_P2_3ER_Msk           (0x8UL)                   /*!< P2_3ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_4ER_Pos           (4UL)                     /*!< P2_4ER (Bit 4)                                        */
#define GPIOINT_ENR2_P2_4ER_Msk           (0x10UL)                  /*!< P2_4ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_5ER_Pos           (5UL)                     /*!< P2_5ER (Bit 5)                                        */
#define GPIOINT_ENR2_P2_5ER_Msk           (0x20UL)                  /*!< P2_5ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_6ER_Pos           (6UL)                     /*!< P2_6ER (Bit 6)                                        */
#define GPIOINT_ENR2_P2_6ER_Msk           (0x40UL)                  /*!< P2_6ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_7ER_Pos           (7UL)                     /*!< P2_7ER (Bit 7)                                        */
#define GPIOINT_ENR2_P2_7ER_Msk           (0x80UL)                  /*!< P2_7ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_8ER_Pos           (8UL)                     /*!< P2_8ER (Bit 8)                                        */
#define GPIOINT_ENR2_P2_8ER_Msk           (0x100UL)                 /*!< P2_8ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_9ER_Pos           (9UL)                     /*!< P2_9ER (Bit 9)                                        */
#define GPIOINT_ENR2_P2_9ER_Msk           (0x200UL)                 /*!< P2_9ER (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENR2_P2_10ER_Pos          (10UL)                    /*!< P2_10ER (Bit 10)                                      */
#define GPIOINT_ENR2_P2_10ER_Msk          (0x400UL)                 /*!< P2_10ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR2_P2_11ER_Pos          (11UL)                    /*!< P2_11ER (Bit 11)                                      */
#define GPIOINT_ENR2_P2_11ER_Msk          (0x800UL)                 /*!< P2_11ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR2_P2_12ER_Pos          (12UL)                    /*!< P2_12ER (Bit 12)                                      */
#define GPIOINT_ENR2_P2_12ER_Msk          (0x1000UL)                /*!< P2_12ER (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENR2_P2_13ER_Pos          (13UL)                    /*!< P2_13ER (Bit 13)                                      */
#define GPIOINT_ENR2_P2_13ER_Msk          (0x2000UL)                /*!< P2_13ER (Bitfield-Mask: 0x01)                         */
/* =========================================================  ENF2  ========================================================== */
#define GPIOINT_ENF2_P2_0EF_Pos           (0UL)                     /*!< P2_0EF (Bit 0)                                        */
#define GPIOINT_ENF2_P2_0EF_Msk           (0x1UL)                   /*!< P2_0EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_1EF_Pos           (1UL)                     /*!< P2_1EF (Bit 1)                                        */
#define GPIOINT_ENF2_P2_1EF_Msk           (0x2UL)                   /*!< P2_1EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_2EF_Pos           (2UL)                     /*!< P2_2EF (Bit 2)                                        */
#define GPIOINT_ENF2_P2_2EF_Msk           (0x4UL)                   /*!< P2_2EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_3EF_Pos           (3UL)                     /*!< P2_3EF (Bit 3)                                        */
#define GPIOINT_ENF2_P2_3EF_Msk           (0x8UL)                   /*!< P2_3EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_4EF_Pos           (4UL)                     /*!< P2_4EF (Bit 4)                                        */
#define GPIOINT_ENF2_P2_4EF_Msk           (0x10UL)                  /*!< P2_4EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_5EF_Pos           (5UL)                     /*!< P2_5EF (Bit 5)                                        */
#define GPIOINT_ENF2_P2_5EF_Msk           (0x20UL)                  /*!< P2_5EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_6EF_Pos           (6UL)                     /*!< P2_6EF (Bit 6)                                        */
#define GPIOINT_ENF2_P2_6EF_Msk           (0x40UL)                  /*!< P2_6EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_7EF_Pos           (7UL)                     /*!< P2_7EF (Bit 7)                                        */
#define GPIOINT_ENF2_P2_7EF_Msk           (0x80UL)                  /*!< P2_7EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_8EF_Pos           (8UL)                     /*!< P2_8EF (Bit 8)                                        */
#define GPIOINT_ENF2_P2_8EF_Msk           (0x100UL)                 /*!< P2_8EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_9EF_Pos           (9UL)                     /*!< P2_9EF (Bit 9)                                        */
#define GPIOINT_ENF2_P2_9EF_Msk           (0x200UL)                 /*!< P2_9EF (Bitfield-Mask: 0x01)                          */
#define GPIOINT_ENF2_P2_10EF_Pos          (10UL)                    /*!< P2_10EF (Bit 10)                                      */
#define GPIOINT_ENF2_P2_10EF_Msk          (0x400UL)                 /*!< P2_10EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF2_P2_11EF_Pos          (11UL)                    /*!< P2_11EF (Bit 11)                                      */
#define GPIOINT_ENF2_P2_11EF_Msk          (0x800UL)                 /*!< P2_11EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF2_P2_12EF_Pos          (12UL)                    /*!< P2_12EF (Bit 12)                                      */
#define GPIOINT_ENF2_P2_12EF_Msk          (0x1000UL)                /*!< P2_12EF (Bitfield-Mask: 0x01)                         */
#define GPIOINT_ENF2_P2_13EF_Pos          (13UL)                    /*!< P2_13EF (Bit 13)                                      */
#define GPIOINT_ENF2_P2_13EF_Msk          (0x2000UL)                /*!< P2_13EF (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                      LPC_PINCONNECT                                       ================ */
/* =========================================================================================================================== */

