lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ========================================================  PINSEL0  ======================================================== */
#define PINCONNECT_PINSEL0_P0_0_Pos       (0UL)                     /*!< P0_0 (Bit 0)                                          */
#define PINCONNECT_PINSEL0_P0_0_Msk       (0x3UL)                   /*!< P0_0 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_1_Pos       (2UL)                     /*!< P0_1 (Bit 2)                                          */
#define PINCONNECT_PINSEL0_P0_1_Msk       (0xcUL)                   /*!< P0_1 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_2_Pos       (4UL)                     /*!< P0_2 (Bit 4)                                          */
#define PINCONNECT_PINSEL0_P0_2_Msk       (0x30UL)                  /*!< P0_2 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_3_Pos       (6UL)                     /*!< P0_3 (Bit 6)                                          */
#define PINCONNECT_PINSEL0_P0_3_Msk       (0xc0UL)                  /*!< P0_3 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_4_Pos       (8UL)                     /*!< P0_4 (Bit 8)                                          */
#define PINCONNECT_PINSEL0_P0_4_Msk       (0x300UL)                 /*!< P0_4 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_5_Pos       (10UL)                    /*!< P0_5 (Bit 10)                                         */
#define PINCONNECT_PINSEL0_P0_5_Msk       (0xc00UL)                 /*!< P0_5 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_6_Pos       (12UL)                    /*!< P0_6 (Bit 12)                                         */
#define PINCONNECT_PINSEL0_P0_6_Msk       (0x3000UL)                /*!< P0_6 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_7_Pos       (14UL)                    /*!< P0_7 (Bit 14)                                         */
#define PINCONNECT_PINSEL0_P0_7_Msk       (0xc000UL)                /*!< P0_7 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_8_Pos       (16UL)                    /*!< P0_8 (Bit 16)                                         */
#define PINCONNECT_PINSEL0_P0_8_Msk       (0x30000UL)               /*!< P0_8 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_9_Pos       (18UL)                    /*!< P0_9 (Bit 18)                                         */
#define PINCONNECT_PINSEL0_P0_9_Msk       (0xc0000UL)               /*!< P0_9 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL0_P0_10_Pos      (20UL)                    /*!< P0_10 (Bit 20)                                        */
#define PINCONNECT_PINSEL0_P0_10_Msk      (0x300000UL)              /*!< P0_10 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL0_P0_11_Pos      (22UL)                    /*!< P0_11 (Bit 22)                                        */
#define PINCONNECT_PINSEL0_P0_11_Msk      (0xc00000UL)              /*!< P0_11 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL0_P0_15_Pos      (30UL)                    /*!< P0_15 (Bit 30)                                        */
#define PINCONNECT_PINSEL0_P0_15_Msk      (0xc0000000UL)            /*!< P0_15 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL1  ======================================================== */
#define PINCONNECT_PINSEL1_P0_16_Pos      (0UL)                     /*!< P0_16 (Bit 0)                                         */
#define PINCONNECT_PINSEL1_P0_16_Msk      (0x3UL)                   /*!< P0_16 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_17_Pos      (2UL)                     /*!< P0_17 (Bit 2)                                         */
#define PINCONNECT_PINSEL1_P0_17_Msk      (0xcUL)                   /*!< P0_17 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_18_Pos      (4UL)                     /*!< P0_18 (Bit 4)                                         */
#define PINCONNECT_PINSEL1_P0_18_Msk      (0x30UL)                  /*!< P0_18 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_19_Pos      (6UL)                     /*!< P0_19 (Bit 6)                                         */
#define PINCONNECT_PINSEL1_P0_19_Msk      (0xc0UL)                  /*!< P0_19 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_20_Pos      (8UL)                     /*!< P0_20 (Bit 8)                                         */
#define PINCONNECT_PINSEL1_P0_20_Msk      (0x300UL)                 /*!< P0_20 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_21_Pos      (10UL)                    /*!< P0_21 (Bit 10)                                        */
#define PINCONNECT_PINSEL1_P0_21_Msk      (0xc00UL)                 /*!< P0_21 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_22_Pos      (12UL)                    /*!< P0_22 (Bit 12)                                        */
#define PINCONNECT_PINSEL1_P0_22_Msk      (0x3000UL)                /*!< P0_22 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_23_Pos      (14UL)                    /*!< P0_23 (Bit 14)                                        */
#define PINCONNECT_PINSEL1_P0_23_Msk      (0xc000UL)                /*!< P0_23 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_24_Pos      (16UL)                    /*!< P0_24 (Bit 16)                                        */
#define PINCONNECT_PINSEL1_P0_24_Msk      (0x30000UL)               /*!< P0_24 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_25_Pos      (18UL)                    /*!< P0_25 (Bit 18)                                        */
#define PINCONNECT_PINSEL1_P0_25_Msk      (0xc0000UL)               /*!< P0_25 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_26_Pos      (20UL)                    /*!< P0_26 (Bit 20)                                        */
#define PINCONNECT_PINSEL1_P0_26_Msk      (0x300000UL)              /*!< P0_26 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_27_Pos      (22UL)                    /*!< P0_27 (Bit 22)                                        */
#define PINCONNECT_PINSEL1_P0_27_Msk      (0xc00000UL)              /*!< P0_27 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_28_Pos      (24UL)                    /*!< P0_28 (Bit 24)                                        */
#define PINCONNECT_PINSEL1_P0_28_Msk      (0x3000000UL)             /*!< P0_28 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_29_Pos      (26UL)                    /*!< P0_29 (Bit 26)                                        */
#define PINCONNECT_PINSEL1_P0_29_Msk      (0xc000000UL)             /*!< P0_29 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL1_P0_30_Pos      (28UL)                    /*!< P0_30 (Bit 28)                                        */
#define PINCONNECT_PINSEL1_P0_30_Msk      (0x30000000UL)            /*!< P0_30 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL2  ======================================================== */
#define PINCONNECT_PINSEL2_P1_0_Pos       (0UL)                     /*!< P1_0 (Bit 0)                                          */
#define PINCONNECT_PINSEL2_P1_0_Msk       (0x3UL)                   /*!< P1_0 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL2_P1_1_Pos       (2UL)                     /*!< P1_1 (Bit 2)                                          */
#define PINCONNECT_PINSEL2_P1_1_Msk       (0xcUL)                   /*!< P1_1 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL2_P1_4_Pos       (8UL)                     /*!< P1_4 (Bit 8)                                          */
#define PINCONNECT_PINSEL2_P1_4_Msk       (0x300UL)                 /*!< P1_4 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL2_P1_8_Pos       (16UL)                    /*!< P1_8 (Bit 16)                                         */
#define PINCONNECT_PINSEL2_P1_8_Msk       (0x30000UL)               /*!< P1_8 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL2_P1_9_Pos       (18UL)                    /*!< P1_9 (Bit 18)                                         */
#define PINCONNECT_PINSEL2_P1_9_Msk       (0xc0000UL)               /*!< P1_9 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL2_P1_10_Pos      (20UL)                    /*!< P1_10 (Bit 20)                                        */
#define PINCONNECT_PINSEL2_P1_10_Msk      (0x300000UL)              /*!< P1_10 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL2_P1_14_Pos      (22UL)                    /*!< P1_14 (Bit 22)                                        */
#define PINCONNECT_PINSEL2_P1_14_Msk      (0xc00000UL)              /*!< P1_14 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL2_P1_15_Pos      (30UL)                    /*!< P1_15 (Bit 30)                                        */
#define PINCONNECT_PINSEL2_P1_15_Msk      (0xc0000000UL)            /*!< P1_15 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL3  ======================================================== */
#define PINCONNECT_PINSEL3_P1_16_Pos      (0UL)                     /*!< P1_16 (Bit 0)                                         */
#define PINCONNECT_PINSEL3_P1_16_Msk      (0x3UL)                   /*!< P1_16 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_17_Pos      (2UL)                     /*!< P1_17 (Bit 2)                                         */
#define PINCONNECT_PINSEL3_P1_17_Msk      (0xcUL)                   /*!< P1_17 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_18_Pos      (4UL)                     /*!< P1_18 (Bit 4)                                         */
#define PINCONNECT_PINSEL3_P1_18_Msk      (0x30UL)                  /*!< P1_18 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_19_Pos      (6UL)                     /*!< P1_19 (Bit 6)                                         */
#define PINCONNECT_PINSEL3_P1_19_Msk      (0xc0UL)                  /*!< P1_19 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_20_Pos      (8UL)                     /*!< P1_20 (Bit 8)                                         */
#define PINCONNECT_PINSEL3_P1_20_Msk      (0x300UL)                 /*!< P1_20 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_21_Pos      (10UL)                    /*!< P1_21 (Bit 10)                                        */
#define PINCONNECT_PINSEL3_P1_21_Msk      (0xc00UL)                 /*!< P1_21 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_22_Pos      (12UL)                    /*!< P1_22 (Bit 12)                                        */
#define PINCONNECT_PINSEL3_P1_22_Msk      (0x3000UL)                /*!< P1_22 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_23_Pos      (14UL)                    /*!< P1_23 (Bit 14)                                        */
#define PINCONNECT_PINSEL3_P1_23_Msk      (0xc000UL)                /*!< P1_23 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_24_Pos      (16UL)                    /*!< P1_24 (Bit 16)                                        */
#define PINCONNECT_PINSEL3_P1_24_Msk      (0x30000UL)               /*!< P1_24 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_25_Pos      (18UL)                    /*!< P1_25 (Bit 18)                                        */
#define PINCONNECT_PINSEL3_P1_25_Msk      (0xc0000UL)               /*!< P1_25 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_26_Pos      (20UL)                    /*!< P1_26 (Bit 20)                                        */
#define PINCONNECT_PINSEL3_P1_26_Msk      (0x300000UL)              /*!< P1_26 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_27_Pos      (22UL)                    /*!< P1_27 (Bit 22)                                        */
#define PINCONNECT_PINSEL3_P1_27_Msk      (0xc00000UL)              /*!< P1_27 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_28_Pos      (24UL)                    /*!< P1_28 (Bit 24)                                        */
#define PINCONNECT_PINSEL3_P1_28_Msk      (0x3000000UL)             /*!< P1_28 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_29_Pos      (26UL)                    /*!< P1_29 (Bit 26)                                        */
#define PINCONNECT_PINSEL3_P1_29_Msk      (0xc000000UL)             /*!< P1_29 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_30_Pos      (28UL)                    /*!< P1_30 (Bit 28)                                        */
#define PINCONNECT_PINSEL3_P1_30_Msk      (0x30000000UL)            /*!< P1_30 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL3_P1_31_Pos      (30UL)                    /*!< P1_31 (Bit 30)                                        */
#define PINCONNECT_PINSEL3_P1_31_Msk      (0xc0000000UL)            /*!< P1_31 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL4  ======================================================== */
#define PINCONNECT_PINSEL4_P2_0_Pos       (0UL)                     /*!< P2_0 (Bit 0)                                          */
#define PINCONNECT_PINSEL4_P2_0_Msk       (0x3UL)                   /*!< P2_0 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_1_Pos       (2UL)                     /*!< P2_1 (Bit 2)                                          */
#define PINCONNECT_PINSEL4_P2_1_Msk       (0xcUL)                   /*!< P2_1 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_2_Pos       (4UL)                     /*!< P2_2 (Bit 4)                                          */
#define PINCONNECT_PINSEL4_P2_2_Msk       (0x30UL)                  /*!< P2_2 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_3_Pos       (6UL)                     /*!< P2_3 (Bit 6)                                          */
#define PINCONNECT_PINSEL4_P2_3_Msk       (0xc0UL)                  /*!< P2_3 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_4_Pos       (8UL)                     /*!< P2_4 (Bit 8)                                          */
#define PINCONNECT_PINSEL4_P2_4_Msk       (0x300UL)                 /*!< P2_4 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_5_Pos       (10UL)                    /*!< P2_5 (Bit 10)                                         */
#define PINCONNECT_PINSEL4_P2_5_Msk       (0xc00UL)                 /*!< P2_5 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_6_Pos       (12UL)                    /*!< P2_6 (Bit 12)                                         */
#define PINCONNECT_PINSEL4_P2_6_Msk       (0x3000UL)                /*!< P2_6 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_7_Pos       (14UL)                    /*!< P2_7 (Bit 14)                                         */
#define PINCONNECT_PINSEL4_P2_7_Msk       (0xc000UL)                /*!< P2_7 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_8_Pos       (16UL)                    /*!< P2_8 (Bit 16)                                         */
#define PINCONNECT_PINSEL4_P2_8_Msk       (0x30000UL)               /*!< P2_8 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_9_Pos       (18UL)                    /*!< P2_9 (Bit 18)                                         */
#define PINCONNECT_PINSEL4_P2_9_Msk       (0xc0000UL)               /*!< P2_9 (Bitfield-Mask: 0x03)                            */
#define PINCONNECT_PINSEL4_P2_10_Pos      (20UL)                    /*!< P2_10 (Bit 20)                                        */
#define PINCONNECT_PINSEL4_P2_10_Msk      (0x300000UL)              /*!< P2_10 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL4_P2_11_Pos      (22UL)                    /*!< P2_11 (Bit 22)                                        */
#define PINCONNECT_PINSEL4_P2_11_Msk      (0xc00000UL)              /*!< P2_11 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL4_P2_12_Pos      (24UL)                    /*!< P2_12 (Bit 24)                                        */
#define PINCONNECT_PINSEL4_P2_12_Msk      (0x3000000UL)             /*!< P2_12 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL4_P2_13_Pos      (26UL)                    /*!< P2_13 (Bit 26)                                        */
#define PINCONNECT_PINSEL4_P2_13_Msk      (0xc000000UL)             /*!< P2_13 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL7  ======================================================== */
#define PINCONNECT_PINSEL7_P3_25_Pos      (18UL)                    /*!< P3_25 (Bit 18)                                        */
#define PINCONNECT_PINSEL7_P3_25_Msk      (0xc0000UL)               /*!< P3_25 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL7_P3_26_Pos      (20UL)                    /*!< P3_26 (Bit 20)                                        */
#define PINCONNECT_PINSEL7_P3_26_Msk      (0x300000UL)              /*!< P3_26 (Bitfield-Mask: 0x03)                           */
/* ========================================================  PINSEL9  ======================================================== */
#define PINCONNECT_PINSEL9_P4_28_Pos      (24UL)                    /*!< P4_28 (Bit 24)                                        */
#define PINCONNECT_PINSEL9_P4_28_Msk      (0x3000000UL)             /*!< P4_28 (Bitfield-Mask: 0x03)                           */
#define PINCONNECT_PINSEL9_P4_29_Pos      (26UL)                    /*!< P4_29 (Bit 26)                                        */
#define PINCONNECT_PINSEL9_P4_29_Msk      (0xc000000UL)             /*!< P4_29 (Bitfield-Mask: 0x03)                           */
/* =======================================================  PINSEL10  ======================================================== */
#define PINCONNECT_PINSEL10_TPIUCTRL_Pos  (3UL)                     /*!< TPIUCTRL (Bit 3)                                      */
#define PINCONNECT_PINSEL10_TPIUCTRL_Msk  (0x8UL)                   /*!< TPIUCTRL (Bitfield-Mask: 0x01)                        */
/* =======================================================  PINMODE0  ======================================================== */
#define PINCONNECT_PINMODE0_P0_00MODE_Pos (0UL)                     /*!< P0_00MODE (Bit 0)                                     */
#define PINCONNECT_PINMODE0_P0_00MODE_Msk (0x3UL)                   /*!< P0_00MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_01MODE_Pos (2UL)                     /*!< P0_01MODE (Bit 2)                                     */
#define PINCONNECT_PINMODE0_P0_01MODE_Msk (0xcUL)                   /*!< P0_01MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_02MODE_Pos (4UL)                     /*!< P0_02MODE (Bit 4)                                     */
#define PINCONNECT_PINMODE0_P0_02MODE_Msk (0x30UL)                  /*!< P0_02MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_03MODE_Pos (6UL)                     /*!< P0_03MODE (Bit 6)                                     */
#define PINCONNECT_PINMODE0_P0_03MODE_Msk (0xc0UL)                  /*!< P0_03MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_04MODE_Pos (8UL)                     /*!< P0_04MODE (Bit 8)                                     */
#define PINCONNECT_PINMODE0_P0_04MODE_Msk (0x300UL)                 /*!< P0_04MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_05MODE_Pos (10UL)                    /*!< P0_05MODE (Bit 10)                                    */
#define PINCONNECT_PINMODE0_P0_05MODE_Msk (0xc00UL)                 /*!< P0_05MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_06MODE_Pos (12UL)                    /*!< P0_06MODE (Bit 12)                                    */
#define PINCONNECT_PINMODE0_P0_06MODE_Msk (0x3000UL)                /*!< P0_06MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_07MODE_Pos (14UL)                    /*!< P0_07MODE (Bit 14)                                    */
#define PINCONNECT_PINMODE0_P0_07MODE_Msk (0xc000UL)                /*!< P0_07MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_08MODE_Pos (16UL)                    /*!< P0_08MODE (Bit 16)                                    */
#define PINCONNECT_PINMODE0_P0_08MODE_Msk (0x30000UL)               /*!< P0_08MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_09MODE_Pos (18UL)                    /*!< P0_09MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE0_P0_09MODE_Msk (0xc0000UL)               /*!< P0_09MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_10MODE_Pos (20UL)                    /*!< P0_10MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE0_P0_10MODE_Msk (0x300000UL)              /*!< P0_10MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_11MODE_Pos (22UL)                    /*!< P0_11MODE (Bit 22)                                    */
#define PINCONNECT_PINMODE0_P0_11MODE_Msk (0xc00000UL)              /*!< P0_11MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE0_P0_15MODE_Pos (30UL)                    /*!< P0_15MODE (Bit 30)                                    */
#define PINCONNECT_PINMODE0_P0_15MODE_Msk (0xc0000000UL)            /*!< P0_15MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE1  ======================================================== */
#define PINCONNECT_PINMODE1_P0_16MODE_Pos (0UL)                     /*!< P0_16MODE (Bit 0)                                     */
#define PINCONNECT_PINMODE1_P0_16MODE_Msk (0x3UL)                   /*!< P0_16MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_17MODE_Pos (2UL)                     /*!< P0_17MODE (Bit 2)                                     */
#define PINCONNECT_PINMODE1_P0_17MODE_Msk (0xcUL)                   /*!< P0_17MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_18MODE_Pos (4UL)                     /*!< P0_18MODE (Bit 4)                                     */
#define PINCONNECT_PINMODE1_P0_18MODE_Msk (0x30UL)                  /*!< P0_18MODE (Bitfield-Mask: 0x03)                       */
