lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define PINCONNECT_PINMODE1_P0_19MODE_Pos (6UL)                     /*!< P0_19MODE (Bit 6)                                     */
#define PINCONNECT_PINMODE1_P0_19MODE_Msk (0xc0UL)                  /*!< P0_19MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_20MODE_Pos (8UL)                     /*!< P0_20MODE (Bit 8)                                     */
#define PINCONNECT_PINMODE1_P0_20MODE_Msk (0x300UL)                 /*!< P0_20MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_21MODE_Pos (10UL)                    /*!< P0_21MODE (Bit 10)                                    */
#define PINCONNECT_PINMODE1_P0_21MODE_Msk (0xc00UL)                 /*!< P0_21MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_22MODE_Pos (12UL)                    /*!< P0_22MODE (Bit 12)                                    */
#define PINCONNECT_PINMODE1_P0_22MODE_Msk (0x3000UL)                /*!< P0_22MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_23MODE_Pos (14UL)                    /*!< P0_23MODE (Bit 14)                                    */
#define PINCONNECT_PINMODE1_P0_23MODE_Msk (0xc000UL)                /*!< P0_23MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_24MODE_Pos (16UL)                    /*!< P0_24MODE (Bit 16)                                    */
#define PINCONNECT_PINMODE1_P0_24MODE_Msk (0x30000UL)               /*!< P0_24MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_25MODE_Pos (18UL)                    /*!< P0_25MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE1_P0_25MODE_Msk (0xc0000UL)               /*!< P0_25MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE1_P0_26MODE_Pos (20UL)                    /*!< P0_26MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE1_P0_26MODE_Msk (0x300000UL)              /*!< P0_26MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE2  ======================================================== */
#define PINCONNECT_PINMODE2_P1_00MODE_Pos (0UL)                     /*!< P1_00MODE (Bit 0)                                     */
#define PINCONNECT_PINMODE2_P1_00MODE_Msk (0x3UL)                   /*!< P1_00MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_01MODE_Pos (2UL)                     /*!< P1_01MODE (Bit 2)                                     */
#define PINCONNECT_PINMODE2_P1_01MODE_Msk (0xcUL)                   /*!< P1_01MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_04MODE_Pos (8UL)                     /*!< P1_04MODE (Bit 8)                                     */
#define PINCONNECT_PINMODE2_P1_04MODE_Msk (0x300UL)                 /*!< P1_04MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_08MODE_Pos (16UL)                    /*!< P1_08MODE (Bit 16)                                    */
#define PINCONNECT_PINMODE2_P1_08MODE_Msk (0x30000UL)               /*!< P1_08MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_09MODE_Pos (18UL)                    /*!< P1_09MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE2_P1_09MODE_Msk (0xc0000UL)               /*!< P1_09MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_10MODE_Pos (20UL)                    /*!< P1_10MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE2_P1_10MODE_Msk (0x300000UL)              /*!< P1_10MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_14MODE_Pos (28UL)                    /*!< P1_14MODE (Bit 28)                                    */
#define PINCONNECT_PINMODE2_P1_14MODE_Msk (0x30000000UL)            /*!< P1_14MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE2_P1_15MODE_Pos (30UL)                    /*!< P1_15MODE (Bit 30)                                    */
#define PINCONNECT_PINMODE2_P1_15MODE_Msk (0xc0000000UL)            /*!< P1_15MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE3  ======================================================== */
#define PINCONNECT_PINMODE3_P1_16MODE_Pos (0UL)                     /*!< P1_16MODE (Bit 0)                                     */
#define PINCONNECT_PINMODE3_P1_16MODE_Msk (0x3UL)                   /*!< P1_16MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_17MODE_Pos (2UL)                     /*!< P1_17MODE (Bit 2)                                     */
#define PINCONNECT_PINMODE3_P1_17MODE_Msk (0xcUL)                   /*!< P1_17MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_18MODE_Pos (4UL)                     /*!< P1_18MODE (Bit 4)                                     */
#define PINCONNECT_PINMODE3_P1_18MODE_Msk (0x30UL)                  /*!< P1_18MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_19MODE_Pos (6UL)                     /*!< P1_19MODE (Bit 6)                                     */
#define PINCONNECT_PINMODE3_P1_19MODE_Msk (0xc0UL)                  /*!< P1_19MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_20MODE_Pos (8UL)                     /*!< P1_20MODE (Bit 8)                                     */
#define PINCONNECT_PINMODE3_P1_20MODE_Msk (0x300UL)                 /*!< P1_20MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_21MODE_Pos (10UL)                    /*!< P1_21MODE (Bit 10)                                    */
#define PINCONNECT_PINMODE3_P1_21MODE_Msk (0xc00UL)                 /*!< P1_21MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_22MODE_Pos (12UL)                    /*!< P1_22MODE (Bit 12)                                    */
#define PINCONNECT_PINMODE3_P1_22MODE_Msk (0x3000UL)                /*!< P1_22MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_23MODE_Pos (14UL)                    /*!< P1_23MODE (Bit 14)                                    */
#define PINCONNECT_PINMODE3_P1_23MODE_Msk (0xc000UL)                /*!< P1_23MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_24MODE_Pos (16UL)                    /*!< P1_24MODE (Bit 16)                                    */
#define PINCONNECT_PINMODE3_P1_24MODE_Msk (0x30000UL)               /*!< P1_24MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_25MODE_Pos (18UL)                    /*!< P1_25MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE3_P1_25MODE_Msk (0xc0000UL)               /*!< P1_25MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_26MODE_Pos (20UL)                    /*!< P1_26MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE3_P1_26MODE_Msk (0x300000UL)              /*!< P1_26MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_27MODE_Pos (22UL)                    /*!< P1_27MODE (Bit 22)                                    */
#define PINCONNECT_PINMODE3_P1_27MODE_Msk (0xc00000UL)              /*!< P1_27MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_28MODE_Pos (24UL)                    /*!< P1_28MODE (Bit 24)                                    */
#define PINCONNECT_PINMODE3_P1_28MODE_Msk (0x3000000UL)             /*!< P1_28MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_29MODE_Pos (26UL)                    /*!< P1_29MODE (Bit 26)                                    */
#define PINCONNECT_PINMODE3_P1_29MODE_Msk (0xc000000UL)             /*!< P1_29MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_30MODE_Pos (28UL)                    /*!< P1_30MODE (Bit 28)                                    */
#define PINCONNECT_PINMODE3_P1_30MODE_Msk (0x30000000UL)            /*!< P1_30MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE3_P1_31MODE_Pos (30UL)                    /*!< P1_31MODE (Bit 30)                                    */
#define PINCONNECT_PINMODE3_P1_31MODE_Msk (0xc0000000UL)            /*!< P1_31MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE4  ======================================================== */
#define PINCONNECT_PINMODE4_P2_00MODE_Pos (0UL)                     /*!< P2_00MODE (Bit 0)                                     */
#define PINCONNECT_PINMODE4_P2_00MODE_Msk (0x3UL)                   /*!< P2_00MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_01MODE_Pos (2UL)                     /*!< P2_01MODE (Bit 2)                                     */
#define PINCONNECT_PINMODE4_P2_01MODE_Msk (0xcUL)                   /*!< P2_01MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_02MODE_Pos (4UL)                     /*!< P2_02MODE (Bit 4)                                     */
#define PINCONNECT_PINMODE4_P2_02MODE_Msk (0x30UL)                  /*!< P2_02MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_03MODE_Pos (6UL)                     /*!< P2_03MODE (Bit 6)                                     */
#define PINCONNECT_PINMODE4_P2_03MODE_Msk (0xc0UL)                  /*!< P2_03MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_04MODE_Pos (8UL)                     /*!< P2_04MODE (Bit 8)                                     */
#define PINCONNECT_PINMODE4_P2_04MODE_Msk (0x300UL)                 /*!< P2_04MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_05MODE_Pos (10UL)                    /*!< P2_05MODE (Bit 10)                                    */
#define PINCONNECT_PINMODE4_P2_05MODE_Msk (0xc00UL)                 /*!< P2_05MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_06MODE_Pos (12UL)                    /*!< P2_06MODE (Bit 12)                                    */
#define PINCONNECT_PINMODE4_P2_06MODE_Msk (0x3000UL)                /*!< P2_06MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_07MODE_Pos (14UL)                    /*!< P2_07MODE (Bit 14)                                    */
#define PINCONNECT_PINMODE4_P2_07MODE_Msk (0xc000UL)                /*!< P2_07MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_08MODE_Pos (16UL)                    /*!< P2_08MODE (Bit 16)                                    */
#define PINCONNECT_PINMODE4_P2_08MODE_Msk (0x30000UL)               /*!< P2_08MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_09MODE_Pos (18UL)                    /*!< P2_09MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE4_P2_09MODE_Msk (0xc0000UL)               /*!< P2_09MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_10MODE_Pos (20UL)                    /*!< P2_10MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE4_P2_10MODE_Msk (0x300000UL)              /*!< P2_10MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_11MODE_Pos (22UL)                    /*!< P2_11MODE (Bit 22)                                    */
#define PINCONNECT_PINMODE4_P2_11MODE_Msk (0xc00000UL)              /*!< P2_11MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_12MODE_Pos (24UL)                    /*!< P2_12MODE (Bit 24)                                    */
#define PINCONNECT_PINMODE4_P2_12MODE_Msk (0x3000000UL)             /*!< P2_12MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE4_P2_13MODE_Pos (26UL)                    /*!< P2_13MODE (Bit 26)                                    */
#define PINCONNECT_PINMODE4_P2_13MODE_Msk (0xc000000UL)             /*!< P2_13MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE7  ======================================================== */
#define PINCONNECT_PINMODE7_P3_25MODE_Pos (18UL)                    /*!< P3_25MODE (Bit 18)                                    */
#define PINCONNECT_PINMODE7_P3_25MODE_Msk (0xc0000UL)               /*!< P3_25MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE7_P3_26MODE_Pos (20UL)                    /*!< P3_26MODE (Bit 20)                                    */
#define PINCONNECT_PINMODE7_P3_26MODE_Msk (0x300000UL)              /*!< P3_26MODE (Bitfield-Mask: 0x03)                       */
/* =======================================================  PINMODE9  ======================================================== */
#define PINCONNECT_PINMODE9_P4_28MODE_Pos (24UL)                    /*!< P4_28MODE (Bit 24)                                    */
#define PINCONNECT_PINMODE9_P4_28MODE_Msk (0x3000000UL)             /*!< P4_28MODE (Bitfield-Mask: 0x03)                       */
#define PINCONNECT_PINMODE9_P4_29MODE_Pos (26UL)                    /*!< P4_29MODE (Bit 26)                                    */
#define PINCONNECT_PINMODE9_P4_29MODE_Msk (0xc000000UL)             /*!< P4_29MODE (Bitfield-Mask: 0x03)                       */
/* ======================================================  PINMODE_OD0  ====================================================== */
#define PINCONNECT_PINMODE_OD0_P0_00OD_Pos (0UL)                    /*!< P0_00OD (Bit 0)                                       */
#define PINCONNECT_PINMODE_OD0_P0_00OD_Msk (0x1UL)                  /*!< P0_00OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_01OD_Pos (1UL)                    /*!< P0_01OD (Bit 1)                                       */
#define PINCONNECT_PINMODE_OD0_P0_01OD_Msk (0x2UL)                  /*!< P0_01OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_02OD_Pos (2UL)                    /*!< P0_02OD (Bit 2)                                       */
#define PINCONNECT_PINMODE_OD0_P0_02OD_Msk (0x4UL)                  /*!< P0_02OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_03OD_Pos (3UL)                    /*!< P0_03OD (Bit 3)                                       */
#define PINCONNECT_PINMODE_OD0_P0_03OD_Msk (0x8UL)                  /*!< P0_03OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_04OD_Pos (4UL)                    /*!< P0_04OD (Bit 4)                                       */
#define PINCONNECT_PINMODE_OD0_P0_04OD_Msk (0x10UL)                 /*!< P0_04OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_05OD_Pos (5UL)                    /*!< P0_05OD (Bit 5)                                       */
#define PINCONNECT_PINMODE_OD0_P0_05OD_Msk (0x20UL)                 /*!< P0_05OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_06OD_Pos (6UL)                    /*!< P0_06OD (Bit 6)                                       */
#define PINCONNECT_PINMODE_OD0_P0_06OD_Msk (0x40UL)                 /*!< P0_06OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_07OD_Pos (7UL)                    /*!< P0_07OD (Bit 7)                                       */
#define PINCONNECT_PINMODE_OD0_P0_07OD_Msk (0x80UL)                 /*!< P0_07OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_08OD_Pos (8UL)                    /*!< P0_08OD (Bit 8)                                       */
#define PINCONNECT_PINMODE_OD0_P0_08OD_Msk (0x100UL)                /*!< P0_08OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_09OD_Pos (9UL)                    /*!< P0_09OD (Bit 9)                                       */
#define PINCONNECT_PINMODE_OD0_P0_09OD_Msk (0x200UL)                /*!< P0_09OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_10OD_Pos (10UL)                   /*!< P0_10OD (Bit 10)                                      */
#define PINCONNECT_PINMODE_OD0_P0_10OD_Msk (0x400UL)                /*!< P0_10OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_11OD_Pos (11UL)                   /*!< P0_11OD (Bit 11)                                      */
#define PINCONNECT_PINMODE_OD0_P0_11OD_Msk (0x800UL)                /*!< P0_11OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_15OD_Pos (15UL)                   /*!< P0_15OD (Bit 15)                                      */
#define PINCONNECT_PINMODE_OD0_P0_15OD_Msk (0x8000UL)               /*!< P0_15OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_16OD_Pos (16UL)                   /*!< P0_16OD (Bit 16)                                      */
#define PINCONNECT_PINMODE_OD0_P0_16OD_Msk (0x10000UL)              /*!< P0_16OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_17OD_Pos (17UL)                   /*!< P0_17OD (Bit 17)                                      */
#define PINCONNECT_PINMODE_OD0_P0_17OD_Msk (0x20000UL)              /*!< P0_17OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_18OD_Pos (18UL)                   /*!< P0_18OD (Bit 18)                                      */
#define PINCONNECT_PINMODE_OD0_P0_18OD_Msk (0x40000UL)              /*!< P0_18OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_19OD_Pos (19UL)                   /*!< P0_19OD (Bit 19)                                      */
#define PINCONNECT_PINMODE_OD0_P0_19OD_Msk (0x80000UL)              /*!< P0_19OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_20OD_Pos (20UL)                   /*!< P0_20OD (Bit 20)                                      */
#define PINCONNECT_PINMODE_OD0_P0_20OD_Msk (0x100000UL)             /*!< P0_20OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_21OD_Pos (21UL)                   /*!< P0_21OD (Bit 21)                                      */
#define PINCONNECT_PINMODE_OD0_P0_21OD_Msk (0x200000UL)             /*!< P0_21OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_22OD_Pos (22UL)                   /*!< P0_22OD (Bit 22)                                      */
#define PINCONNECT_PINMODE_OD0_P0_22OD_Msk (0x400000UL)             /*!< P0_22OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_23OD_Pos (23UL)                   /*!< P0_23OD (Bit 23)                                      */
#define PINCONNECT_PINMODE_OD0_P0_23OD_Msk (0x800000UL)             /*!< P0_23OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_24OD_Pos (24UL)                   /*!< P0_24OD (Bit 24)                                      */
#define PINCONNECT_PINMODE_OD0_P0_24OD_Msk (0x1000000UL)            /*!< P0_24OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_25OD_Pos (25UL)                   /*!< P0_25OD (Bit 25)                                      */
#define PINCONNECT_PINMODE_OD0_P0_25OD_Msk (0x2000000UL)            /*!< P0_25OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_26OD_Pos (26UL)                   /*!< P0_26OD (Bit 26)                                      */
#define PINCONNECT_PINMODE_OD0_P0_26OD_Msk (0x4000000UL)            /*!< P0_26OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_29OD_Pos (29UL)                   /*!< P0_29OD (Bit 29)                                      */
#define PINCONNECT_PINMODE_OD0_P0_29OD_Msk (0x20000000UL)           /*!< P0_29OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD0_P0_30OD_Pos (30UL)                   /*!< P0_30OD (Bit 30)                                      */
#define PINCONNECT_PINMODE_OD0_P0_30OD_Msk (0x40000000UL)           /*!< P0_30OD (Bitfield-Mask: 0x01)                         */
/* ======================================================  PINMODE_OD1  ====================================================== */
#define PINCONNECT_PINMODE_OD1_P1_00OD_Pos (0UL)                    /*!< P1_00OD (Bit 0)                                       */
#define PINCONNECT_PINMODE_OD1_P1_00OD_Msk (0x1UL)                  /*!< P1_00OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_01OD_Pos (1UL)                    /*!< P1_01OD (Bit 1)                                       */
#define PINCONNECT_PINMODE_OD1_P1_01OD_Msk (0x2UL)                  /*!< P1_01OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_04OD_Pos (4UL)                    /*!< P1_04OD (Bit 4)                                       */
#define PINCONNECT_PINMODE_OD1_P1_04OD_Msk (0x10UL)                 /*!< P1_04OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_08OD_Pos (8UL)                    /*!< P1_08OD (Bit 8)                                       */
#define PINCONNECT_PINMODE_OD1_P1_08OD_Msk (0x100UL)                /*!< P1_08OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_09OD_Pos (9UL)                    /*!< P1_09OD (Bit 9)                                       */
#define PINCONNECT_PINMODE_OD1_P1_09OD_Msk (0x200UL)                /*!< P1_09OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_10OD_Pos (10UL)                   /*!< P1_10OD (Bit 10)                                      */
#define PINCONNECT_PINMODE_OD1_P1_10OD_Msk (0x400UL)                /*!< P1_10OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_14OD_Pos (14UL)                   /*!< P1_14OD (Bit 14)                                      */
#define PINCONNECT_PINMODE_OD1_P1_14OD_Msk (0x4000UL)               /*!< P1_14OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_15OD_Pos (15UL)                   /*!< P1_15OD (Bit 15)                                      */
#define PINCONNECT_PINMODE_OD1_P1_15OD_Msk (0x8000UL)               /*!< P1_15OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_16OD_Pos (16UL)                   /*!< P1_16OD (Bit 16)                                      */
#define PINCONNECT_PINMODE_OD1_P1_16OD_Msk (0x10000UL)              /*!< P1_16OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_17OD_Pos (17UL)                   /*!< P1_17OD (Bit 17)                                      */
#define PINCONNECT_PINMODE_OD1_P1_17OD_Msk (0x20000UL)              /*!< P1_17OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_18OD_Pos (18UL)                   /*!< P1_18OD (Bit 18)                                      */
#define PINCONNECT_PINMODE_OD1_P1_18OD_Msk (0x40000UL)              /*!< P1_18OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_19OD_Pos (19UL)                   /*!< P1_19OD (Bit 19)                                      */
#define PINCONNECT_PINMODE_OD1_P1_19OD_Msk (0x80000UL)              /*!< P1_19OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_20OD_Pos (20UL)                   /*!< P1_20OD (Bit 20)                                      */
