lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define PINCONNECT_PINMODE_OD1_P1_20OD_Msk (0x100000UL)             /*!< P1_20OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_21OD_Pos (21UL)                   /*!< P1_21OD (Bit 21)                                      */
#define PINCONNECT_PINMODE_OD1_P1_21OD_Msk (0x200000UL)             /*!< P1_21OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_22OD_Pos (22UL)                   /*!< P1_22OD (Bit 22)                                      */
#define PINCONNECT_PINMODE_OD1_P1_22OD_Msk (0x400000UL)             /*!< P1_22OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_23OD_Pos (23UL)                   /*!< P1_23OD (Bit 23)                                      */
#define PINCONNECT_PINMODE_OD1_P1_23OD_Msk (0x800000UL)             /*!< P1_23OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_24OD_Pos (24UL)                   /*!< P1_24OD (Bit 24)                                      */
#define PINCONNECT_PINMODE_OD1_P1_24OD_Msk (0x1000000UL)            /*!< P1_24OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_25OD_Pos (25UL)                   /*!< P1_25OD (Bit 25)                                      */
#define PINCONNECT_PINMODE_OD1_P1_25OD_Msk (0x2000000UL)            /*!< P1_25OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_26OD_Pos (26UL)                   /*!< P1_26OD (Bit 26)                                      */
#define PINCONNECT_PINMODE_OD1_P1_26OD_Msk (0x4000000UL)            /*!< P1_26OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_27OD_Pos (27UL)                   /*!< P1_27OD (Bit 27)                                      */
#define PINCONNECT_PINMODE_OD1_P1_27OD_Msk (0x8000000UL)            /*!< P1_27OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_28OD_Pos (28UL)                   /*!< P1_28OD (Bit 28)                                      */
#define PINCONNECT_PINMODE_OD1_P1_28OD_Msk (0x10000000UL)           /*!< P1_28OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_29OD_Pos (29UL)                   /*!< P1_29OD (Bit 29)                                      */
#define PINCONNECT_PINMODE_OD1_P1_29OD_Msk (0x20000000UL)           /*!< P1_29OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_30OD_Pos (30UL)                   /*!< P1_30OD (Bit 30)                                      */
#define PINCONNECT_PINMODE_OD1_P1_30OD_Msk (0x40000000UL)           /*!< P1_30OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD1_P1_31OD_Pos (31UL)                   /*!< P1_31OD (Bit 31)                                      */
#define PINCONNECT_PINMODE_OD1_P1_31OD_Msk (0x80000000UL)           /*!< P1_31OD (Bitfield-Mask: 0x01)                         */
/* ======================================================  PINMODE_OD2  ====================================================== */
#define PINCONNECT_PINMODE_OD2_P2_00OD_Pos (0UL)                    /*!< P2_00OD (Bit 0)                                       */
#define PINCONNECT_PINMODE_OD2_P2_00OD_Msk (0x1UL)                  /*!< P2_00OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_01OD_Pos (1UL)                    /*!< P2_01OD (Bit 1)                                       */
#define PINCONNECT_PINMODE_OD2_P2_01OD_Msk (0x2UL)                  /*!< P2_01OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_02OD_Pos (2UL)                    /*!< P2_02OD (Bit 2)                                       */
#define PINCONNECT_PINMODE_OD2_P2_02OD_Msk (0x4UL)                  /*!< P2_02OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_03OD_Pos (3UL)                    /*!< P2_03OD (Bit 3)                                       */
#define PINCONNECT_PINMODE_OD2_P2_03OD_Msk (0x8UL)                  /*!< P2_03OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_04OD_Pos (4UL)                    /*!< P2_04OD (Bit 4)                                       */
#define PINCONNECT_PINMODE_OD2_P2_04OD_Msk (0x10UL)                 /*!< P2_04OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_05OD_Pos (5UL)                    /*!< P2_05OD (Bit 5)                                       */
#define PINCONNECT_PINMODE_OD2_P2_05OD_Msk (0x20UL)                 /*!< P2_05OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_06OD_Pos (6UL)                    /*!< P2_06OD (Bit 6)                                       */
#define PINCONNECT_PINMODE_OD2_P2_06OD_Msk (0x40UL)                 /*!< P2_06OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_07OD_Pos (7UL)                    /*!< P2_07OD (Bit 7)                                       */
#define PINCONNECT_PINMODE_OD2_P2_07OD_Msk (0x80UL)                 /*!< P2_07OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_08OD_Pos (8UL)                    /*!< P2_08OD (Bit 8)                                       */
#define PINCONNECT_PINMODE_OD2_P2_08OD_Msk (0x100UL)                /*!< P2_08OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_09OD_Pos (9UL)                    /*!< P2_09OD (Bit 9)                                       */
#define PINCONNECT_PINMODE_OD2_P2_09OD_Msk (0x200UL)                /*!< P2_09OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_10OD_Pos (10UL)                   /*!< P2_10OD (Bit 10)                                      */
#define PINCONNECT_PINMODE_OD2_P2_10OD_Msk (0x400UL)                /*!< P2_10OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_11OD_Pos (11UL)                   /*!< P2_11OD (Bit 11)                                      */
#define PINCONNECT_PINMODE_OD2_P2_11OD_Msk (0x800UL)                /*!< P2_11OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_12OD_Pos (12UL)                   /*!< P2_12OD (Bit 12)                                      */
#define PINCONNECT_PINMODE_OD2_P2_12OD_Msk (0x1000UL)               /*!< P2_12OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD2_P2_13OD_Pos (13UL)                   /*!< P2_13OD (Bit 13)                                      */
#define PINCONNECT_PINMODE_OD2_P2_13OD_Msk (0x2000UL)               /*!< P2_13OD (Bitfield-Mask: 0x01)                         */
/* ======================================================  PINMODE_OD3  ====================================================== */
#define PINCONNECT_PINMODE_OD3_P3_25OD_Pos (25UL)                   /*!< P3_25OD (Bit 25)                                      */
#define PINCONNECT_PINMODE_OD3_P3_25OD_Msk (0x2000000UL)            /*!< P3_25OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD3_P3_26OD_Pos (26UL)                   /*!< P3_26OD (Bit 26)                                      */
#define PINCONNECT_PINMODE_OD3_P3_26OD_Msk (0x4000000UL)            /*!< P3_26OD (Bitfield-Mask: 0x01)                         */
/* ======================================================  PINMODE_OD4  ====================================================== */
#define PINCONNECT_PINMODE_OD4_P4_28OD_Pos (28UL)                   /*!< P4_28OD (Bit 28)                                      */
#define PINCONNECT_PINMODE_OD4_P4_28OD_Msk (0x10000000UL)           /*!< P4_28OD (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_PINMODE_OD4_P4_29OD_Pos (29UL)                   /*!< P4_29OD (Bit 29)                                      */
#define PINCONNECT_PINMODE_OD4_P4_29OD_Msk (0x20000000UL)           /*!< P4_29OD (Bitfield-Mask: 0x01)                         */
/* =======================================================  I2CPADCFG  ======================================================= */
#define PINCONNECT_I2CPADCFG_SDADRV0_Pos  (0UL)                     /*!< SDADRV0 (Bit 0)                                       */
#define PINCONNECT_I2CPADCFG_SDADRV0_Msk  (0x1UL)                   /*!< SDADRV0 (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_I2CPADCFG_SDAI2C0_Pos  (1UL)                     /*!< SDAI2C0 (Bit 1)                                       */
#define PINCONNECT_I2CPADCFG_SDAI2C0_Msk  (0x2UL)                   /*!< SDAI2C0 (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_I2CPADCFG_SCLDRV0_Pos  (2UL)                     /*!< SCLDRV0 (Bit 2)                                       */
#define PINCONNECT_I2CPADCFG_SCLDRV0_Msk  (0x4UL)                   /*!< SCLDRV0 (Bitfield-Mask: 0x01)                         */
#define PINCONNECT_I2CPADCFG_SCLI2C0_Pos  (3UL)                     /*!< SCLI2C0 (Bit 3)                                       */
#define PINCONNECT_I2CPADCFG_SCLI2C0_Msk  (0x8UL)                   /*!< SCLI2C0 (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                         LPC_SSP1                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define SSP1_CR0_DSS_Pos                  (0UL)                     /*!< DSS (Bit 0)                                           */
#define SSP1_CR0_DSS_Msk                  (0xfUL)                   /*!< DSS (Bitfield-Mask: 0x0f)                             */
#define SSP1_CR0_FRF_Pos                  (4UL)                     /*!< FRF (Bit 4)                                           */
#define SSP1_CR0_FRF_Msk                  (0x30UL)                  /*!< FRF (Bitfield-Mask: 0x03)                             */
#define SSP1_CR0_CPOL_Pos                 (6UL)                     /*!< CPOL (Bit 6)                                          */
#define SSP1_CR0_CPOL_Msk                 (0x40UL)                  /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SSP1_CR0_CPHA_Pos                 (7UL)                     /*!< CPHA (Bit 7)                                          */
#define SSP1_CR0_CPHA_Msk                 (0x80UL)                  /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define SSP1_CR0_SCR_Pos                  (8UL)                     /*!< SCR (Bit 8)                                           */
#define SSP1_CR0_SCR_Msk                  (0xff00UL)                /*!< SCR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR1  ========================================================== */
#define SSP1_CR1_LBM_Pos                  (0UL)                     /*!< LBM (Bit 0)                                           */
#define SSP1_CR1_LBM_Msk                  (0x1UL)                   /*!< LBM (Bitfield-Mask: 0x01)                             */
#define SSP1_CR1_SSE_Pos                  (1UL)                     /*!< SSE (Bit 1)                                           */
#define SSP1_CR1_SSE_Msk                  (0x2UL)                   /*!< SSE (Bitfield-Mask: 0x01)                             */
#define SSP1_CR1_MS_Pos                   (2UL)                     /*!< MS (Bit 2)                                            */
#define SSP1_CR1_MS_Msk                   (0x4UL)                   /*!< MS (Bitfield-Mask: 0x01)                              */
#define SSP1_CR1_SOD_Pos                  (3UL)                     /*!< SOD (Bit 3)                                           */
#define SSP1_CR1_SOD_Msk                  (0x8UL)                   /*!< SOD (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define SSP1_DR_DATA_Pos                  (0UL)                     /*!< DATA (Bit 0)                                          */
#define SSP1_DR_DATA_Msk                  (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  SR  =========================================================== */
#define SSP1_SR_TFE_Pos                   (0UL)                     /*!< TFE (Bit 0)                                           */
#define SSP1_SR_TFE_Msk                   (0x1UL)                   /*!< TFE (Bitfield-Mask: 0x01)                             */
#define SSP1_SR_TNF_Pos                   (1UL)                     /*!< TNF (Bit 1)                                           */
#define SSP1_SR_TNF_Msk                   (0x2UL)                   /*!< TNF (Bitfield-Mask: 0x01)                             */
#define SSP1_SR_RNE_Pos                   (2UL)                     /*!< RNE (Bit 2)                                           */
#define SSP1_SR_RNE_Msk                   (0x4UL)                   /*!< RNE (Bitfield-Mask: 0x01)                             */
#define SSP1_SR_RFF_Pos                   (3UL)                     /*!< RFF (Bit 3)                                           */
#define SSP1_SR_RFF_Msk                   (0x8UL)                   /*!< RFF (Bitfield-Mask: 0x01)                             */
#define SSP1_SR_BSY_Pos                   (4UL)                     /*!< BSY (Bit 4)                                           */
#define SSP1_SR_BSY_Msk                   (0x10UL)                  /*!< BSY (Bitfield-Mask: 0x01)                             */
/* =========================================================  CPSR  ========================================================== */
#define SSP1_CPSR_CPSDVSR_Pos             (0UL)                     /*!< CPSDVSR (Bit 0)                                       */
#define SSP1_CPSR_CPSDVSR_Msk             (0xffUL)                  /*!< CPSDVSR (Bitfield-Mask: 0xff)                         */
/* =========================================================  IMSC  ========================================================== */
#define SSP1_IMSC_RORIM_Pos               (0UL)                     /*!< RORIM (Bit 0)                                         */
#define SSP1_IMSC_RORIM_Msk               (0x1UL)                   /*!< RORIM (Bitfield-Mask: 0x01)                           */
#define SSP1_IMSC_RTIM_Pos                (1UL)                     /*!< RTIM (Bit 1)                                          */
#define SSP1_IMSC_RTIM_Msk                (0x2UL)                   /*!< RTIM (Bitfield-Mask: 0x01)                            */
#define SSP1_IMSC_RXIM_Pos                (2UL)                     /*!< RXIM (Bit 2)                                          */
#define SSP1_IMSC_RXIM_Msk                (0x4UL)                   /*!< RXIM (Bitfield-Mask: 0x01)                            */
#define SSP1_IMSC_TXIM_Pos                (3UL)                     /*!< TXIM (Bit 3)                                          */
#define SSP1_IMSC_TXIM_Msk                (0x8UL)                   /*!< TXIM (Bitfield-Mask: 0x01)                            */
/* ==========================================================  RIS  ========================================================== */
#define SSP1_RIS_RORRIS_Pos               (0UL)                     /*!< RORRIS (Bit 0)                                        */
#define SSP1_RIS_RORRIS_Msk               (0x1UL)                   /*!< RORRIS (Bitfield-Mask: 0x01)                          */
#define SSP1_RIS_RTRIS_Pos                (1UL)                     /*!< RTRIS (Bit 1)                                         */
#define SSP1_RIS_RTRIS_Msk                (0x2UL)                   /*!< RTRIS (Bitfield-Mask: 0x01)                           */
#define SSP1_RIS_RXRIS_Pos                (2UL)                     /*!< RXRIS (Bit 2)                                         */
#define SSP1_RIS_RXRIS_Msk                (0x4UL)                   /*!< RXRIS (Bitfield-Mask: 0x01)                           */
#define SSP1_RIS_TXRIS_Pos                (3UL)                     /*!< TXRIS (Bit 3)                                         */
#define SSP1_RIS_TXRIS_Msk                (0x8UL)                   /*!< TXRIS (Bitfield-Mask: 0x01)                           */
/* ==========================================================  MIS  ========================================================== */
#define SSP1_MIS_RORMIS_Pos               (0UL)                     /*!< RORMIS (Bit 0)                                        */
#define SSP1_MIS_RORMIS_Msk               (0x1UL)                   /*!< RORMIS (Bitfield-Mask: 0x01)                          */
#define SSP1_MIS_RTMIS_Pos                (1UL)                     /*!< RTMIS (Bit 1)                                         */
#define SSP1_MIS_RTMIS_Msk                (0x2UL)                   /*!< RTMIS (Bitfield-Mask: 0x01)                           */
#define SSP1_MIS_RXMIS_Pos                (2UL)                     /*!< RXMIS (Bit 2)                                         */
#define SSP1_MIS_RXMIS_Msk                (0x4UL)                   /*!< RXMIS (Bitfield-Mask: 0x01)                           */
#define SSP1_MIS_TXMIS_Pos                (3UL)                     /*!< TXMIS (Bit 3)                                         */
#define SSP1_MIS_TXMIS_Msk                (0x8UL)                   /*!< TXMIS (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ICR  ========================================================== */
#define SSP1_ICR_RORIC_Pos                (0UL)                     /*!< RORIC (Bit 0)                                         */
#define SSP1_ICR_RORIC_Msk                (0x1UL)                   /*!< RORIC (Bitfield-Mask: 0x01)                           */
#define SSP1_ICR_RTIC_Pos                 (1UL)                     /*!< RTIC (Bit 1)                                          */
#define SSP1_ICR_RTIC_Msk                 (0x2UL)                   /*!< RTIC (Bitfield-Mask: 0x01)                            */
/* =========================================================  DMACR  ========================================================= */
#define SSP1_DMACR_RXDMAE_Pos             (0UL)                     /*!< RXDMAE (Bit 0)                                        */
#define SSP1_DMACR_RXDMAE_Msk             (0x1UL)                   /*!< RXDMAE (Bitfield-Mask: 0x01)                          */
#define SSP1_DMACR_TXDMAE_Pos             (1UL)                     /*!< TXDMAE (Bit 1)                                        */
#define SSP1_DMACR_TXDMAE_Msk             (0x2UL)                   /*!< TXDMAE (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          LPC_ADC                                          ================ */
/* =========================================================================================================================== */

