lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  CR  =========================================================== */
#define ADC_CR_SEL_Pos                    (0UL)                     /*!< SEL (Bit 0)                                           */
#define ADC_CR_SEL_Msk                    (0xffUL)                  /*!< SEL (Bitfield-Mask: 0xff)                             */
#define ADC_CR_CLKDIV_Pos                 (8UL)                     /*!< CLKDIV (Bit 8)                                        */
#define ADC_CR_CLKDIV_Msk                 (0xff00UL)                /*!< CLKDIV (Bitfield-Mask: 0xff)                          */
#define ADC_CR_BURST_Pos                  (16UL)                    /*!< BURST (Bit 16)                                        */
#define ADC_CR_BURST_Msk                  (0x10000UL)               /*!< BURST (Bitfield-Mask: 0x01)                           */
#define ADC_CR_PDN_Pos                    (21UL)                    /*!< PDN (Bit 21)                                          */
#define ADC_CR_PDN_Msk                    (0x200000UL)              /*!< PDN (Bitfield-Mask: 0x01)                             */
#define ADC_CR_START_Pos                  (24UL)                    /*!< START (Bit 24)                                        */
#define ADC_CR_START_Msk                  (0x7000000UL)             /*!< START (Bitfield-Mask: 0x07)                           */
#define ADC_CR_EDGE_Pos                   (27UL)                    /*!< EDGE (Bit 27)                                         */
#define ADC_CR_EDGE_Msk                   (0x8000000UL)             /*!< EDGE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  GDR  ========================================================== */
#define ADC_GDR_RESULT_Pos                (4UL)                     /*!< RESULT (Bit 4)                                        */
#define ADC_GDR_RESULT_Msk                (0xfff0UL)                /*!< RESULT (Bitfield-Mask: 0xfff)                         */
#define ADC_GDR_CHN_Pos                   (24UL)                    /*!< CHN (Bit 24)                                          */
#define ADC_GDR_CHN_Msk                   (0x7000000UL)             /*!< CHN (Bitfield-Mask: 0x07)                             */
#define ADC_GDR_OVERRUN_Pos               (30UL)                    /*!< OVERRUN (Bit 30)                                      */
#define ADC_GDR_OVERRUN_Msk               (0x40000000UL)            /*!< OVERRUN (Bitfield-Mask: 0x01)                         */
#define ADC_GDR_DONE_Pos                  (31UL)                    /*!< DONE (Bit 31)                                         */
#define ADC_GDR_DONE_Msk                  (0x80000000UL)            /*!< DONE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTEN  ========================================================= */
#define ADC_INTEN_ADINTEN0_Pos            (0UL)                     /*!< ADINTEN0 (Bit 0)                                      */
#define ADC_INTEN_ADINTEN0_Msk            (0x1UL)                   /*!< ADINTEN0 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN1_Pos            (1UL)                     /*!< ADINTEN1 (Bit 1)                                      */
#define ADC_INTEN_ADINTEN1_Msk            (0x2UL)                   /*!< ADINTEN1 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN2_Pos            (2UL)                     /*!< ADINTEN2 (Bit 2)                                      */
#define ADC_INTEN_ADINTEN2_Msk            (0x4UL)                   /*!< ADINTEN2 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN3_Pos            (3UL)                     /*!< ADINTEN3 (Bit 3)                                      */
#define ADC_INTEN_ADINTEN3_Msk            (0x8UL)                   /*!< ADINTEN3 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN4_Pos            (4UL)                     /*!< ADINTEN4 (Bit 4)                                      */
#define ADC_INTEN_ADINTEN4_Msk            (0x10UL)                  /*!< ADINTEN4 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN5_Pos            (5UL)                     /*!< ADINTEN5 (Bit 5)                                      */
#define ADC_INTEN_ADINTEN5_Msk            (0x20UL)                  /*!< ADINTEN5 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN6_Pos            (6UL)                     /*!< ADINTEN6 (Bit 6)                                      */
#define ADC_INTEN_ADINTEN6_Msk            (0x40UL)                  /*!< ADINTEN6 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADINTEN7_Pos            (7UL)                     /*!< ADINTEN7 (Bit 7)                                      */
#define ADC_INTEN_ADINTEN7_Msk            (0x80UL)                  /*!< ADINTEN7 (Bitfield-Mask: 0x01)                        */
#define ADC_INTEN_ADGINTEN_Pos            (8UL)                     /*!< ADGINTEN (Bit 8)                                      */
#define ADC_INTEN_ADGINTEN_Msk            (0x100UL)                 /*!< ADGINTEN (Bitfield-Mask: 0x01)                        */
/* =========================================================  STAT  ========================================================== */
#define ADC_STAT_DONE0_Pos                (0UL)                     /*!< DONE0 (Bit 0)                                         */
#define ADC_STAT_DONE0_Msk                (0x1UL)                   /*!< DONE0 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE1_Pos                (1UL)                     /*!< DONE1 (Bit 1)                                         */
#define ADC_STAT_DONE1_Msk                (0x2UL)                   /*!< DONE1 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE2_Pos                (2UL)                     /*!< DONE2 (Bit 2)                                         */
#define ADC_STAT_DONE2_Msk                (0x4UL)                   /*!< DONE2 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE3_Pos                (3UL)                     /*!< DONE3 (Bit 3)                                         */
#define ADC_STAT_DONE3_Msk                (0x8UL)                   /*!< DONE3 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE4_Pos                (4UL)                     /*!< DONE4 (Bit 4)                                         */
#define ADC_STAT_DONE4_Msk                (0x10UL)                  /*!< DONE4 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE5_Pos                (5UL)                     /*!< DONE5 (Bit 5)                                         */
#define ADC_STAT_DONE5_Msk                (0x20UL)                  /*!< DONE5 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE6_Pos                (6UL)                     /*!< DONE6 (Bit 6)                                         */
#define ADC_STAT_DONE6_Msk                (0x40UL)                  /*!< DONE6 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_DONE7_Pos                (7UL)                     /*!< DONE7 (Bit 7)                                         */
#define ADC_STAT_DONE7_Msk                (0x80UL)                  /*!< DONE7 (Bitfield-Mask: 0x01)                           */
#define ADC_STAT_OVERRUN0_Pos             (8UL)                     /*!< OVERRUN0 (Bit 8)                                      */
#define ADC_STAT_OVERRUN0_Msk             (0x100UL)                 /*!< OVERRUN0 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN1_Pos             (9UL)                     /*!< OVERRUN1 (Bit 9)                                      */
#define ADC_STAT_OVERRUN1_Msk             (0x200UL)                 /*!< OVERRUN1 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN2_Pos             (10UL)                    /*!< OVERRUN2 (Bit 10)                                     */
#define ADC_STAT_OVERRUN2_Msk             (0x400UL)                 /*!< OVERRUN2 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN3_Pos             (11UL)                    /*!< OVERRUN3 (Bit 11)                                     */
#define ADC_STAT_OVERRUN3_Msk             (0x800UL)                 /*!< OVERRUN3 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN4_Pos             (12UL)                    /*!< OVERRUN4 (Bit 12)                                     */
#define ADC_STAT_OVERRUN4_Msk             (0x1000UL)                /*!< OVERRUN4 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN5_Pos             (13UL)                    /*!< OVERRUN5 (Bit 13)                                     */
#define ADC_STAT_OVERRUN5_Msk             (0x2000UL)                /*!< OVERRUN5 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN6_Pos             (14UL)                    /*!< OVERRUN6 (Bit 14)                                     */
#define ADC_STAT_OVERRUN6_Msk             (0x4000UL)                /*!< OVERRUN6 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_OVERRUN7_Pos             (15UL)                    /*!< OVERRUN7 (Bit 15)                                     */
#define ADC_STAT_OVERRUN7_Msk             (0x8000UL)                /*!< OVERRUN7 (Bitfield-Mask: 0x01)                        */
#define ADC_STAT_ADINT_Pos                (16UL)                    /*!< ADINT (Bit 16)                                        */
#define ADC_STAT_ADINT_Msk                (0x10000UL)               /*!< ADINT (Bitfield-Mask: 0x01)                           */
/* ==========================================================  TRM  ========================================================== */
#define ADC_TRM_ADCOFFS_Pos               (4UL)                     /*!< ADCOFFS (Bit 4)                                       */
#define ADC_TRM_ADCOFFS_Msk               (0xf0UL)                  /*!< ADCOFFS (Bitfield-Mask: 0x0f)                         */
#define ADC_TRM_TRIM_Pos                  (8UL)                     /*!< TRIM (Bit 8)                                          */
#define ADC_TRM_TRIM_Msk                  (0xf00UL)                 /*!< TRIM (Bitfield-Mask: 0x0f)                            */


/* =========================================================================================================================== */
/* ================                                       LPC_CANAFRAM                                        ================ */
/* =========================================================================================================================== */



/* =========================================================================================================================== */
/* ================                                         LPC_CANAF                                         ================ */
/* =========================================================================================================================== */

