lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* =========================================================  AFMR  ========================================================== */
#define CANAF_AFMR_ACCOFF_Pos             (0UL)                     /*!< ACCOFF (Bit 0)                                        */
#define CANAF_AFMR_ACCOFF_Msk             (0x1UL)                   /*!< ACCOFF (Bitfield-Mask: 0x01)                          */
#define CANAF_AFMR_ACCBP_Pos              (1UL)                     /*!< ACCBP (Bit 1)                                         */
#define CANAF_AFMR_ACCBP_Msk              (0x2UL)                   /*!< ACCBP (Bitfield-Mask: 0x01)                           */
#define CANAF_AFMR_EFCAN_Pos              (2UL)                     /*!< EFCAN (Bit 2)                                         */
#define CANAF_AFMR_EFCAN_Msk              (0x4UL)                   /*!< EFCAN (Bitfield-Mask: 0x01)                           */
/* ========================================================  SFF_SA  ========================================================= */
#define CANAF_SFF_SA_SFF_SA_Pos           (2UL)                     /*!< SFF_SA (Bit 2)                                        */
#define CANAF_SFF_SA_SFF_SA_Msk           (0x7fcUL)                 /*!< SFF_SA (Bitfield-Mask: 0x1ff)                         */
/* ======================================================  SFF_GRP_SA  ======================================================= */
#define CANAF_SFF_GRP_SA_SFF_GRP_SA_Pos   (2UL)                     /*!< SFF_GRP_SA (Bit 2)                                    */
#define CANAF_SFF_GRP_SA_SFF_GRP_SA_Msk   (0xffcUL)                 /*!< SFF_GRP_SA (Bitfield-Mask: 0x3ff)                     */
/* ========================================================  EFF_SA  ========================================================= */
#define CANAF_EFF_SA_EFF_SA_Pos           (2UL)                     /*!< EFF_SA (Bit 2)                                        */
#define CANAF_EFF_SA_EFF_SA_Msk           (0x7fcUL)                 /*!< EFF_SA (Bitfield-Mask: 0x1ff)                         */
/* ======================================================  EFF_GRP_SA  ======================================================= */
#define CANAF_EFF_GRP_SA_EFF_GRP_SA_Pos   (2UL)                     /*!< EFF_GRP_SA (Bit 2)                                    */
#define CANAF_EFF_GRP_SA_EFF_GRP_SA_Msk   (0xffcUL)                 /*!< EFF_GRP_SA (Bitfield-Mask: 0x3ff)                     */
/* ======================================================  ENDOFTABLE  ======================================================= */
#define CANAF_ENDOFTABLE_ENDOFTABLE_Pos   (2UL)                     /*!< ENDOFTABLE (Bit 2)                                    */
#define CANAF_ENDOFTABLE_ENDOFTABLE_Msk   (0xffcUL)                 /*!< ENDOFTABLE (Bitfield-Mask: 0x3ff)                     */
/* =======================================================  LUTERRAD  ======================================================== */
#define CANAF_LUTERRAD_LUTERRAD_Pos       (2UL)                     /*!< LUTERRAD (Bit 2)                                      */
#define CANAF_LUTERRAD_LUTERRAD_Msk       (0x7fcUL)                 /*!< LUTERRAD (Bitfield-Mask: 0x1ff)                       */
/* ========================================================  LUTERR  ========================================================= */
#define CANAF_LUTERR_LUTERR_Pos           (0UL)                     /*!< LUTERR (Bit 0)                                        */
#define CANAF_LUTERR_LUTERR_Msk           (0x1UL)                   /*!< LUTERR (Bitfield-Mask: 0x01)                          */
/* ========================================================  FCANIE  ========================================================= */
#define CANAF_FCANIE_FCANIE_Pos           (0UL)                     /*!< FCANIE (Bit 0)                                        */
#define CANAF_FCANIE_FCANIE_Msk           (0x1UL)                   /*!< FCANIE (Bitfield-Mask: 0x01)                          */
/* ========================================================  FCANIC0  ======================================================== */
#define CANAF_FCANIC0_INTPND_Pos          (0UL)                     /*!< INTPND (Bit 0)                                        */
#define CANAF_FCANIC0_INTPND_Msk          (0xffffffffUL)            /*!< INTPND (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  FCANIC1  ======================================================== */
#define CANAF_FCANIC1_IntPnd32_Pos        (0UL)                     /*!< IntPnd32 (Bit 0)                                      */
#define CANAF_FCANIC1_IntPnd32_Msk        (0xffffffffUL)            /*!< IntPnd32 (Bitfield-Mask: 0xffffffff)                  */


/* =========================================================================================================================== */
/* ================                                         LPC_CCAN                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  TXSR  ========================================================== */
#define CCAN_TXSR_TS1_Pos                 (0UL)                     /*!< TS1 (Bit 0)                                           */
#define CCAN_TXSR_TS1_Msk                 (0x1UL)                   /*!< TS1 (Bitfield-Mask: 0x01)                             */
#define CCAN_TXSR_TS2_Pos                 (1UL)                     /*!< TS2 (Bit 1)                                           */
#define CCAN_TXSR_TS2_Msk                 (0x2UL)                   /*!< TS2 (Bitfield-Mask: 0x01)                             */
#define CCAN_TXSR_TBS1_Pos                (8UL)                     /*!< TBS1 (Bit 8)                                          */
#define CCAN_TXSR_TBS1_Msk                (0x100UL)                 /*!< TBS1 (Bitfield-Mask: 0x01)                            */
#define CCAN_TXSR_TBS2_Pos                (9UL)                     /*!< TBS2 (Bit 9)                                          */
#define CCAN_TXSR_TBS2_Msk                (0x200UL)                 /*!< TBS2 (Bitfield-Mask: 0x01)                            */
#define CCAN_TXSR_TCS1_Pos                (16UL)                    /*!< TCS1 (Bit 16)                                         */
#define CCAN_TXSR_TCS1_Msk                (0x10000UL)               /*!< TCS1 (Bitfield-Mask: 0x01)                            */
#define CCAN_TXSR_TCS2_Pos                (17UL)                    /*!< TCS2 (Bit 17)                                         */
#define CCAN_TXSR_TCS2_Msk                (0x20000UL)               /*!< TCS2 (Bitfield-Mask: 0x01)                            */
/* =========================================================  RXSR  ========================================================== */
#define CCAN_RXSR_RS1_Pos                 (0UL)                     /*!< RS1 (Bit 0)                                           */
#define CCAN_RXSR_RS1_Msk                 (0x1UL)                   /*!< RS1 (Bitfield-Mask: 0x01)                             */
#define CCAN_RXSR_RS2_Pos                 (1UL)                     /*!< RS2 (Bit 1)                                           */
#define CCAN_RXSR_RS2_Msk                 (0x2UL)                   /*!< RS2 (Bitfield-Mask: 0x01)                             */
#define CCAN_RXSR_RB1_Pos                 (8UL)                     /*!< RB1 (Bit 8)                                           */
#define CCAN_RXSR_RB1_Msk                 (0x100UL)                 /*!< RB1 (Bitfield-Mask: 0x01)                             */
#define CCAN_RXSR_RB2_Pos                 (9UL)                     /*!< RB2 (Bit 9)                                           */
#define CCAN_RXSR_RB2_Msk                 (0x200UL)                 /*!< RB2 (Bitfield-Mask: 0x01)                             */
#define CCAN_RXSR_DOS1_Pos                (16UL)                    /*!< DOS1 (Bit 16)                                         */
#define CCAN_RXSR_DOS1_Msk                (0x10000UL)               /*!< DOS1 (Bitfield-Mask: 0x01)                            */
#define CCAN_RXSR_DOS2_Pos                (17UL)                    /*!< DOS2 (Bit 17)                                         */
#define CCAN_RXSR_DOS2_Msk                (0x20000UL)               /*!< DOS2 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  MSR  ========================================================== */
#define CCAN_MSR_E1_Pos                   (0UL)                     /*!< E1 (Bit 0)                                            */
#define CCAN_MSR_E1_Msk                   (0x1UL)                   /*!< E1 (Bitfield-Mask: 0x01)                              */
#define CCAN_MSR_E2_Pos                   (1UL)                     /*!< E2 (Bit 1)                                            */
#define CCAN_MSR_E2_Msk                   (0x2UL)                   /*!< E2 (Bitfield-Mask: 0x01)                              */
#define CCAN_MSR_BS1_Pos                  (8UL)                     /*!< BS1 (Bit 8)                                           */
#define CCAN_MSR_BS1_Msk                  (0x100UL)                 /*!< BS1 (Bitfield-Mask: 0x01)                             */
#define CCAN_MSR_BS2_Pos                  (9UL)                     /*!< BS2 (Bit 9)                                           */
#define CCAN_MSR_BS2_Msk                  (0x200UL)                 /*!< BS2 (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                         LPC_CAN1                                          ================ */
/* =========================================================================================================================== */

