lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  MOD  ========================================================== */
#define CAN2_MOD_RM_Pos                   (0UL)                     /*!< RM (Bit 0)                                            */
#define CAN2_MOD_RM_Msk                   (0x1UL)                   /*!< RM (Bitfield-Mask: 0x01)                              */
#define CAN2_MOD_LOM_Pos                  (1UL)                     /*!< LOM (Bit 1)                                           */
#define CAN2_MOD_LOM_Msk                  (0x2UL)                   /*!< LOM (Bitfield-Mask: 0x01)                             */
#define CAN2_MOD_STM_Pos                  (2UL)                     /*!< STM (Bit 2)                                           */
#define CAN2_MOD_STM_Msk                  (0x4UL)                   /*!< STM (Bitfield-Mask: 0x01)                             */
#define CAN2_MOD_TPM_Pos                  (3UL)                     /*!< TPM (Bit 3)                                           */
#define CAN2_MOD_TPM_Msk                  (0x8UL)                   /*!< TPM (Bitfield-Mask: 0x01)                             */
#define CAN2_MOD_SM_Pos                   (4UL)                     /*!< SM (Bit 4)                                            */
#define CAN2_MOD_SM_Msk                   (0x10UL)                  /*!< SM (Bitfield-Mask: 0x01)                              */
#define CAN2_MOD_RPM_Pos                  (5UL)                     /*!< RPM (Bit 5)                                           */
#define CAN2_MOD_RPM_Msk                  (0x20UL)                  /*!< RPM (Bitfield-Mask: 0x01)                             */
#define CAN2_MOD_TM_Pos                   (7UL)                     /*!< TM (Bit 7)                                            */
#define CAN2_MOD_TM_Msk                   (0x80UL)                  /*!< TM (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CMR  ========================================================== */
#define CAN2_CMR_TR_Pos                   (0UL)                     /*!< TR (Bit 0)                                            */
#define CAN2_CMR_TR_Msk                   (0x1UL)                   /*!< TR (Bitfield-Mask: 0x01)                              */
#define CAN2_CMR_AT_Pos                   (1UL)                     /*!< AT (Bit 1)                                            */
#define CAN2_CMR_AT_Msk                   (0x2UL)                   /*!< AT (Bitfield-Mask: 0x01)                              */
#define CAN2_CMR_RRB_Pos                  (2UL)                     /*!< RRB (Bit 2)                                           */
#define CAN2_CMR_RRB_Msk                  (0x4UL)                   /*!< RRB (Bitfield-Mask: 0x01)                             */
#define CAN2_CMR_CDO_Pos                  (3UL)                     /*!< CDO (Bit 3)                                           */
#define CAN2_CMR_CDO_Msk                  (0x8UL)                   /*!< CDO (Bitfield-Mask: 0x01)                             */
#define CAN2_CMR_SRR_Pos                  (4UL)                     /*!< SRR (Bit 4)                                           */
#define CAN2_CMR_SRR_Msk                  (0x10UL)                  /*!< SRR (Bitfield-Mask: 0x01)                             */
#define CAN2_CMR_STB1_Pos                 (5UL)                     /*!< STB1 (Bit 5)                                          */
#define CAN2_CMR_STB1_Msk                 (0x20UL)                  /*!< STB1 (Bitfield-Mask: 0x01)                            */
#define CAN2_CMR_STB2_Pos                 (6UL)                     /*!< STB2 (Bit 6)                                          */
#define CAN2_CMR_STB2_Msk                 (0x40UL)                  /*!< STB2 (Bitfield-Mask: 0x01)                            */
#define CAN2_CMR_STB3_Pos                 (7UL)                     /*!< STB3 (Bit 7)                                          */
#define CAN2_CMR_STB3_Msk                 (0x80UL)                  /*!< STB3 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  GSR  ========================================================== */
#define CAN2_GSR_RBS_Pos                  (0UL)                     /*!< RBS (Bit 0)                                           */
#define CAN2_GSR_RBS_Msk                  (0x1UL)                   /*!< RBS (Bitfield-Mask: 0x01)                             */
#define CAN2_GSR_DOS_Pos                  (1UL)                     /*!< DOS (Bit 1)                                           */
#define CAN2_GSR_DOS_Msk                  (0x2UL)                   /*!< DOS (Bitfield-Mask: 0x01)                             */
#define CAN2_GSR_TBS_Pos                  (2UL)                     /*!< TBS (Bit 2)                                           */
#define CAN2_GSR_TBS_Msk                  (0x4UL)                   /*!< TBS (Bitfield-Mask: 0x01)                             */
#define CAN2_GSR_TCS_Pos                  (3UL)                     /*!< TCS (Bit 3)                                           */
#define CAN2_GSR_TCS_Msk                  (0x8UL)                   /*!< TCS (Bitfield-Mask: 0x01)                             */
#define CAN2_GSR_RS_Pos                   (4UL)                     /*!< RS (Bit 4)                                            */
#define CAN2_GSR_RS_Msk                   (0x10UL)                  /*!< RS (Bitfield-Mask: 0x01)                              */
#define CAN2_GSR_TS_Pos                   (5UL)                     /*!< TS (Bit 5)                                            */
#define CAN2_GSR_TS_Msk                   (0x20UL)                  /*!< TS (Bitfield-Mask: 0x01)                              */
#define CAN2_GSR_ES_Pos                   (6UL)                     /*!< ES (Bit 6)                                            */
#define CAN2_GSR_ES_Msk                   (0x40UL)                  /*!< ES (Bitfield-Mask: 0x01)                              */
#define CAN2_GSR_BS_Pos                   (7UL)                     /*!< BS (Bit 7)                                            */
#define CAN2_GSR_BS_Msk                   (0x80UL)                  /*!< BS (Bitfield-Mask: 0x01)                              */
#define CAN2_GSR_RXERR_Pos                (16UL)                    /*!< RXERR (Bit 16)                                        */
#define CAN2_GSR_RXERR_Msk                (0xff0000UL)              /*!< RXERR (Bitfield-Mask: 0xff)                           */
#define CAN2_GSR_TXERR_Pos                (24UL)                    /*!< TXERR (Bit 24)                                        */
#define CAN2_GSR_TXERR_Msk                (0xff000000UL)            /*!< TXERR (Bitfield-Mask: 0xff)                           */
/* ==========================================================  ICR  ========================================================== */
#define CAN2_ICR_RI_Pos                   (0UL)                     /*!< RI (Bit 0)                                            */
#define CAN2_ICR_RI_Msk                   (0x1UL)                   /*!< RI (Bitfield-Mask: 0x01)                              */
#define CAN2_ICR_TI1_Pos                  (1UL)                     /*!< TI1 (Bit 1)                                           */
#define CAN2_ICR_TI1_Msk                  (0x2UL)                   /*!< TI1 (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_EI_Pos                   (2UL)                     /*!< EI (Bit 2)                                            */
#define CAN2_ICR_EI_Msk                   (0x4UL)                   /*!< EI (Bitfield-Mask: 0x01)                              */
#define CAN2_ICR_DOI_Pos                  (3UL)                     /*!< DOI (Bit 3)                                           */
#define CAN2_ICR_DOI_Msk                  (0x8UL)                   /*!< DOI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_WUI_Pos                  (4UL)                     /*!< WUI (Bit 4)                                           */
#define CAN2_ICR_WUI_Msk                  (0x10UL)                  /*!< WUI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_EPI_Pos                  (5UL)                     /*!< EPI (Bit 5)                                           */
#define CAN2_ICR_EPI_Msk                  (0x20UL)                  /*!< EPI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_ALI_Pos                  (6UL)                     /*!< ALI (Bit 6)                                           */
#define CAN2_ICR_ALI_Msk                  (0x40UL)                  /*!< ALI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_BEI_Pos                  (7UL)                     /*!< BEI (Bit 7)                                           */
#define CAN2_ICR_BEI_Msk                  (0x80UL)                  /*!< BEI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_IDI_Pos                  (8UL)                     /*!< IDI (Bit 8)                                           */
#define CAN2_ICR_IDI_Msk                  (0x100UL)                 /*!< IDI (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_TI2_Pos                  (9UL)                     /*!< TI2 (Bit 9)                                           */
#define CAN2_ICR_TI2_Msk                  (0x200UL)                 /*!< TI2 (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_TI3_Pos                  (10UL)                    /*!< TI3 (Bit 10)                                          */
#define CAN2_ICR_TI3_Msk                  (0x400UL)                 /*!< TI3 (Bitfield-Mask: 0x01)                             */
#define CAN2_ICR_ERRBIT4_0_Pos            (16UL)                    /*!< ERRBIT4_0 (Bit 16)                                    */
#define CAN2_ICR_ERRBIT4_0_Msk            (0x1f0000UL)              /*!< ERRBIT4_0 (Bitfield-Mask: 0x1f)                       */
#define CAN2_ICR_ERRDIR_Pos               (21UL)                    /*!< ERRDIR (Bit 21)                                       */
#define CAN2_ICR_ERRDIR_Msk               (0x200000UL)              /*!< ERRDIR (Bitfield-Mask: 0x01)                          */
#define CAN2_ICR_ERRC1_0_Pos              (22UL)                    /*!< ERRC1_0 (Bit 22)                                      */
#define CAN2_ICR_ERRC1_0_Msk              (0xc00000UL)              /*!< ERRC1_0 (Bitfield-Mask: 0x03)                         */
#define CAN2_ICR_ALCBIT_Pos               (24UL)                    /*!< ALCBIT (Bit 24)                                       */
#define CAN2_ICR_ALCBIT_Msk               (0xff000000UL)            /*!< ALCBIT (Bitfield-Mask: 0xff)                          */
/* ==========================================================  IER  ========================================================== */
#define CAN2_IER_RIE_Pos                  (0UL)                     /*!< RIE (Bit 0)                                           */
#define CAN2_IER_RIE_Msk                  (0x1UL)                   /*!< RIE (Bitfield-Mask: 0x01)                             */
#define CAN2_IER_TIE1_Pos                 (1UL)                     /*!< TIE1 (Bit 1)                                          */
#define CAN2_IER_TIE1_Msk                 (0x2UL)                   /*!< TIE1 (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_EIE_Pos                  (2UL)                     /*!< EIE (Bit 2)                                           */
#define CAN2_IER_EIE_Msk                  (0x4UL)                   /*!< EIE (Bitfield-Mask: 0x01)                             */
#define CAN2_IER_DOIE_Pos                 (3UL)                     /*!< DOIE (Bit 3)                                          */
#define CAN2_IER_DOIE_Msk                 (0x8UL)                   /*!< DOIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_WUIE_Pos                 (4UL)                     /*!< WUIE (Bit 4)                                          */
#define CAN2_IER_WUIE_Msk                 (0x10UL)                  /*!< WUIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_EPIE_Pos                 (5UL)                     /*!< EPIE (Bit 5)                                          */
#define CAN2_IER_EPIE_Msk                 (0x20UL)                  /*!< EPIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_ALIE_Pos                 (6UL)                     /*!< ALIE (Bit 6)                                          */
#define CAN2_IER_ALIE_Msk                 (0x40UL)                  /*!< ALIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_BEIE_Pos                 (7UL)                     /*!< BEIE (Bit 7)                                          */
#define CAN2_IER_BEIE_Msk                 (0x80UL)                  /*!< BEIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_IDIE_Pos                 (8UL)                     /*!< IDIE (Bit 8)                                          */
#define CAN2_IER_IDIE_Msk                 (0x100UL)                 /*!< IDIE (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_TIE2_Pos                 (9UL)                     /*!< TIE2 (Bit 9)                                          */
#define CAN2_IER_TIE2_Msk                 (0x200UL)                 /*!< TIE2 (Bitfield-Mask: 0x01)                            */
#define CAN2_IER_TIE3_Pos                 (10UL)                    /*!< TIE3 (Bit 10)                                         */
#define CAN2_IER_TIE3_Msk                 (0x400UL)                 /*!< TIE3 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  BTR  ========================================================== */
#define CAN2_BTR_BRP_Pos                  (0UL)                     /*!< BRP (Bit 0)                                           */
#define CAN2_BTR_BRP_Msk                  (0x3ffUL)                 /*!< BRP (Bitfield-Mask: 0x3ff)                            */
#define CAN2_BTR_SJW_Pos                  (14UL)                    /*!< SJW (Bit 14)                                          */
#define CAN2_BTR_SJW_Msk                  (0xc000UL)                /*!< SJW (Bitfield-Mask: 0x03)                             */
#define CAN2_BTR_TESG1_Pos                (16UL)                    /*!< TESG1 (Bit 16)                                        */
#define CAN2_BTR_TESG1_Msk                (0xf0000UL)               /*!< TESG1 (Bitfield-Mask: 0x0f)                           */
#define CAN2_BTR_TESG2_Pos                (20UL)                    /*!< TESG2 (Bit 20)                                        */
#define CAN2_BTR_TESG2_Msk                (0x700000UL)              /*!< TESG2 (Bitfield-Mask: 0x07)                           */
#define CAN2_BTR_SAM_Pos                  (23UL)                    /*!< SAM (Bit 23)                                          */
#define CAN2_BTR_SAM_Msk                  (0x800000UL)              /*!< SAM (Bitfield-Mask: 0x01)                             */
/* ==========================================================  EWL  ========================================================== */
#define CAN2_EWL_EWL_Pos                  (0UL)                     /*!< EWL (Bit 0)                                           */
#define CAN2_EWL_EWL_Msk                  (0xffUL)                  /*!< EWL (Bitfield-Mask: 0xff)                             */
/* ==========================================================  SR  =========================================================== */
#define CAN2_SR_RBS_1_Pos                 (0UL)                     /*!< RBS_1 (Bit 0)                                         */
#define CAN2_SR_RBS_1_Msk                 (0x1UL)                   /*!< RBS_1 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_DOS_1_Pos                 (1UL)                     /*!< DOS_1 (Bit 1)                                         */
#define CAN2_SR_DOS_1_Msk                 (0x2UL)                   /*!< DOS_1 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_TBS1_1_Pos                (2UL)                     /*!< TBS1_1 (Bit 2)                                        */
#define CAN2_SR_TBS1_1_Msk                (0x4UL)                   /*!< TBS1_1 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_TCS1_1_Pos                (3UL)                     /*!< TCS1_1 (Bit 3)                                        */
#define CAN2_SR_TCS1_1_Msk                (0x8UL)                   /*!< TCS1_1 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_RS_1_Pos                  (4UL)                     /*!< RS_1 (Bit 4)                                          */
#define CAN2_SR_RS_1_Msk                  (0x10UL)                  /*!< RS_1 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_TS1_1_Pos                 (5UL)                     /*!< TS1_1 (Bit 5)                                         */
#define CAN2_SR_TS1_1_Msk                 (0x20UL)                  /*!< TS1_1 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_ES_1_Pos                  (6UL)                     /*!< ES_1 (Bit 6)                                          */
#define CAN2_SR_ES_1_Msk                  (0x40UL)                  /*!< ES_1 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_BS_1_Pos                  (7UL)                     /*!< BS_1 (Bit 7)                                          */
#define CAN2_SR_BS_1_Msk                  (0x80UL)                  /*!< BS_1 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_RBS_2_Pos                 (8UL)                     /*!< RBS_2 (Bit 8)                                         */
#define CAN2_SR_RBS_2_Msk                 (0x100UL)                 /*!< RBS_2 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_DOS_2_Pos                 (9UL)                     /*!< DOS_2 (Bit 9)                                         */
#define CAN2_SR_DOS_2_Msk                 (0x200UL)                 /*!< DOS_2 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_TBS2_2_Pos                (10UL)                    /*!< TBS2_2 (Bit 10)                                       */
#define CAN2_SR_TBS2_2_Msk                (0x400UL)                 /*!< TBS2_2 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_TCS2_2_Pos                (11UL)                    /*!< TCS2_2 (Bit 11)                                       */
#define CAN2_SR_TCS2_2_Msk                (0x800UL)                 /*!< TCS2_2 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_RS_2_Pos                  (12UL)                    /*!< RS_2 (Bit 12)                                         */
#define CAN2_SR_RS_2_Msk                  (0x1000UL)                /*!< RS_2 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_TS2_2_Pos                 (13UL)                    /*!< TS2_2 (Bit 13)                                        */
#define CAN2_SR_TS2_2_Msk                 (0x2000UL)                /*!< TS2_2 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_ES_2_Pos                  (14UL)                    /*!< ES_2 (Bit 14)                                         */
#define CAN2_SR_ES_2_Msk                  (0x4000UL)                /*!< ES_2 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_BS_2_Pos                  (15UL)                    /*!< BS_2 (Bit 15)                                         */
#define CAN2_SR_BS_2_Msk                  (0x8000UL)                /*!< BS_2 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_RBS_3_Pos                 (16UL)                    /*!< RBS_3 (Bit 16)                                        */
#define CAN2_SR_RBS_3_Msk                 (0x10000UL)               /*!< RBS_3 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_DOS_3_Pos                 (17UL)                    /*!< DOS_3 (Bit 17)                                        */
#define CAN2_SR_DOS_3_Msk                 (0x20000UL)               /*!< DOS_3 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_TBS3_3_Pos                (18UL)                    /*!< TBS3_3 (Bit 18)                                       */
#define CAN2_SR_TBS3_3_Msk                (0x40000UL)               /*!< TBS3_3 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_TCS3_3_Pos                (19UL)                    /*!< TCS3_3 (Bit 19)                                       */
#define CAN2_SR_TCS3_3_Msk                (0x80000UL)               /*!< TCS3_3 (Bitfield-Mask: 0x01)                          */
#define CAN2_SR_RS_3_Pos                  (20UL)                    /*!< RS_3 (Bit 20)                                         */
#define CAN2_SR_RS_3_Msk                  (0x100000UL)              /*!< RS_3 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_TS3_3_Pos                 (21UL)                    /*!< TS3_3 (Bit 21)                                        */
#define CAN2_SR_TS3_3_Msk                 (0x200000UL)              /*!< TS3_3 (Bitfield-Mask: 0x01)                           */
#define CAN2_SR_ES_3_Pos                  (22UL)                    /*!< ES_3 (Bit 22)                                         */
#define CAN2_SR_ES_3_Msk                  (0x400000UL)              /*!< ES_3 (Bitfield-Mask: 0x01)                            */
#define CAN2_SR_BS_3_Pos                  (23UL)                    /*!< BS_3 (Bit 23)                                         */
#define CAN2_SR_BS_3_Msk                  (0x800000UL)              /*!< BS_3 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  RFS  ========================================================== */
#define CAN2_RFS_IDINDEX_Pos              (0UL)                     /*!< IDINDEX (Bit 0)                                       */
#define CAN2_RFS_IDINDEX_Msk              (0x3ffUL)                 /*!< IDINDEX (Bitfield-Mask: 0x3ff)                        */
#define CAN2_RFS_BP_Pos                   (10UL)                    /*!< BP (Bit 10)                                           */
#define CAN2_RFS_BP_Msk                   (0x400UL)                 /*!< BP (Bitfield-Mask: 0x01)                              */
#define CAN2_RFS_DLC_Pos                  (16UL)                    /*!< DLC (Bit 16)                                          */
#define CAN2_RFS_DLC_Msk                  (0xf0000UL)               /*!< DLC (Bitfield-Mask: 0x0f)                             */
#define CAN2_RFS_RTR_Pos                  (30UL)                    /*!< RTR (Bit 30)                                          */
#define CAN2_RFS_RTR_Msk                  (0x40000000UL)            /*!< RTR (Bitfield-Mask: 0x01)                             */
#define CAN2_RFS_FF_Pos                   (31UL)                    /*!< FF (Bit 31)                                           */
#define CAN2_RFS_FF_Msk                   (0x80000000UL)            /*!< FF (Bitfield-Mask: 0x01)                              */
/* ==========================================================  RID  ========================================================== */
#define CAN2_RID_ID_Pos                   (0UL)                     /*!< ID (Bit 0)                                            */
#define CAN2_RID_ID_Msk                   (0x7ffUL)                 /*!< ID (Bitfield-Mask: 0x7ff)                             */
