lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  RDA  ========================================================== */
#define CAN2_RDA_DATA1_Pos                (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define CAN2_RDA_DATA1_Msk                (0xffUL)                  /*!< DATA1 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDA_DATA2_Pos                (8UL)                     /*!< DATA2 (Bit 8)                                         */
#define CAN2_RDA_DATA2_Msk                (0xff00UL)                /*!< DATA2 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDA_DATA3_Pos                (16UL)                    /*!< DATA3 (Bit 16)                                        */
#define CAN2_RDA_DATA3_Msk                (0xff0000UL)              /*!< DATA3 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDA_DATA4_Pos                (24UL)                    /*!< DATA4 (Bit 24)                                        */
#define CAN2_RDA_DATA4_Msk                (0xff000000UL)            /*!< DATA4 (Bitfield-Mask: 0xff)                           */
/* ==========================================================  RDB  ========================================================== */
#define CAN2_RDB_DATA5_Pos                (0UL)                     /*!< DATA5 (Bit 0)                                         */
#define CAN2_RDB_DATA5_Msk                (0xffUL)                  /*!< DATA5 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDB_DATA6_Pos                (8UL)                     /*!< DATA6 (Bit 8)                                         */
#define CAN2_RDB_DATA6_Msk                (0xff00UL)                /*!< DATA6 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDB_DATA7_Pos                (16UL)                    /*!< DATA7 (Bit 16)                                        */
#define CAN2_RDB_DATA7_Msk                (0xff0000UL)              /*!< DATA7 (Bitfield-Mask: 0xff)                           */
#define CAN2_RDB_DATA8_Pos                (24UL)                    /*!< DATA8 (Bit 24)                                        */
#define CAN2_RDB_DATA8_Msk                (0xff000000UL)            /*!< DATA8 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TFI1  ========================================================== */
#define CAN2_TFI1_PRIO_Pos                (0UL)                     /*!< PRIO (Bit 0)                                          */
#define CAN2_TFI1_PRIO_Msk                (0xffUL)                  /*!< PRIO (Bitfield-Mask: 0xff)                            */
#define CAN2_TFI1_DLC_Pos                 (16UL)                    /*!< DLC (Bit 16)                                          */
#define CAN2_TFI1_DLC_Msk                 (0xf0000UL)               /*!< DLC (Bitfield-Mask: 0x0f)                             */
#define CAN2_TFI1_RTR_Pos                 (30UL)                    /*!< RTR (Bit 30)                                          */
#define CAN2_TFI1_RTR_Msk                 (0x40000000UL)            /*!< RTR (Bitfield-Mask: 0x01)                             */
#define CAN2_TFI1_FF_Pos                  (31UL)                    /*!< FF (Bit 31)                                           */
#define CAN2_TFI1_FF_Msk                  (0x80000000UL)            /*!< FF (Bitfield-Mask: 0x01)                              */
/* =========================================================  TFI2  ========================================================== */
#define CAN2_TFI2_PRIO_Pos                (0UL)                     /*!< PRIO (Bit 0)                                          */
#define CAN2_TFI2_PRIO_Msk                (0xffUL)                  /*!< PRIO (Bitfield-Mask: 0xff)                            */
#define CAN2_TFI2_DLC_Pos                 (16UL)                    /*!< DLC (Bit 16)                                          */
#define CAN2_TFI2_DLC_Msk                 (0xf0000UL)               /*!< DLC (Bitfield-Mask: 0x0f)                             */
#define CAN2_TFI2_RTR_Pos                 (30UL)                    /*!< RTR (Bit 30)                                          */
#define CAN2_TFI2_RTR_Msk                 (0x40000000UL)            /*!< RTR (Bitfield-Mask: 0x01)                             */
#define CAN2_TFI2_FF_Pos                  (31UL)                    /*!< FF (Bit 31)                                           */
#define CAN2_TFI2_FF_Msk                  (0x80000000UL)            /*!< FF (Bitfield-Mask: 0x01)                              */
/* =========================================================  TFI3  ========================================================== */
#define CAN2_TFI3_PRIO_Pos                (0UL)                     /*!< PRIO (Bit 0)                                          */
#define CAN2_TFI3_PRIO_Msk                (0xffUL)                  /*!< PRIO (Bitfield-Mask: 0xff)                            */
#define CAN2_TFI3_DLC_Pos                 (16UL)                    /*!< DLC (Bit 16)                                          */
#define CAN2_TFI3_DLC_Msk                 (0xf0000UL)               /*!< DLC (Bitfield-Mask: 0x0f)                             */
#define CAN2_TFI3_RTR_Pos                 (30UL)                    /*!< RTR (Bit 30)                                          */
#define CAN2_TFI3_RTR_Msk                 (0x40000000UL)            /*!< RTR (Bitfield-Mask: 0x01)                             */
#define CAN2_TFI3_FF_Pos                  (31UL)                    /*!< FF (Bit 31)                                           */
#define CAN2_TFI3_FF_Msk                  (0x80000000UL)            /*!< FF (Bitfield-Mask: 0x01)                              */
/* =========================================================  TID1  ========================================================== */
#define CAN2_TID1_ID_Pos                  (0UL)                     /*!< ID (Bit 0)                                            */
#define CAN2_TID1_ID_Msk                  (0x7ffUL)                 /*!< ID (Bitfield-Mask: 0x7ff)                             */
/* =========================================================  TID2  ========================================================== */
#define CAN2_TID2_ID_Pos                  (0UL)                     /*!< ID (Bit 0)                                            */
#define CAN2_TID2_ID_Msk                  (0x7ffUL)                 /*!< ID (Bitfield-Mask: 0x7ff)                             */
/* =========================================================  TID3  ========================================================== */
#define CAN2_TID3_ID_Pos                  (0UL)                     /*!< ID (Bit 0)                                            */
#define CAN2_TID3_ID_Msk                  (0x7ffUL)                 /*!< ID (Bitfield-Mask: 0x7ff)                             */
/* =========================================================  TDA1  ========================================================== */
#define CAN2_TDA1_DATA1_Pos               (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define CAN2_TDA1_DATA1_Msk               (0xffUL)                  /*!< DATA1 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA1_DATA2_Pos               (8UL)                     /*!< DATA2 (Bit 8)                                         */
#define CAN2_TDA1_DATA2_Msk               (0xff00UL)                /*!< DATA2 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA1_DATA3_Pos               (16UL)                    /*!< DATA3 (Bit 16)                                        */
#define CAN2_TDA1_DATA3_Msk               (0xff0000UL)              /*!< DATA3 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA1_DATA4_Pos               (24UL)                    /*!< DATA4 (Bit 24)                                        */
#define CAN2_TDA1_DATA4_Msk               (0xff000000UL)            /*!< DATA4 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TDA2  ========================================================== */
#define CAN2_TDA2_DATA1_Pos               (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define CAN2_TDA2_DATA1_Msk               (0xffUL)                  /*!< DATA1 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA2_DATA2_Pos               (8UL)                     /*!< DATA2 (Bit 8)                                         */
#define CAN2_TDA2_DATA2_Msk               (0xff00UL)                /*!< DATA2 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA2_DATA3_Pos               (16UL)                    /*!< DATA3 (Bit 16)                                        */
#define CAN2_TDA2_DATA3_Msk               (0xff0000UL)              /*!< DATA3 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA2_DATA4_Pos               (24UL)                    /*!< DATA4 (Bit 24)                                        */
#define CAN2_TDA2_DATA4_Msk               (0xff000000UL)            /*!< DATA4 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TDA3  ========================================================== */
#define CAN2_TDA3_DATA1_Pos               (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define CAN2_TDA3_DATA1_Msk               (0xffUL)                  /*!< DATA1 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA3_DATA2_Pos               (8UL)                     /*!< DATA2 (Bit 8)                                         */
#define CAN2_TDA3_DATA2_Msk               (0xff00UL)                /*!< DATA2 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA3_DATA3_Pos               (16UL)                    /*!< DATA3 (Bit 16)                                        */
#define CAN2_TDA3_DATA3_Msk               (0xff0000UL)              /*!< DATA3 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDA3_DATA4_Pos               (24UL)                    /*!< DATA4 (Bit 24)                                        */
#define CAN2_TDA3_DATA4_Msk               (0xff000000UL)            /*!< DATA4 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TDB1  ========================================================== */
#define CAN2_TDB1_DATA5_Pos               (0UL)                     /*!< DATA5 (Bit 0)                                         */
#define CAN2_TDB1_DATA5_Msk               (0xffUL)                  /*!< DATA5 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB1_DATA6_Pos               (8UL)                     /*!< DATA6 (Bit 8)                                         */
#define CAN2_TDB1_DATA6_Msk               (0xff00UL)                /*!< DATA6 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB1_DATA7_Pos               (16UL)                    /*!< DATA7 (Bit 16)                                        */
#define CAN2_TDB1_DATA7_Msk               (0xff0000UL)              /*!< DATA7 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB1_DATA8_Pos               (24UL)                    /*!< DATA8 (Bit 24)                                        */
#define CAN2_TDB1_DATA8_Msk               (0xff000000UL)            /*!< DATA8 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TDB2  ========================================================== */
#define CAN2_TDB2_DATA5_Pos               (0UL)                     /*!< DATA5 (Bit 0)                                         */
#define CAN2_TDB2_DATA5_Msk               (0xffUL)                  /*!< DATA5 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB2_DATA6_Pos               (8UL)                     /*!< DATA6 (Bit 8)                                         */
#define CAN2_TDB2_DATA6_Msk               (0xff00UL)                /*!< DATA6 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB2_DATA7_Pos               (16UL)                    /*!< DATA7 (Bit 16)                                        */
#define CAN2_TDB2_DATA7_Msk               (0xff0000UL)              /*!< DATA7 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB2_DATA8_Pos               (24UL)                    /*!< DATA8 (Bit 24)                                        */
#define CAN2_TDB2_DATA8_Msk               (0xff000000UL)            /*!< DATA8 (Bitfield-Mask: 0xff)                           */
/* =========================================================  TDB3  ========================================================== */
#define CAN2_TDB3_DATA5_Pos               (0UL)                     /*!< DATA5 (Bit 0)                                         */
#define CAN2_TDB3_DATA5_Msk               (0xffUL)                  /*!< DATA5 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB3_DATA6_Pos               (8UL)                     /*!< DATA6 (Bit 8)                                         */
#define CAN2_TDB3_DATA6_Msk               (0xff00UL)                /*!< DATA6 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB3_DATA7_Pos               (16UL)                    /*!< DATA7 (Bit 16)                                        */
#define CAN2_TDB3_DATA7_Msk               (0xff0000UL)              /*!< DATA7 (Bitfield-Mask: 0xff)                           */
#define CAN2_TDB3_DATA8_Pos               (24UL)                    /*!< DATA8 (Bit 24)                                        */
#define CAN2_TDB3_DATA8_Msk               (0xff000000UL)            /*!< DATA8 (Bitfield-Mask: 0xff)                           */


/* =========================================================================================================================== */
/* ================                                         LPC_SSP0                                          ================ */
/* =========================================================================================================================== */

