lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  CR0  ========================================================== */
#define SSP0_CR0_DSS_Pos                  (0UL)                     /*!< DSS (Bit 0)                                           */
#define SSP0_CR0_DSS_Msk                  (0xfUL)                   /*!< DSS (Bitfield-Mask: 0x0f)                             */
#define SSP0_CR0_FRF_Pos                  (4UL)                     /*!< FRF (Bit 4)                                           */
#define SSP0_CR0_FRF_Msk                  (0x30UL)                  /*!< FRF (Bitfield-Mask: 0x03)                             */
#define SSP0_CR0_CPOL_Pos                 (6UL)                     /*!< CPOL (Bit 6)                                          */
#define SSP0_CR0_CPOL_Msk                 (0x40UL)                  /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SSP0_CR0_CPHA_Pos                 (7UL)                     /*!< CPHA (Bit 7)                                          */
#define SSP0_CR0_CPHA_Msk                 (0x80UL)                  /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define SSP0_CR0_SCR_Pos                  (8UL)                     /*!< SCR (Bit 8)                                           */
#define SSP0_CR0_SCR_Msk                  (0xff00UL)                /*!< SCR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR1  ========================================================== */
#define SSP0_CR1_LBM_Pos                  (0UL)                     /*!< LBM (Bit 0)                                           */
#define SSP0_CR1_LBM_Msk                  (0x1UL)                   /*!< LBM (Bitfield-Mask: 0x01)                             */
#define SSP0_CR1_SSE_Pos                  (1UL)                     /*!< SSE (Bit 1)                                           */
#define SSP0_CR1_SSE_Msk                  (0x2UL)                   /*!< SSE (Bitfield-Mask: 0x01)                             */
#define SSP0_CR1_MS_Pos                   (2UL)                     /*!< MS (Bit 2)                                            */
#define SSP0_CR1_MS_Msk                   (0x4UL)                   /*!< MS (Bitfield-Mask: 0x01)                              */
#define SSP0_CR1_SOD_Pos                  (3UL)                     /*!< SOD (Bit 3)                                           */
#define SSP0_CR1_SOD_Msk                  (0x8UL)                   /*!< SOD (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define SSP0_DR_DATA_Pos                  (0UL)                     /*!< DATA (Bit 0)                                          */
#define SSP0_DR_DATA_Msk                  (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  SR  =========================================================== */
#define SSP0_SR_TFE_Pos                   (0UL)                     /*!< TFE (Bit 0)                                           */
#define SSP0_SR_TFE_Msk                   (0x1UL)                   /*!< TFE (Bitfield-Mask: 0x01)                             */
#define SSP0_SR_TNF_Pos                   (1UL)                     /*!< TNF (Bit 1)                                           */
#define SSP0_SR_TNF_Msk                   (0x2UL)                   /*!< TNF (Bitfield-Mask: 0x01)                             */
#define SSP0_SR_RNE_Pos                   (2UL)                     /*!< RNE (Bit 2)                                           */
#define SSP0_SR_RNE_Msk                   (0x4UL)                   /*!< RNE (Bitfield-Mask: 0x01)                             */
#define SSP0_SR_RFF_Pos                   (3UL)                     /*!< RFF (Bit 3)                                           */
#define SSP0_SR_RFF_Msk                   (0x8UL)                   /*!< RFF (Bitfield-Mask: 0x01)                             */
#define SSP0_SR_BSY_Pos                   (4UL)                     /*!< BSY (Bit 4)                                           */
#define SSP0_SR_BSY_Msk                   (0x10UL)                  /*!< BSY (Bitfield-Mask: 0x01)                             */
/* =========================================================  CPSR  ========================================================== */
#define SSP0_CPSR_CPSDVSR_Pos             (0UL)                     /*!< CPSDVSR (Bit 0)                                       */
#define SSP0_CPSR_CPSDVSR_Msk             (0xffUL)                  /*!< CPSDVSR (Bitfield-Mask: 0xff)                         */
/* =========================================================  IMSC  ========================================================== */
#define SSP0_IMSC_RORIM_Pos               (0UL)                     /*!< RORIM (Bit 0)                                         */
#define SSP0_IMSC_RORIM_Msk               (0x1UL)                   /*!< RORIM (Bitfield-Mask: 0x01)                           */
#define SSP0_IMSC_RTIM_Pos                (1UL)                     /*!< RTIM (Bit 1)                                          */
#define SSP0_IMSC_RTIM_Msk                (0x2UL)                   /*!< RTIM (Bitfield-Mask: 0x01)                            */
#define SSP0_IMSC_RXIM_Pos                (2UL)                     /*!< RXIM (Bit 2)                                          */
#define SSP0_IMSC_RXIM_Msk                (0x4UL)                   /*!< RXIM (Bitfield-Mask: 0x01)                            */
#define SSP0_IMSC_TXIM_Pos                (3UL)                     /*!< TXIM (Bit 3)                                          */
#define SSP0_IMSC_TXIM_Msk                (0x8UL)                   /*!< TXIM (Bitfield-Mask: 0x01)                            */
/* ==========================================================  RIS  ========================================================== */
#define SSP0_RIS_RORRIS_Pos               (0UL)                     /*!< RORRIS (Bit 0)                                        */
#define SSP0_RIS_RORRIS_Msk               (0x1UL)                   /*!< RORRIS (Bitfield-Mask: 0x01)                          */
#define SSP0_RIS_RTRIS_Pos                (1UL)                     /*!< RTRIS (Bit 1)                                         */
#define SSP0_RIS_RTRIS_Msk                (0x2UL)                   /*!< RTRIS (Bitfield-Mask: 0x01)                           */
#define SSP0_RIS_RXRIS_Pos                (2UL)                     /*!< RXRIS (Bit 2)                                         */
#define SSP0_RIS_RXRIS_Msk                (0x4UL)                   /*!< RXRIS (Bitfield-Mask: 0x01)                           */
#define SSP0_RIS_TXRIS_Pos                (3UL)                     /*!< TXRIS (Bit 3)                                         */
#define SSP0_RIS_TXRIS_Msk                (0x8UL)                   /*!< TXRIS (Bitfield-Mask: 0x01)                           */
/* ==========================================================  MIS  ========================================================== */
#define SSP0_MIS_RORMIS_Pos               (0UL)                     /*!< RORMIS (Bit 0)                                        */
#define SSP0_MIS_RORMIS_Msk               (0x1UL)                   /*!< RORMIS (Bitfield-Mask: 0x01)                          */
#define SSP0_MIS_RTMIS_Pos                (1UL)                     /*!< RTMIS (Bit 1)                                         */
#define SSP0_MIS_RTMIS_Msk                (0x2UL)                   /*!< RTMIS (Bitfield-Mask: 0x01)                           */
#define SSP0_MIS_RXMIS_Pos                (2UL)                     /*!< RXMIS (Bit 2)                                         */
#define SSP0_MIS_RXMIS_Msk                (0x4UL)                   /*!< RXMIS (Bitfield-Mask: 0x01)                           */
#define SSP0_MIS_TXMIS_Pos                (3UL)                     /*!< TXMIS (Bit 3)                                         */
#define SSP0_MIS_TXMIS_Msk                (0x8UL)                   /*!< TXMIS (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ICR  ========================================================== */
#define SSP0_ICR_RORIC_Pos                (0UL)                     /*!< RORIC (Bit 0)                                         */
#define SSP0_ICR_RORIC_Msk                (0x1UL)                   /*!< RORIC (Bitfield-Mask: 0x01)                           */
#define SSP0_ICR_RTIC_Pos                 (1UL)                     /*!< RTIC (Bit 1)                                          */
#define SSP0_ICR_RTIC_Msk                 (0x2UL)                   /*!< RTIC (Bitfield-Mask: 0x01)                            */
/* =========================================================  DMACR  ========================================================= */
#define SSP0_DMACR_RXDMAE_Pos             (0UL)                     /*!< RXDMAE (Bit 0)                                        */
#define SSP0_DMACR_RXDMAE_Msk             (0x1UL)                   /*!< RXDMAE (Bitfield-Mask: 0x01)                          */
#define SSP0_DMACR_TXDMAE_Pos             (1UL)                     /*!< TXDMAE (Bit 1)                                        */
#define SSP0_DMACR_TXDMAE_Msk             (0x2UL)                   /*!< TXDMAE (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          LPC_DAC                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define DAC_CR_VALUE_Pos                  (6UL)                     /*!< VALUE (Bit 6)                                         */
#define DAC_CR_VALUE_Msk                  (0xffc0UL)                /*!< VALUE (Bitfield-Mask: 0x3ff)                          */
#define DAC_CR_BIAS_Pos                   (16UL)                    /*!< BIAS (Bit 16)                                         */
#define DAC_CR_BIAS_Msk                   (0x10000UL)               /*!< BIAS (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTRL  ========================================================== */
#define DAC_CTRL_INT_DMA_REQ_Pos          (0UL)                     /*!< INT_DMA_REQ (Bit 0)                                   */
#define DAC_CTRL_INT_DMA_REQ_Msk          (0x1UL)                   /*!< INT_DMA_REQ (Bitfield-Mask: 0x01)                     */
#define DAC_CTRL_DBLBUF_ENA_Pos           (1UL)                     /*!< DBLBUF_ENA (Bit 1)                                    */
#define DAC_CTRL_DBLBUF_ENA_Msk           (0x2UL)                   /*!< DBLBUF_ENA (Bitfield-Mask: 0x01)                      */
#define DAC_CTRL_CNT_ENA_Pos              (2UL)                     /*!< CNT_ENA (Bit 2)                                       */
#define DAC_CTRL_CNT_ENA_Msk              (0x4UL)                   /*!< CNT_ENA (Bitfield-Mask: 0x01)                         */
#define DAC_CTRL_DMA_ENA_Pos              (3UL)                     /*!< DMA_ENA (Bit 3)                                       */
#define DAC_CTRL_DMA_ENA_Msk              (0x8UL)                   /*!< DMA_ENA (Bitfield-Mask: 0x01)                         */
/* ========================================================  CNTVAL  ========================================================= */
#define DAC_CNTVAL_VALUE_Pos              (0UL)                     /*!< VALUE (Bit 0)                                         */
#define DAC_CNTVAL_VALUE_Msk              (0xffffUL)                /*!< VALUE (Bitfield-Mask: 0xffff)                         */


/* =========================================================================================================================== */
/* ================                                        LPC_TIMER2                                         ================ */
/* =========================================================================================================================== */

