lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  DAO  ========================================================== */
#define I2S_DAO_WORDWIDTH_Pos             (0UL)                     /*!< WORDWIDTH (Bit 0)                                     */
#define I2S_DAO_WORDWIDTH_Msk             (0x3UL)                   /*!< WORDWIDTH (Bitfield-Mask: 0x03)                       */
#define I2S_DAO_MONO_Pos                  (2UL)                     /*!< MONO (Bit 2)                                          */
#define I2S_DAO_MONO_Msk                  (0x4UL)                   /*!< MONO (Bitfield-Mask: 0x01)                            */
#define I2S_DAO_STOP_Pos                  (3UL)                     /*!< STOP (Bit 3)                                          */
#define I2S_DAO_STOP_Msk                  (0x8UL)                   /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2S_DAO_RESET_Pos                 (4UL)                     /*!< RESET (Bit 4)                                         */
#define I2S_DAO_RESET_Msk                 (0x10UL)                  /*!< RESET (Bitfield-Mask: 0x01)                           */
#define I2S_DAO_WS_SEL_Pos                (5UL)                     /*!< WS_SEL (Bit 5)                                        */
#define I2S_DAO_WS_SEL_Msk                (0x20UL)                  /*!< WS_SEL (Bitfield-Mask: 0x01)                          */
#define I2S_DAO_WS_HALFPERIOD_Pos         (6UL)                     /*!< WS_HALFPERIOD (Bit 6)                                 */
#define I2S_DAO_WS_HALFPERIOD_Msk         (0x7fc0UL)                /*!< WS_HALFPERIOD (Bitfield-Mask: 0x1ff)                  */
#define I2S_DAO_MUTE_Pos                  (15UL)                    /*!< MUTE (Bit 15)                                         */
#define I2S_DAO_MUTE_Msk                  (0x8000UL)                /*!< MUTE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  DAI  ========================================================== */
#define I2S_DAI_WORDWIDTH_Pos             (0UL)                     /*!< WORDWIDTH (Bit 0)                                     */
#define I2S_DAI_WORDWIDTH_Msk             (0x3UL)                   /*!< WORDWIDTH (Bitfield-Mask: 0x03)                       */
#define I2S_DAI_MONO_Pos                  (2UL)                     /*!< MONO (Bit 2)                                          */
#define I2S_DAI_MONO_Msk                  (0x4UL)                   /*!< MONO (Bitfield-Mask: 0x01)                            */
#define I2S_DAI_STOP_Pos                  (3UL)                     /*!< STOP (Bit 3)                                          */
#define I2S_DAI_STOP_Msk                  (0x8UL)                   /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2S_DAI_RESET_Pos                 (4UL)                     /*!< RESET (Bit 4)                                         */
#define I2S_DAI_RESET_Msk                 (0x10UL)                  /*!< RESET (Bitfield-Mask: 0x01)                           */
#define I2S_DAI_WS_SEL_Pos                (5UL)                     /*!< WS_SEL (Bit 5)                                        */
#define I2S_DAI_WS_SEL_Msk                (0x20UL)                  /*!< WS_SEL (Bitfield-Mask: 0x01)                          */
#define I2S_DAI_WS_HALFPERIOD_Pos         (6UL)                     /*!< WS_HALFPERIOD (Bit 6)                                 */
#define I2S_DAI_WS_HALFPERIOD_Msk         (0x7fc0UL)                /*!< WS_HALFPERIOD (Bitfield-Mask: 0x1ff)                  */
/* ========================================================  TXFIFO  ========================================================= */
#define I2S_TXFIFO_I2STXFIFO_Pos          (0UL)                     /*!< I2STXFIFO (Bit 0)                                     */
#define I2S_TXFIFO_I2STXFIFO_Msk          (0xffffffffUL)            /*!< I2STXFIFO (Bitfield-Mask: 0xffffffff)                 */
/* ========================================================  RXFIFO  ========================================================= */
#define I2S_RXFIFO_I2SRXFIFO_Pos          (0UL)                     /*!< I2SRXFIFO (Bit 0)                                     */
#define I2S_RXFIFO_I2SRXFIFO_Msk          (0xffffffffUL)            /*!< I2SRXFIFO (Bitfield-Mask: 0xffffffff)                 */
/* =========================================================  STATE  ========================================================= */
#define I2S_STATE_IRQ_Pos                 (0UL)                     /*!< IRQ (Bit 0)                                           */
#define I2S_STATE_IRQ_Msk                 (0x1UL)                   /*!< IRQ (Bitfield-Mask: 0x01)                             */
#define I2S_STATE_DMAREQ1_Pos             (1UL)                     /*!< DMAREQ1 (Bit 1)                                       */
#define I2S_STATE_DMAREQ1_Msk             (0x2UL)                   /*!< DMAREQ1 (Bitfield-Mask: 0x01)                         */
#define I2S_STATE_DMAREQ2_Pos             (2UL)                     /*!< DMAREQ2 (Bit 2)                                       */
#define I2S_STATE_DMAREQ2_Msk             (0x4UL)                   /*!< DMAREQ2 (Bitfield-Mask: 0x01)                         */
#define I2S_STATE_RX_LEVEL_Pos            (8UL)                     /*!< RX_LEVEL (Bit 8)                                      */
#define I2S_STATE_RX_LEVEL_Msk            (0xf00UL)                 /*!< RX_LEVEL (Bitfield-Mask: 0x0f)                        */
#define I2S_STATE_TX_LEVEL_Pos            (16UL)                    /*!< TX_LEVEL (Bit 16)                                     */
#define I2S_STATE_TX_LEVEL_Msk            (0xf0000UL)               /*!< TX_LEVEL (Bitfield-Mask: 0x0f)                        */
/* =========================================================  DMA1  ========================================================== */
#define I2S_DMA1_RX_DMA1_ENABLE_Pos       (0UL)                     /*!< RX_DMA1_ENABLE (Bit 0)                                */
#define I2S_DMA1_RX_DMA1_ENABLE_Msk       (0x1UL)                   /*!< RX_DMA1_ENABLE (Bitfield-Mask: 0x01)                  */
#define I2S_DMA1_TX_DMA1_ENABLE_Pos       (1UL)                     /*!< TX_DMA1_ENABLE (Bit 1)                                */
#define I2S_DMA1_TX_DMA1_ENABLE_Msk       (0x2UL)                   /*!< TX_DMA1_ENABLE (Bitfield-Mask: 0x01)                  */
#define I2S_DMA1_RX_DEPTH_DMA1_Pos        (8UL)                     /*!< RX_DEPTH_DMA1 (Bit 8)                                 */
#define I2S_DMA1_RX_DEPTH_DMA1_Msk        (0xf00UL)                 /*!< RX_DEPTH_DMA1 (Bitfield-Mask: 0x0f)                   */
#define I2S_DMA1_TX_DEPTH_DMA1_Pos        (16UL)                    /*!< TX_DEPTH_DMA1 (Bit 16)                                */
#define I2S_DMA1_TX_DEPTH_DMA1_Msk        (0xf0000UL)               /*!< TX_DEPTH_DMA1 (Bitfield-Mask: 0x0f)                   */
/* =========================================================  DMA2  ========================================================== */
#define I2S_DMA2_RX_DMA2_ENABLE_Pos       (0UL)                     /*!< RX_DMA2_ENABLE (Bit 0)                                */
#define I2S_DMA2_RX_DMA2_ENABLE_Msk       (0x1UL)                   /*!< RX_DMA2_ENABLE (Bitfield-Mask: 0x01)                  */
#define I2S_DMA2_TX_DMA2_ENABLE_Pos       (1UL)                     /*!< TX_DMA2_ENABLE (Bit 1)                                */
#define I2S_DMA2_TX_DMA2_ENABLE_Msk       (0x2UL)                   /*!< TX_DMA2_ENABLE (Bitfield-Mask: 0x01)                  */
#define I2S_DMA2_RX_DEPTH_DMA2_Pos        (8UL)                     /*!< RX_DEPTH_DMA2 (Bit 8)                                 */
#define I2S_DMA2_RX_DEPTH_DMA2_Msk        (0xf00UL)                 /*!< RX_DEPTH_DMA2 (Bitfield-Mask: 0x0f)                   */
#define I2S_DMA2_TX_DEPTH_DMA2_Pos        (16UL)                    /*!< TX_DEPTH_DMA2 (Bit 16)                                */
#define I2S_DMA2_TX_DEPTH_DMA2_Msk        (0xf0000UL)               /*!< TX_DEPTH_DMA2 (Bitfield-Mask: 0x0f)                   */
/* ==========================================================  IRQ  ========================================================== */
#define I2S_IRQ_RX_IRQ_ENABLE_Pos         (0UL)                     /*!< RX_IRQ_ENABLE (Bit 0)                                 */
#define I2S_IRQ_RX_IRQ_ENABLE_Msk         (0x1UL)                   /*!< RX_IRQ_ENABLE (Bitfield-Mask: 0x01)                   */
#define I2S_IRQ_TX_IRQ_ENABLE_Pos         (1UL)                     /*!< TX_IRQ_ENABLE (Bit 1)                                 */
#define I2S_IRQ_TX_IRQ_ENABLE_Msk         (0x2UL)                   /*!< TX_IRQ_ENABLE (Bitfield-Mask: 0x01)                   */
#define I2S_IRQ_RX_DEPTH_IRQ_Pos          (8UL)                     /*!< RX_DEPTH_IRQ (Bit 8)                                  */
#define I2S_IRQ_RX_DEPTH_IRQ_Msk          (0xf00UL)                 /*!< RX_DEPTH_IRQ (Bitfield-Mask: 0x0f)                    */
#define I2S_IRQ_TX_DEPTH_IRQ_Pos          (16UL)                    /*!< TX_DEPTH_IRQ (Bit 16)                                 */
#define I2S_IRQ_TX_DEPTH_IRQ_Msk          (0xf0000UL)               /*!< TX_DEPTH_IRQ (Bitfield-Mask: 0x0f)                    */
/* ========================================================  TXRATE  ========================================================= */
#define I2S_TXRATE_Y_DIVIDER_Pos          (0UL)                     /*!< Y_DIVIDER (Bit 0)                                     */
#define I2S_TXRATE_Y_DIVIDER_Msk          (0xffUL)                  /*!< Y_DIVIDER (Bitfield-Mask: 0xff)                       */
#define I2S_TXRATE_X_DIVIDER_Pos          (8UL)                     /*!< X_DIVIDER (Bit 8)                                     */
#define I2S_TXRATE_X_DIVIDER_Msk          (0xff00UL)                /*!< X_DIVIDER (Bitfield-Mask: 0xff)                       */
/* ========================================================  RXRATE  ========================================================= */
#define I2S_RXRATE_Y_DIVIDER_Pos          (0UL)                     /*!< Y_DIVIDER (Bit 0)                                     */
#define I2S_RXRATE_Y_DIVIDER_Msk          (0xffUL)                  /*!< Y_DIVIDER (Bitfield-Mask: 0xff)                       */
#define I2S_RXRATE_X_DIVIDER_Pos          (8UL)                     /*!< X_DIVIDER (Bit 8)                                     */
#define I2S_RXRATE_X_DIVIDER_Msk          (0xff00UL)                /*!< X_DIVIDER (Bitfield-Mask: 0xff)                       */
/* =======================================================  TXBITRATE  ======================================================= */
#define I2S_TXBITRATE_TX_BITRATE_Pos      (0UL)                     /*!< TX_BITRATE (Bit 0)                                    */
#define I2S_TXBITRATE_TX_BITRATE_Msk      (0x3fUL)                  /*!< TX_BITRATE (Bitfield-Mask: 0x3f)                      */
/* =======================================================  RXBITRATE  ======================================================= */
#define I2S_RXBITRATE_RX_BITRATE_Pos      (0UL)                     /*!< RX_BITRATE (Bit 0)                                    */
#define I2S_RXBITRATE_RX_BITRATE_Msk      (0x3fUL)                  /*!< RX_BITRATE (Bitfield-Mask: 0x3f)                      */
/* ========================================================  TXMODE  ========================================================= */
#define I2S_TXMODE_TXCLKSEL_Pos           (0UL)                     /*!< TXCLKSEL (Bit 0)                                      */
#define I2S_TXMODE_TXCLKSEL_Msk           (0x3UL)                   /*!< TXCLKSEL (Bitfield-Mask: 0x03)                        */
#define I2S_TXMODE_TX4PIN_Pos             (2UL)                     /*!< TX4PIN (Bit 2)                                        */
#define I2S_TXMODE_TX4PIN_Msk             (0x4UL)                   /*!< TX4PIN (Bitfield-Mask: 0x01)                          */
#define I2S_TXMODE_TXMCENA_Pos            (3UL)                     /*!< TXMCENA (Bit 3)                                       */
#define I2S_TXMODE_TXMCENA_Msk            (0x8UL)                   /*!< TXMCENA (Bitfield-Mask: 0x01)                         */
/* ========================================================  RXMODE  ========================================================= */
#define I2S_RXMODE_RXCLKSEL_Pos           (0UL)                     /*!< RXCLKSEL (Bit 0)                                      */
#define I2S_RXMODE_RXCLKSEL_Msk           (0x3UL)                   /*!< RXCLKSEL (Bitfield-Mask: 0x03)                        */
#define I2S_RXMODE_RX4PIN_Pos             (2UL)                     /*!< RX4PIN (Bit 2)                                        */
#define I2S_RXMODE_RX4PIN_Msk             (0x4UL)                   /*!< RX4PIN (Bitfield-Mask: 0x01)                          */
#define I2S_RXMODE_RXMCENA_Pos            (3UL)                     /*!< RXMCENA (Bit 3)                                       */
#define I2S_RXMODE_RXMCENA_Msk            (0x8UL)                   /*!< RXMCENA (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                        LPC_RITIMER                                        ================ */
/* =========================================================================================================================== */

/* ========================================================  COMPVAL  ======================================================== */
#define RITIMER_COMPVAL_RICOMP_Pos        (0UL)                     /*!< RICOMP (Bit 0)                                        */
#define RITIMER_COMPVAL_RICOMP_Msk        (0xffffffffUL)            /*!< RICOMP (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  MASK  ========================================================== */
#define RITIMER_MASK_RIMASK_Pos           (0UL)                     /*!< RIMASK (Bit 0)                                        */
#define RITIMER_MASK_RIMASK_Msk           (0xffffffffUL)            /*!< RIMASK (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  CTRL  ========================================================== */
#define RITIMER_CTRL_RITINT_Pos           (0UL)                     /*!< RITINT (Bit 0)                                        */
#define RITIMER_CTRL_RITINT_Msk           (0x1UL)                   /*!< RITINT (Bitfield-Mask: 0x01)                          */
#define RITIMER_CTRL_RITENCLR_Pos         (1UL)                     /*!< RITENCLR (Bit 1)                                      */
#define RITIMER_CTRL_RITENCLR_Msk         (0x2UL)                   /*!< RITENCLR (Bitfield-Mask: 0x01)                        */
#define RITIMER_CTRL_RITENBR_Pos          (2UL)                     /*!< RITENBR (Bit 2)                                       */
#define RITIMER_CTRL_RITENBR_Msk          (0x4UL)                   /*!< RITENBR (Bitfield-Mask: 0x01)                         */
#define RITIMER_CTRL_RITEN_Pos            (3UL)                     /*!< RITEN (Bit 3)                                         */
#define RITIMER_CTRL_RITEN_Msk            (0x8UL)                   /*!< RITEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  COUNTER  ======================================================== */
#define RITIMER_COUNTER_RICOUNTER_Pos     (0UL)                     /*!< RICOUNTER (Bit 0)                                     */
#define RITIMER_COUNTER_RICOUNTER_Msk     (0xffffffffUL)            /*!< RICOUNTER (Bitfield-Mask: 0xffffffff)                 */


/* =========================================================================================================================== */
/* ================                                         LPC_MCPWM                                         ================ */
/* =========================================================================================================================== */

