lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  CON  ========================================================== */
#define MCPWM_CON_RUN0_Pos                (0UL)                     /*!< RUN0 (Bit 0)                                          */
#define MCPWM_CON_RUN0_Msk                (0x1UL)                   /*!< RUN0 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_CENTER0_Pos             (1UL)                     /*!< CENTER0 (Bit 1)                                       */
#define MCPWM_CON_CENTER0_Msk             (0x2UL)                   /*!< CENTER0 (Bitfield-Mask: 0x01)                         */
#define MCPWM_CON_POLA0_Pos               (2UL)                     /*!< POLA0 (Bit 2)                                         */
#define MCPWM_CON_POLA0_Msk               (0x4UL)                   /*!< POLA0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CON_DTE0_Pos                (3UL)                     /*!< DTE0 (Bit 3)                                          */
#define MCPWM_CON_DTE0_Msk                (0x8UL)                   /*!< DTE0 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_DISUP0_Pos              (4UL)                     /*!< DISUP0 (Bit 4)                                        */
#define MCPWM_CON_DISUP0_Msk              (0x10UL)                  /*!< DISUP0 (Bitfield-Mask: 0x01)                          */
#define MCPWM_CON_RUN1_Pos                (8UL)                     /*!< RUN1 (Bit 8)                                          */
#define MCPWM_CON_RUN1_Msk                (0x100UL)                 /*!< RUN1 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_CENTER1_Pos             (9UL)                     /*!< CENTER1 (Bit 9)                                       */
#define MCPWM_CON_CENTER1_Msk             (0x200UL)                 /*!< CENTER1 (Bitfield-Mask: 0x01)                         */
#define MCPWM_CON_POLA1_Pos               (10UL)                    /*!< POLA1 (Bit 10)                                        */
#define MCPWM_CON_POLA1_Msk               (0x400UL)                 /*!< POLA1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CON_DTE1_Pos                (11UL)                    /*!< DTE1 (Bit 11)                                         */
#define MCPWM_CON_DTE1_Msk                (0x800UL)                 /*!< DTE1 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_DISUP1_Pos              (12UL)                    /*!< DISUP1 (Bit 12)                                       */
#define MCPWM_CON_DISUP1_Msk              (0x1000UL)                /*!< DISUP1 (Bitfield-Mask: 0x01)                          */
#define MCPWM_CON_RUN2_Pos                (16UL)                    /*!< RUN2 (Bit 16)                                         */
#define MCPWM_CON_RUN2_Msk                (0x10000UL)               /*!< RUN2 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_CENTER2_Pos             (17UL)                    /*!< CENTER2 (Bit 17)                                      */
#define MCPWM_CON_CENTER2_Msk             (0x20000UL)               /*!< CENTER2 (Bitfield-Mask: 0x01)                         */
#define MCPWM_CON_POLA2_Pos               (18UL)                    /*!< POLA2 (Bit 18)                                        */
#define MCPWM_CON_POLA2_Msk               (0x40000UL)               /*!< POLA2 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CON_DTE2_Pos                (19UL)                    /*!< DTE2 (Bit 19)                                         */
#define MCPWM_CON_DTE2_Msk                (0x80000UL)               /*!< DTE2 (Bitfield-Mask: 0x01)                            */
#define MCPWM_CON_DISUP2_Pos              (20UL)                    /*!< DISUP2 (Bit 20)                                       */
#define MCPWM_CON_DISUP2_Msk              (0x100000UL)              /*!< DISUP2 (Bitfield-Mask: 0x01)                          */
#define MCPWM_CON_INVBDC_Pos              (29UL)                    /*!< INVBDC (Bit 29)                                       */
#define MCPWM_CON_INVBDC_Msk              (0x20000000UL)            /*!< INVBDC (Bitfield-Mask: 0x01)                          */
#define MCPWM_CON_ACMODE_Pos              (30UL)                    /*!< ACMODE (Bit 30)                                       */
#define MCPWM_CON_ACMODE_Msk              (0x40000000UL)            /*!< ACMODE (Bitfield-Mask: 0x01)                          */
#define MCPWM_CON_DCMODE_Pos              (31UL)                    /*!< DCMODE (Bit 31)                                       */
#define MCPWM_CON_DCMODE_Msk              (0x80000000UL)            /*!< DCMODE (Bitfield-Mask: 0x01)                          */
/* ========================================================  CON_SET  ======================================================== */
#define MCPWM_CON_SET_RUN0_SET_Pos        (0UL)                     /*!< RUN0_SET (Bit 0)                                      */
#define MCPWM_CON_SET_RUN0_SET_Msk        (0x1UL)                   /*!< RUN0_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_CENTER0_SET_Pos     (1UL)                     /*!< CENTER0_SET (Bit 1)                                   */
#define MCPWM_CON_SET_CENTER0_SET_Msk     (0x2UL)                   /*!< CENTER0_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_SET_POLA0_SET_Pos       (2UL)                     /*!< POLA0_SET (Bit 2)                                     */
#define MCPWM_CON_SET_POLA0_SET_Msk       (0x4UL)                   /*!< POLA0_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_SET_DTE0_SET_Pos        (3UL)                     /*!< DTE0_SET (Bit 3)                                      */
#define MCPWM_CON_SET_DTE0_SET_Msk        (0x8UL)                   /*!< DTE0_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_DISUP0_SET_Pos      (4UL)                     /*!< DISUP0_SET (Bit 4)                                    */
#define MCPWM_CON_SET_DISUP0_SET_Msk      (0x10UL)                  /*!< DISUP0_SET (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_SET_RUN1_SET_Pos        (8UL)                     /*!< RUN1_SET (Bit 8)                                      */
#define MCPWM_CON_SET_RUN1_SET_Msk        (0x100UL)                 /*!< RUN1_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_CENTER1_SET_Pos     (9UL)                     /*!< CENTER1_SET (Bit 9)                                   */
#define MCPWM_CON_SET_CENTER1_SET_Msk     (0x200UL)                 /*!< CENTER1_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_SET_POLA1_SET_Pos       (10UL)                    /*!< POLA1_SET (Bit 10)                                    */
#define MCPWM_CON_SET_POLA1_SET_Msk       (0x400UL)                 /*!< POLA1_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_SET_DTE1_SET_Pos        (11UL)                    /*!< DTE1_SET (Bit 11)                                     */
#define MCPWM_CON_SET_DTE1_SET_Msk        (0x800UL)                 /*!< DTE1_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_DISUP1_SET_Pos      (12UL)                    /*!< DISUP1_SET (Bit 12)                                   */
#define MCPWM_CON_SET_DISUP1_SET_Msk      (0x1000UL)                /*!< DISUP1_SET (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_SET_RUN2_SET_Pos        (16UL)                    /*!< RUN2_SET (Bit 16)                                     */
#define MCPWM_CON_SET_RUN2_SET_Msk        (0x10000UL)               /*!< RUN2_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_CENTER2_SET_Pos     (17UL)                    /*!< CENTER2_SET (Bit 17)                                  */
#define MCPWM_CON_SET_CENTER2_SET_Msk     (0x20000UL)               /*!< CENTER2_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_SET_POLA2_SET_Pos       (18UL)                    /*!< POLA2_SET (Bit 18)                                    */
#define MCPWM_CON_SET_POLA2_SET_Msk       (0x40000UL)               /*!< POLA2_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_SET_DTE2_SET_Pos        (19UL)                    /*!< DTE2_SET (Bit 19)                                     */
#define MCPWM_CON_SET_DTE2_SET_Msk        (0x80000UL)               /*!< DTE2_SET (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_SET_DISUP2_SET_Pos      (20UL)                    /*!< DISUP2_SET (Bit 20)                                   */
#define MCPWM_CON_SET_DISUP2_SET_Msk      (0x100000UL)              /*!< DISUP2_SET (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_SET_INVBDC_SET_Pos      (29UL)                    /*!< INVBDC_SET (Bit 29)                                   */
#define MCPWM_CON_SET_INVBDC_SET_Msk      (0x20000000UL)            /*!< INVBDC_SET (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_SET_ACMODE_SET_Pos      (30UL)                    /*!< ACMODE_SET (Bit 30)                                   */
#define MCPWM_CON_SET_ACMODE_SET_Msk      (0x40000000UL)            /*!< ACMODE_SET (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_SET_DCMODE_SET_Pos      (31UL)                    /*!< DCMODE_SET (Bit 31)                                   */
#define MCPWM_CON_SET_DCMODE_SET_Msk      (0x80000000UL)            /*!< DCMODE_SET (Bitfield-Mask: 0x01)                      */
/* ========================================================  CON_CLR  ======================================================== */
#define MCPWM_CON_CLR_RUN0_CLR_Pos        (0UL)                     /*!< RUN0_CLR (Bit 0)                                      */
#define MCPWM_CON_CLR_RUN0_CLR_Msk        (0x1UL)                   /*!< RUN0_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_CENTER0_CLR_Pos     (1UL)                     /*!< CENTER0_CLR (Bit 1)                                   */
#define MCPWM_CON_CLR_CENTER0_CLR_Msk     (0x2UL)                   /*!< CENTER0_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_CLR_POLA0_CLR_Pos       (2UL)                     /*!< POLA0_CLR (Bit 2)                                     */
#define MCPWM_CON_CLR_POLA0_CLR_Msk       (0x4UL)                   /*!< POLA0_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_CLR_DTE0_CLR_Pos        (3UL)                     /*!< DTE0_CLR (Bit 3)                                      */
#define MCPWM_CON_CLR_DTE0_CLR_Msk        (0x8UL)                   /*!< DTE0_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_DISUP0_CLR_Pos      (4UL)                     /*!< DISUP0_CLR (Bit 4)                                    */
#define MCPWM_CON_CLR_DISUP0_CLR_Msk      (0x10UL)                  /*!< DISUP0_CLR (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_CLR_RUN1_CLR_Pos        (8UL)                     /*!< RUN1_CLR (Bit 8)                                      */
#define MCPWM_CON_CLR_RUN1_CLR_Msk        (0x100UL)                 /*!< RUN1_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_CENTER1_CLR_Pos     (9UL)                     /*!< CENTER1_CLR (Bit 9)                                   */
#define MCPWM_CON_CLR_CENTER1_CLR_Msk     (0x200UL)                 /*!< CENTER1_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_CLR_POLA1_CLR_Pos       (10UL)                    /*!< POLA1_CLR (Bit 10)                                    */
#define MCPWM_CON_CLR_POLA1_CLR_Msk       (0x400UL)                 /*!< POLA1_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_CLR_DTE1_CLR_Pos        (11UL)                    /*!< DTE1_CLR (Bit 11)                                     */
#define MCPWM_CON_CLR_DTE1_CLR_Msk        (0x800UL)                 /*!< DTE1_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_DISUP1_CLR_Pos      (12UL)                    /*!< DISUP1_CLR (Bit 12)                                   */
#define MCPWM_CON_CLR_DISUP1_CLR_Msk      (0x1000UL)                /*!< DISUP1_CLR (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_CLR_RUN2_CLR_Pos        (16UL)                    /*!< RUN2_CLR (Bit 16)                                     */
#define MCPWM_CON_CLR_RUN2_CLR_Msk        (0x10000UL)               /*!< RUN2_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_CENTER2_CLR_Pos     (17UL)                    /*!< CENTER2_CLR (Bit 17)                                  */
#define MCPWM_CON_CLR_CENTER2_CLR_Msk     (0x20000UL)               /*!< CENTER2_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_CON_CLR_POLA2_CLR_Pos       (18UL)                    /*!< POLA2_CLR (Bit 18)                                    */
#define MCPWM_CON_CLR_POLA2_CLR_Msk       (0x40000UL)               /*!< POLA2_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_CLR_DTE2_CLR_Pos        (19UL)                    /*!< DTE2_CLR (Bit 19)                                     */
#define MCPWM_CON_CLR_DTE2_CLR_Msk        (0x80000UL)               /*!< DTE2_CLR (Bitfield-Mask: 0x01)                        */
#define MCPWM_CON_CLR_DISUP2_CLR_Pos      (20UL)                    /*!< DISUP2_CLR (Bit 20)                                   */
#define MCPWM_CON_CLR_DISUP2_CLR_Msk      (0x100000UL)              /*!< DISUP2_CLR (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_CLR_INVBDC_CLR_Pos      (29UL)                    /*!< INVBDC_CLR (Bit 29)                                   */
#define MCPWM_CON_CLR_INVBDC_CLR_Msk      (0x20000000UL)            /*!< INVBDC_CLR (Bitfield-Mask: 0x01)                      */
#define MCPWM_CON_CLR_ACMOD_CLR_Pos       (30UL)                    /*!< ACMOD_CLR (Bit 30)                                    */
#define MCPWM_CON_CLR_ACMOD_CLR_Msk       (0x40000000UL)            /*!< ACMOD_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CON_CLR_DCMODE_CLR_Pos      (31UL)                    /*!< DCMODE_CLR (Bit 31)                                   */
#define MCPWM_CON_CLR_DCMODE_CLR_Msk      (0x80000000UL)            /*!< DCMODE_CLR (Bitfield-Mask: 0x01)                      */
/* ========================================================  CAPCON  ========================================================= */
#define MCPWM_CAPCON_CAP0MCI0_RE_Pos      (0UL)                     /*!< CAP0MCI0_RE (Bit 0)                                   */
#define MCPWM_CAPCON_CAP0MCI0_RE_Msk      (0x1UL)                   /*!< CAP0MCI0_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP0MCI0_FE_Pos      (1UL)                     /*!< CAP0MCI0_FE (Bit 1)                                   */
#define MCPWM_CAPCON_CAP0MCI0_FE_Msk      (0x2UL)                   /*!< CAP0MCI0_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP0MCI1_RE_Pos      (2UL)                     /*!< CAP0MCI1_RE (Bit 2)                                   */
#define MCPWM_CAPCON_CAP0MCI1_RE_Msk      (0x4UL)                   /*!< CAP0MCI1_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP0MCI1_FE_Pos      (3UL)                     /*!< CAP0MCI1_FE (Bit 3)                                   */
#define MCPWM_CAPCON_CAP0MCI1_FE_Msk      (0x8UL)                   /*!< CAP0MCI1_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP0MCI2_RE_Pos      (4UL)                     /*!< CAP0MCI2_RE (Bit 4)                                   */
#define MCPWM_CAPCON_CAP0MCI2_RE_Msk      (0x10UL)                  /*!< CAP0MCI2_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP0MCI2_FE_Pos      (5UL)                     /*!< CAP0MCI2_FE (Bit 5)                                   */
#define MCPWM_CAPCON_CAP0MCI2_FE_Msk      (0x20UL)                  /*!< CAP0MCI2_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI0_RE_Pos      (6UL)                     /*!< CAP1MCI0_RE (Bit 6)                                   */
#define MCPWM_CAPCON_CAP1MCI0_RE_Msk      (0x40UL)                  /*!< CAP1MCI0_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI0_FE_Pos      (7UL)                     /*!< CAP1MCI0_FE (Bit 7)                                   */
#define MCPWM_CAPCON_CAP1MCI0_FE_Msk      (0x80UL)                  /*!< CAP1MCI0_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI1_RE_Pos      (8UL)                     /*!< CAP1MCI1_RE (Bit 8)                                   */
#define MCPWM_CAPCON_CAP1MCI1_RE_Msk      (0x100UL)                 /*!< CAP1MCI1_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI1_FE_Pos      (9UL)                     /*!< CAP1MCI1_FE (Bit 9)                                   */
#define MCPWM_CAPCON_CAP1MCI1_FE_Msk      (0x200UL)                 /*!< CAP1MCI1_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI2_RE_Pos      (10UL)                    /*!< CAP1MCI2_RE (Bit 10)                                  */
#define MCPWM_CAPCON_CAP1MCI2_RE_Msk      (0x400UL)                 /*!< CAP1MCI2_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP1MCI2_FE_Pos      (11UL)                    /*!< CAP1MCI2_FE (Bit 11)                                  */
#define MCPWM_CAPCON_CAP1MCI2_FE_Msk      (0x800UL)                 /*!< CAP1MCI2_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI0_RE_Pos      (12UL)                    /*!< CAP2MCI0_RE (Bit 12)                                  */
#define MCPWM_CAPCON_CAP2MCI0_RE_Msk      (0x1000UL)                /*!< CAP2MCI0_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI0_FE_Pos      (13UL)                    /*!< CAP2MCI0_FE (Bit 13)                                  */
#define MCPWM_CAPCON_CAP2MCI0_FE_Msk      (0x2000UL)                /*!< CAP2MCI0_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI1_RE_Pos      (14UL)                    /*!< CAP2MCI1_RE (Bit 14)                                  */
#define MCPWM_CAPCON_CAP2MCI1_RE_Msk      (0x4000UL)                /*!< CAP2MCI1_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI1_FE_Pos      (15UL)                    /*!< CAP2MCI1_FE (Bit 15)                                  */
#define MCPWM_CAPCON_CAP2MCI1_FE_Msk      (0x8000UL)                /*!< CAP2MCI1_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI2_RE_Pos      (16UL)                    /*!< CAP2MCI2_RE (Bit 16)                                  */
#define MCPWM_CAPCON_CAP2MCI2_RE_Msk      (0x10000UL)               /*!< CAP2MCI2_RE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_CAP2MCI2_FE_Pos      (17UL)                    /*!< CAP2MCI2_FE (Bit 17)                                  */
#define MCPWM_CAPCON_CAP2MCI2_FE_Msk      (0x20000UL)               /*!< CAP2MCI2_FE (Bitfield-Mask: 0x01)                     */
#define MCPWM_CAPCON_RT0_Pos              (18UL)                    /*!< RT0 (Bit 18)                                          */
#define MCPWM_CAPCON_RT0_Msk              (0x40000UL)               /*!< RT0 (Bitfield-Mask: 0x01)                             */
#define MCPWM_CAPCON_RT1_Pos              (19UL)                    /*!< RT1 (Bit 19)                                          */
#define MCPWM_CAPCON_RT1_Msk              (0x80000UL)               /*!< RT1 (Bitfield-Mask: 0x01)                             */
#define MCPWM_CAPCON_RT2_Pos              (20UL)                    /*!< RT2 (Bit 20)                                          */
#define MCPWM_CAPCON_RT2_Msk              (0x100000UL)              /*!< RT2 (Bitfield-Mask: 0x01)                             */
/* ======================================================  CAPCON_SET  ======================================================= */
#define MCPWM_CAPCON_SET_CAP0MCI0_RE_SET_Pos (0UL)                  /*!< CAP0MCI0_RE_SET (Bit 0)                               */
#define MCPWM_CAPCON_SET_CAP0MCI0_RE_SET_Msk (0x1UL)                /*!< CAP0MCI0_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP0MCI0_FE_SET_Pos (1UL)                  /*!< CAP0MCI0_FE_SET (Bit 1)                               */
#define MCPWM_CAPCON_SET_CAP0MCI0_FE_SET_Msk (0x2UL)                /*!< CAP0MCI0_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP0MCI1_RE_SET_Pos (2UL)                  /*!< CAP0MCI1_RE_SET (Bit 2)                               */
#define MCPWM_CAPCON_SET_CAP0MCI1_RE_SET_Msk (0x4UL)                /*!< CAP0MCI1_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP0MCI1_FE_SET_Pos (3UL)                  /*!< CAP0MCI1_FE_SET (Bit 3)                               */
#define MCPWM_CAPCON_SET_CAP0MCI1_FE_SET_Msk (0x8UL)                /*!< CAP0MCI1_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP0MCI2_RE_SET_Pos (4UL)                  /*!< CAP0MCI2_RE_SET (Bit 4)                               */
#define MCPWM_CAPCON_SET_CAP0MCI2_RE_SET_Msk (0x10UL)               /*!< CAP0MCI2_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP0MCI2_FE_SET_Pos (5UL)                  /*!< CAP0MCI2_FE_SET (Bit 5)                               */
#define MCPWM_CAPCON_SET_CAP0MCI2_FE_SET_Msk (0x20UL)               /*!< CAP0MCI2_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI0_RE_SET_Pos (6UL)                  /*!< CAP1MCI0_RE_SET (Bit 6)                               */
#define MCPWM_CAPCON_SET_CAP1MCI0_RE_SET_Msk (0x40UL)               /*!< CAP1MCI0_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI0_FE_SET_Pos (7UL)                  /*!< CAP1MCI0_FE_SET (Bit 7)                               */
#define MCPWM_CAPCON_SET_CAP1MCI0_FE_SET_Msk (0x80UL)               /*!< CAP1MCI0_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI1_RE_SET_Pos (8UL)                  /*!< CAP1MCI1_RE_SET (Bit 8)                               */
#define MCPWM_CAPCON_SET_CAP1MCI1_RE_SET_Msk (0x100UL)              /*!< CAP1MCI1_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI1_FE_SET_Pos (9UL)                  /*!< CAP1MCI1_FE_SET (Bit 9)                               */
#define MCPWM_CAPCON_SET_CAP1MCI1_FE_SET_Msk (0x200UL)              /*!< CAP1MCI1_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI2_RE_SET_Pos (10UL)                 /*!< CAP1MCI2_RE_SET (Bit 10)                              */
#define MCPWM_CAPCON_SET_CAP1MCI2_RE_SET_Msk (0x400UL)              /*!< CAP1MCI2_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP1MCI2_FE_SET_Pos (11UL)                 /*!< CAP1MCI2_FE_SET (Bit 11)                              */
#define MCPWM_CAPCON_SET_CAP1MCI2_FE_SET_Msk (0x800UL)              /*!< CAP1MCI2_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI0_RE_SET_Pos (12UL)                 /*!< CAP2MCI0_RE_SET (Bit 12)                              */
#define MCPWM_CAPCON_SET_CAP2MCI0_RE_SET_Msk (0x1000UL)             /*!< CAP2MCI0_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI0_FE_SET_Pos (13UL)                 /*!< CAP2MCI0_FE_SET (Bit 13)                              */
#define MCPWM_CAPCON_SET_CAP2MCI0_FE_SET_Msk (0x2000UL)             /*!< CAP2MCI0_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI1_RE_SET_Pos (14UL)                 /*!< CAP2MCI1_RE_SET (Bit 14)                              */
