lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define MCPWM_CAPCON_SET_CAP2MCI1_RE_SET_Msk (0x4000UL)             /*!< CAP2MCI1_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI1_FE_SET_Pos (15UL)                 /*!< CAP2MCI1_FE_SET (Bit 15)                              */
#define MCPWM_CAPCON_SET_CAP2MCI1_FE_SET_Msk (0x8000UL)             /*!< CAP2MCI1_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI2_RE_SET_Pos (16UL)                 /*!< CAP2MCI2_RE_SET (Bit 16)                              */
#define MCPWM_CAPCON_SET_CAP2MCI2_RE_SET_Msk (0x10000UL)            /*!< CAP2MCI2_RE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_CAP2MCI2_FE_SET_Pos (17UL)                 /*!< CAP2MCI2_FE_SET (Bit 17)                              */
#define MCPWM_CAPCON_SET_CAP2MCI2_FE_SET_Msk (0x20000UL)            /*!< CAP2MCI2_FE_SET (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_SET_RT0_SET_Pos      (18UL)                    /*!< RT0_SET (Bit 18)                                      */
#define MCPWM_CAPCON_SET_RT0_SET_Msk      (0x40000UL)               /*!< RT0_SET (Bitfield-Mask: 0x01)                         */
#define MCPWM_CAPCON_SET_RT1_SET_Pos      (19UL)                    /*!< RT1_SET (Bit 19)                                      */
#define MCPWM_CAPCON_SET_RT1_SET_Msk      (0x80000UL)               /*!< RT1_SET (Bitfield-Mask: 0x01)                         */
#define MCPWM_CAPCON_SET_RT2_SET_Pos      (20UL)                    /*!< RT2_SET (Bit 20)                                      */
#define MCPWM_CAPCON_SET_RT2_SET_Msk      (0x100000UL)              /*!< RT2_SET (Bitfield-Mask: 0x01)                         */
/* ======================================================  CAPCON_CLR  ======================================================= */
#define MCPWM_CAPCON_CLR_CAP0MCI0_RE_CLR_Pos (0UL)                  /*!< CAP0MCI0_RE_CLR (Bit 0)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI0_RE_CLR_Msk (0x1UL)                /*!< CAP0MCI0_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP0MCI0_FE_CLR_Pos (1UL)                  /*!< CAP0MCI0_FE_CLR (Bit 1)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI0_FE_CLR_Msk (0x2UL)                /*!< CAP0MCI0_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP0MCI1_RE_CLR_Pos (2UL)                  /*!< CAP0MCI1_RE_CLR (Bit 2)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI1_RE_CLR_Msk (0x4UL)                /*!< CAP0MCI1_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP0MCI1_FE_CLR_Pos (3UL)                  /*!< CAP0MCI1_FE_CLR (Bit 3)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI1_FE_CLR_Msk (0x8UL)                /*!< CAP0MCI1_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP0MCI2_RE_CLR_Pos (4UL)                  /*!< CAP0MCI2_RE_CLR (Bit 4)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI2_RE_CLR_Msk (0x10UL)               /*!< CAP0MCI2_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP0MCI2_FE_CLR_Pos (5UL)                  /*!< CAP0MCI2_FE_CLR (Bit 5)                               */
#define MCPWM_CAPCON_CLR_CAP0MCI2_FE_CLR_Msk (0x20UL)               /*!< CAP0MCI2_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI0_RE_CLR_Pos (6UL)                  /*!< CAP1MCI0_RE_CLR (Bit 6)                               */
#define MCPWM_CAPCON_CLR_CAP1MCI0_RE_CLR_Msk (0x40UL)               /*!< CAP1MCI0_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI0_FE_CLR_Pos (7UL)                  /*!< CAP1MCI0_FE_CLR (Bit 7)                               */
#define MCPWM_CAPCON_CLR_CAP1MCI0_FE_CLR_Msk (0x80UL)               /*!< CAP1MCI0_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI1_RE_CLR_Pos (8UL)                  /*!< CAP1MCI1_RE_CLR (Bit 8)                               */
#define MCPWM_CAPCON_CLR_CAP1MCI1_RE_CLR_Msk (0x100UL)              /*!< CAP1MCI1_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI1_FE_CLR_Pos (9UL)                  /*!< CAP1MCI1_FE_CLR (Bit 9)                               */
#define MCPWM_CAPCON_CLR_CAP1MCI1_FE_CLR_Msk (0x200UL)              /*!< CAP1MCI1_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI2_RE_CLR_Pos (10UL)                 /*!< CAP1MCI2_RE_CLR (Bit 10)                              */
#define MCPWM_CAPCON_CLR_CAP1MCI2_RE_CLR_Msk (0x400UL)              /*!< CAP1MCI2_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP1MCI2_FE_CLR_Pos (11UL)                 /*!< CAP1MCI2_FE_CLR (Bit 11)                              */
#define MCPWM_CAPCON_CLR_CAP1MCI2_FE_CLR_Msk (0x800UL)              /*!< CAP1MCI2_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI0_RE_CLR_Pos (12UL)                 /*!< CAP2MCI0_RE_CLR (Bit 12)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI0_RE_CLR_Msk (0x1000UL)             /*!< CAP2MCI0_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI0_FE_CLR_Pos (13UL)                 /*!< CAP2MCI0_FE_CLR (Bit 13)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI0_FE_CLR_Msk (0x2000UL)             /*!< CAP2MCI0_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI1_RE_CLR_Pos (14UL)                 /*!< CAP2MCI1_RE_CLR (Bit 14)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI1_RE_CLR_Msk (0x4000UL)             /*!< CAP2MCI1_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI1_FE_CLR_Pos (15UL)                 /*!< CAP2MCI1_FE_CLR (Bit 15)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI1_FE_CLR_Msk (0x8000UL)             /*!< CAP2MCI1_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI2_RE_CLR_Pos (16UL)                 /*!< CAP2MCI2_RE_CLR (Bit 16)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI2_RE_CLR_Msk (0x10000UL)            /*!< CAP2MCI2_RE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_CAP2MCI2_FE_CLR_Pos (17UL)                 /*!< CAP2MCI2_FE_CLR (Bit 17)                              */
#define MCPWM_CAPCON_CLR_CAP2MCI2_FE_CLR_Msk (0x20000UL)            /*!< CAP2MCI2_FE_CLR (Bitfield-Mask: 0x01)                 */
#define MCPWM_CAPCON_CLR_RT0_CLR_Pos      (18UL)                    /*!< RT0_CLR (Bit 18)                                      */
#define MCPWM_CAPCON_CLR_RT0_CLR_Msk      (0x40000UL)               /*!< RT0_CLR (Bitfield-Mask: 0x01)                         */
#define MCPWM_CAPCON_CLR_RT1_CLR_Pos      (19UL)                    /*!< RT1_CLR (Bit 19)                                      */
#define MCPWM_CAPCON_CLR_RT1_CLR_Msk      (0x80000UL)               /*!< RT1_CLR (Bitfield-Mask: 0x01)                         */
#define MCPWM_CAPCON_CLR_RT2_CLR_Pos      (20UL)                    /*!< RT2_CLR (Bit 20)                                      */
#define MCPWM_CAPCON_CLR_RT2_CLR_Msk      (0x100000UL)              /*!< RT2_CLR (Bitfield-Mask: 0x01)                         */
/* ==========================================================  DT  =========================================================== */
#define MCPWM_DT_DT0_Pos                  (0UL)                     /*!< DT0 (Bit 0)                                           */
#define MCPWM_DT_DT0_Msk                  (0x3ffUL)                 /*!< DT0 (Bitfield-Mask: 0x3ff)                            */
#define MCPWM_DT_DT1_Pos                  (10UL)                    /*!< DT1 (Bit 10)                                          */
#define MCPWM_DT_DT1_Msk                  (0xffc00UL)               /*!< DT1 (Bitfield-Mask: 0x3ff)                            */
#define MCPWM_DT_DT2_Pos                  (20UL)                    /*!< DT2 (Bit 20)                                          */
#define MCPWM_DT_DT2_Msk                  (0x3ff00000UL)            /*!< DT2 (Bitfield-Mask: 0x3ff)                            */
/* ==========================================================  CP  =========================================================== */
#define MCPWM_CP_CCPA0_Pos                (0UL)                     /*!< CCPA0 (Bit 0)                                         */
#define MCPWM_CP_CCPA0_Msk                (0x1UL)                   /*!< CCPA0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CP_CCPB0_Pos                (1UL)                     /*!< CCPB0 (Bit 1)                                         */
#define MCPWM_CP_CCPB0_Msk                (0x2UL)                   /*!< CCPB0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CP_CCPA1_Pos                (2UL)                     /*!< CCPA1 (Bit 2)                                         */
#define MCPWM_CP_CCPA1_Msk                (0x4UL)                   /*!< CCPA1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CP_CCPB1_Pos                (3UL)                     /*!< CCPB1 (Bit 3)                                         */
#define MCPWM_CP_CCPB1_Msk                (0x8UL)                   /*!< CCPB1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CP_CCPA2_Pos                (4UL)                     /*!< CCPA2 (Bit 4)                                         */
#define MCPWM_CP_CCPA2_Msk                (0x10UL)                  /*!< CCPA2 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CP_CCPB2_Pos                (5UL)                     /*!< CCPB2 (Bit 5)                                         */
#define MCPWM_CP_CCPB2_Msk                (0x20UL)                  /*!< CCPB2 (Bitfield-Mask: 0x01)                           */
/* =========================================================  INTEN  ========================================================= */
#define MCPWM_INTEN_ILIM0_Pos             (0UL)                     /*!< ILIM0 (Bit 0)                                         */
#define MCPWM_INTEN_ILIM0_Msk             (0x1UL)                   /*!< ILIM0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_IMAT0_Pos             (1UL)                     /*!< IMAT0 (Bit 1)                                         */
#define MCPWM_INTEN_IMAT0_Msk             (0x2UL)                   /*!< IMAT0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ICAP0_Pos             (2UL)                     /*!< ICAP0 (Bit 2)                                         */
#define MCPWM_INTEN_ICAP0_Msk             (0x4UL)                   /*!< ICAP0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ILIM1_Pos             (4UL)                     /*!< ILIM1 (Bit 4)                                         */
#define MCPWM_INTEN_ILIM1_Msk             (0x10UL)                  /*!< ILIM1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_IMAT1_Pos             (5UL)                     /*!< IMAT1 (Bit 5)                                         */
#define MCPWM_INTEN_IMAT1_Msk             (0x20UL)                  /*!< IMAT1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ICAP1_Pos             (6UL)                     /*!< ICAP1 (Bit 6)                                         */
#define MCPWM_INTEN_ICAP1_Msk             (0x40UL)                  /*!< ICAP1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ILIM2_Pos             (8UL)                     /*!< ILIM2 (Bit 8)                                         */
#define MCPWM_INTEN_ILIM2_Msk             (0x100UL)                 /*!< ILIM2 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_IMAT2_Pos             (9UL)                     /*!< IMAT2 (Bit 9)                                         */
#define MCPWM_INTEN_IMAT2_Msk             (0x200UL)                 /*!< IMAT2 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ICAP2_Pos             (10UL)                    /*!< ICAP2 (Bit 10)                                        */
#define MCPWM_INTEN_ICAP2_Msk             (0x400UL)                 /*!< ICAP2 (Bitfield-Mask: 0x01)                           */
#define MCPWM_INTEN_ABORT_Pos             (15UL)                    /*!< ABORT (Bit 15)                                        */
#define MCPWM_INTEN_ABORT_Msk             (0x8000UL)                /*!< ABORT (Bitfield-Mask: 0x01)                           */
/* =======================================================  INTEN_SET  ======================================================= */
#define MCPWM_INTEN_SET_ILIM0_SET_Pos     (0UL)                     /*!< ILIM0_SET (Bit 0)                                     */
#define MCPWM_INTEN_SET_ILIM0_SET_Msk     (0x1UL)                   /*!< ILIM0_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_IMAT0_SET_Pos     (1UL)                     /*!< IMAT0_SET (Bit 1)                                     */
#define MCPWM_INTEN_SET_IMAT0_SET_Msk     (0x2UL)                   /*!< IMAT0_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ICAP0_SET_Pos     (2UL)                     /*!< ICAP0_SET (Bit 2)                                     */
#define MCPWM_INTEN_SET_ICAP0_SET_Msk     (0x4UL)                   /*!< ICAP0_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ILIM1_SET_Pos     (4UL)                     /*!< ILIM1_SET (Bit 4)                                     */
#define MCPWM_INTEN_SET_ILIM1_SET_Msk     (0x10UL)                  /*!< ILIM1_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_IMAT1_SET_Pos     (5UL)                     /*!< IMAT1_SET (Bit 5)                                     */
#define MCPWM_INTEN_SET_IMAT1_SET_Msk     (0x20UL)                  /*!< IMAT1_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ICAP1_SET_Pos     (6UL)                     /*!< ICAP1_SET (Bit 6)                                     */
#define MCPWM_INTEN_SET_ICAP1_SET_Msk     (0x40UL)                  /*!< ICAP1_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ILIM2_SET_Pos     (9UL)                     /*!< ILIM2_SET (Bit 9)                                     */
#define MCPWM_INTEN_SET_ILIM2_SET_Msk     (0x200UL)                 /*!< ILIM2_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_IMAT2_SET_Pos     (10UL)                    /*!< IMAT2_SET (Bit 10)                                    */
#define MCPWM_INTEN_SET_IMAT2_SET_Msk     (0x400UL)                 /*!< IMAT2_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ICAP2_SET_Pos     (11UL)                    /*!< ICAP2_SET (Bit 11)                                    */
#define MCPWM_INTEN_SET_ICAP2_SET_Msk     (0x800UL)                 /*!< ICAP2_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_SET_ABORT_SET_Pos     (15UL)                    /*!< ABORT_SET (Bit 15)                                    */
#define MCPWM_INTEN_SET_ABORT_SET_Msk     (0x8000UL)                /*!< ABORT_SET (Bitfield-Mask: 0x01)                       */
/* =======================================================  INTEN_CLR  ======================================================= */
#define MCPWM_INTEN_CLR_ILIM0_CLR_Pos     (0UL)                     /*!< ILIM0_CLR (Bit 0)                                     */
#define MCPWM_INTEN_CLR_ILIM0_CLR_Msk     (0x1UL)                   /*!< ILIM0_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_IMAT0_CLR_Pos     (1UL)                     /*!< IMAT0_CLR (Bit 1)                                     */
#define MCPWM_INTEN_CLR_IMAT0_CLR_Msk     (0x2UL)                   /*!< IMAT0_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ICAP0_CLR_Pos     (2UL)                     /*!< ICAP0_CLR (Bit 2)                                     */
#define MCPWM_INTEN_CLR_ICAP0_CLR_Msk     (0x4UL)                   /*!< ICAP0_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ILIM1_CLR_Pos     (4UL)                     /*!< ILIM1_CLR (Bit 4)                                     */
#define MCPWM_INTEN_CLR_ILIM1_CLR_Msk     (0x10UL)                  /*!< ILIM1_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_IMAT1_CLR_Pos     (5UL)                     /*!< IMAT1_CLR (Bit 5)                                     */
#define MCPWM_INTEN_CLR_IMAT1_CLR_Msk     (0x20UL)                  /*!< IMAT1_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ICAP1_CLR_Pos     (6UL)                     /*!< ICAP1_CLR (Bit 6)                                     */
#define MCPWM_INTEN_CLR_ICAP1_CLR_Msk     (0x40UL)                  /*!< ICAP1_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ILIM2_CLR_Pos     (8UL)                     /*!< ILIM2_CLR (Bit 8)                                     */
#define MCPWM_INTEN_CLR_ILIM2_CLR_Msk     (0x100UL)                 /*!< ILIM2_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_IMAT2_CLR_Pos     (9UL)                     /*!< IMAT2_CLR (Bit 9)                                     */
#define MCPWM_INTEN_CLR_IMAT2_CLR_Msk     (0x200UL)                 /*!< IMAT2_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ICAP2_CLR_Pos     (10UL)                    /*!< ICAP2_CLR (Bit 10)                                    */
#define MCPWM_INTEN_CLR_ICAP2_CLR_Msk     (0x400UL)                 /*!< ICAP2_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_INTEN_CLR_ABORT_CLR_Pos     (15UL)                    /*!< ABORT_CLR (Bit 15)                                    */
#define MCPWM_INTEN_CLR_ABORT_CLR_Msk     (0x8000UL)                /*!< ABORT_CLR (Bitfield-Mask: 0x01)                       */
/* =========================================================  INTF  ========================================================== */
#define MCPWM_INTF_ILIM0_F_Pos            (0UL)                     /*!< ILIM0_F (Bit 0)                                       */
#define MCPWM_INTF_ILIM0_F_Msk            (0x1UL)                   /*!< ILIM0_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_IMAT0_F_Pos            (1UL)                     /*!< IMAT0_F (Bit 1)                                       */
#define MCPWM_INTF_IMAT0_F_Msk            (0x2UL)                   /*!< IMAT0_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ICAP0_F_Pos            (2UL)                     /*!< ICAP0_F (Bit 2)                                       */
#define MCPWM_INTF_ICAP0_F_Msk            (0x4UL)                   /*!< ICAP0_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ILIM1_F_Pos            (4UL)                     /*!< ILIM1_F (Bit 4)                                       */
#define MCPWM_INTF_ILIM1_F_Msk            (0x10UL)                  /*!< ILIM1_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_IMAT1_F_Pos            (5UL)                     /*!< IMAT1_F (Bit 5)                                       */
#define MCPWM_INTF_IMAT1_F_Msk            (0x20UL)                  /*!< IMAT1_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ICAP1_F_Pos            (6UL)                     /*!< ICAP1_F (Bit 6)                                       */
#define MCPWM_INTF_ICAP1_F_Msk            (0x40UL)                  /*!< ICAP1_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ILIM2_F_Pos            (8UL)                     /*!< ILIM2_F (Bit 8)                                       */
#define MCPWM_INTF_ILIM2_F_Msk            (0x100UL)                 /*!< ILIM2_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_IMAT2_F_Pos            (9UL)                     /*!< IMAT2_F (Bit 9)                                       */
#define MCPWM_INTF_IMAT2_F_Msk            (0x200UL)                 /*!< IMAT2_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ICAP2_F_Pos            (10UL)                    /*!< ICAP2_F (Bit 10)                                      */
#define MCPWM_INTF_ICAP2_F_Msk            (0x400UL)                 /*!< ICAP2_F (Bitfield-Mask: 0x01)                         */
#define MCPWM_INTF_ABORT_F_Pos            (15UL)                    /*!< ABORT_F (Bit 15)                                      */
#define MCPWM_INTF_ABORT_F_Msk            (0x8000UL)                /*!< ABORT_F (Bitfield-Mask: 0x01)                         */
/* =======================================================  INTF_SET  ======================================================== */
#define MCPWM_INTF_SET_ILIM0_F_SET_Pos    (0UL)                     /*!< ILIM0_F_SET (Bit 0)                                   */
#define MCPWM_INTF_SET_ILIM0_F_SET_Msk    (0x1UL)                   /*!< ILIM0_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_IMAT0_F_SET_Pos    (1UL)                     /*!< IMAT0_F_SET (Bit 1)                                   */
#define MCPWM_INTF_SET_IMAT0_F_SET_Msk    (0x2UL)                   /*!< IMAT0_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ICAP0_F_SET_Pos    (2UL)                     /*!< ICAP0_F_SET (Bit 2)                                   */
#define MCPWM_INTF_SET_ICAP0_F_SET_Msk    (0x4UL)                   /*!< ICAP0_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ILIM1_F_SET_Pos    (4UL)                     /*!< ILIM1_F_SET (Bit 4)                                   */
#define MCPWM_INTF_SET_ILIM1_F_SET_Msk    (0x10UL)                  /*!< ILIM1_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_IMAT1_F_SET_Pos    (5UL)                     /*!< IMAT1_F_SET (Bit 5)                                   */
#define MCPWM_INTF_SET_IMAT1_F_SET_Msk    (0x20UL)                  /*!< IMAT1_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ICAP1_F_SET_Pos    (6UL)                     /*!< ICAP1_F_SET (Bit 6)                                   */
#define MCPWM_INTF_SET_ICAP1_F_SET_Msk    (0x40UL)                  /*!< ICAP1_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ILIM2_F_SET_Pos    (8UL)                     /*!< ILIM2_F_SET (Bit 8)                                   */
#define MCPWM_INTF_SET_ILIM2_F_SET_Msk    (0x100UL)                 /*!< ILIM2_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_IMAT2_F_SET_Pos    (9UL)                     /*!< IMAT2_F_SET (Bit 9)                                   */
#define MCPWM_INTF_SET_IMAT2_F_SET_Msk    (0x200UL)                 /*!< IMAT2_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ICAP2_F_SET_Pos    (10UL)                    /*!< ICAP2_F_SET (Bit 10)                                  */
#define MCPWM_INTF_SET_ICAP2_F_SET_Msk    (0x400UL)                 /*!< ICAP2_F_SET (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_SET_ABORT_F_SET_Pos    (15UL)                    /*!< ABORT_F_SET (Bit 15)                                  */
#define MCPWM_INTF_SET_ABORT_F_SET_Msk    (0x8000UL)                /*!< ABORT_F_SET (Bitfield-Mask: 0x01)                     */
/* =======================================================  INTF_CLR  ======================================================== */
#define MCPWM_INTF_CLR_ILIM0_F_CLR_Pos    (0UL)                     /*!< ILIM0_F_CLR (Bit 0)                                   */
#define MCPWM_INTF_CLR_ILIM0_F_CLR_Msk    (0x1UL)                   /*!< ILIM0_F_CLR (Bitfield-Mask: 0x01)                     */
