lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define MCPWM_INTF_CLR_IMAT0_F_CLR_Pos    (1UL)                     /*!< IMAT0_F_CLR (Bit 1)                                   */
#define MCPWM_INTF_CLR_IMAT0_F_CLR_Msk    (0x2UL)                   /*!< IMAT0_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ICAP0_F_CLR_Pos    (2UL)                     /*!< ICAP0_F_CLR (Bit 2)                                   */
#define MCPWM_INTF_CLR_ICAP0_F_CLR_Msk    (0x4UL)                   /*!< ICAP0_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ILIM1_F_CLR_Pos    (4UL)                     /*!< ILIM1_F_CLR (Bit 4)                                   */
#define MCPWM_INTF_CLR_ILIM1_F_CLR_Msk    (0x10UL)                  /*!< ILIM1_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_IMAT1_F_CLR_Pos    (5UL)                     /*!< IMAT1_F_CLR (Bit 5)                                   */
#define MCPWM_INTF_CLR_IMAT1_F_CLR_Msk    (0x20UL)                  /*!< IMAT1_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ICAP1_F_CLR_Pos    (6UL)                     /*!< ICAP1_F_CLR (Bit 6)                                   */
#define MCPWM_INTF_CLR_ICAP1_F_CLR_Msk    (0x40UL)                  /*!< ICAP1_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ILIM2_F_CLR_Pos    (8UL)                     /*!< ILIM2_F_CLR (Bit 8)                                   */
#define MCPWM_INTF_CLR_ILIM2_F_CLR_Msk    (0x100UL)                 /*!< ILIM2_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_IMAT2_F_CLR_Pos    (9UL)                     /*!< IMAT2_F_CLR (Bit 9)                                   */
#define MCPWM_INTF_CLR_IMAT2_F_CLR_Msk    (0x200UL)                 /*!< IMAT2_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ICAP2_F_CLR_Pos    (10UL)                    /*!< ICAP2_F_CLR (Bit 10)                                  */
#define MCPWM_INTF_CLR_ICAP2_F_CLR_Msk    (0x400UL)                 /*!< ICAP2_F_CLR (Bitfield-Mask: 0x01)                     */
#define MCPWM_INTF_CLR_ABORT_F_CLR_Pos    (15UL)                    /*!< ABORT_F_CLR (Bit 15)                                  */
#define MCPWM_INTF_CLR_ABORT_F_CLR_Msk    (0x8000UL)                /*!< ABORT_F_CLR (Bitfield-Mask: 0x01)                     */
/* ========================================================  CNTCON  ========================================================= */
#define MCPWM_CNTCON_TC0MCI0_RE_Pos       (0UL)                     /*!< TC0MCI0_RE (Bit 0)                                    */
#define MCPWM_CNTCON_TC0MCI0_RE_Msk       (0x1UL)                   /*!< TC0MCI0_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC0MCI0_FE_Pos       (1UL)                     /*!< TC0MCI0_FE (Bit 1)                                    */
#define MCPWM_CNTCON_TC0MCI0_FE_Msk       (0x2UL)                   /*!< TC0MCI0_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC0MCI1_RE_Pos       (2UL)                     /*!< TC0MCI1_RE (Bit 2)                                    */
#define MCPWM_CNTCON_TC0MCI1_RE_Msk       (0x4UL)                   /*!< TC0MCI1_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC0MCI1_FE_Pos       (3UL)                     /*!< TC0MCI1_FE (Bit 3)                                    */
#define MCPWM_CNTCON_TC0MCI1_FE_Msk       (0x8UL)                   /*!< TC0MCI1_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC0MCI2_RE_Pos       (4UL)                     /*!< TC0MCI2_RE (Bit 4)                                    */
#define MCPWM_CNTCON_TC0MCI2_RE_Msk       (0x10UL)                  /*!< TC0MCI2_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC0MCI2_FE_Pos       (5UL)                     /*!< TC0MCI2_FE (Bit 5)                                    */
#define MCPWM_CNTCON_TC0MCI2_FE_Msk       (0x20UL)                  /*!< TC0MCI2_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI0_RE_Pos       (6UL)                     /*!< TC1MCI0_RE (Bit 6)                                    */
#define MCPWM_CNTCON_TC1MCI0_RE_Msk       (0x40UL)                  /*!< TC1MCI0_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI0_FE_Pos       (7UL)                     /*!< TC1MCI0_FE (Bit 7)                                    */
#define MCPWM_CNTCON_TC1MCI0_FE_Msk       (0x80UL)                  /*!< TC1MCI0_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI1_RE_Pos       (8UL)                     /*!< TC1MCI1_RE (Bit 8)                                    */
#define MCPWM_CNTCON_TC1MCI1_RE_Msk       (0x100UL)                 /*!< TC1MCI1_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI1_FE_Pos       (9UL)                     /*!< TC1MCI1_FE (Bit 9)                                    */
#define MCPWM_CNTCON_TC1MCI1_FE_Msk       (0x200UL)                 /*!< TC1MCI1_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI2_RE_Pos       (10UL)                    /*!< TC1MCI2_RE (Bit 10)                                   */
#define MCPWM_CNTCON_TC1MCI2_RE_Msk       (0x400UL)                 /*!< TC1MCI2_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC1MCI2_FE_Pos       (11UL)                    /*!< TC1MCI2_FE (Bit 11)                                   */
#define MCPWM_CNTCON_TC1MCI2_FE_Msk       (0x800UL)                 /*!< TC1MCI2_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI0_RE_Pos       (12UL)                    /*!< TC2MCI0_RE (Bit 12)                                   */
#define MCPWM_CNTCON_TC2MCI0_RE_Msk       (0x1000UL)                /*!< TC2MCI0_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI0_FE_Pos       (13UL)                    /*!< TC2MCI0_FE (Bit 13)                                   */
#define MCPWM_CNTCON_TC2MCI0_FE_Msk       (0x2000UL)                /*!< TC2MCI0_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI1_RE_Pos       (14UL)                    /*!< TC2MCI1_RE (Bit 14)                                   */
#define MCPWM_CNTCON_TC2MCI1_RE_Msk       (0x4000UL)                /*!< TC2MCI1_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI1_FE_Pos       (15UL)                    /*!< TC2MCI1_FE (Bit 15)                                   */
#define MCPWM_CNTCON_TC2MCI1_FE_Msk       (0x8000UL)                /*!< TC2MCI1_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI2_RE_Pos       (16UL)                    /*!< TC2MCI2_RE (Bit 16)                                   */
#define MCPWM_CNTCON_TC2MCI2_RE_Msk       (0x10000UL)               /*!< TC2MCI2_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_TC2MCI2_FE_Pos       (17UL)                    /*!< TC2MCI2_FE (Bit 17)                                   */
#define MCPWM_CNTCON_TC2MCI2_FE_Msk       (0x20000UL)               /*!< TC2MCI2_FE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_CNTR0_Pos            (29UL)                    /*!< CNTR0 (Bit 29)                                        */
#define MCPWM_CNTCON_CNTR0_Msk            (0x20000000UL)            /*!< CNTR0 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CNTCON_CNTR1_Pos            (30UL)                    /*!< CNTR1 (Bit 30)                                        */
#define MCPWM_CNTCON_CNTR1_Msk            (0x40000000UL)            /*!< CNTR1 (Bitfield-Mask: 0x01)                           */
#define MCPWM_CNTCON_CNTR2_Pos            (31UL)                    /*!< CNTR2 (Bit 31)                                        */
#define MCPWM_CNTCON_CNTR2_Msk            (0x80000000UL)            /*!< CNTR2 (Bitfield-Mask: 0x01)                           */
/* ======================================================  CNTCON_SET  ======================================================= */
#define MCPWM_CNTCON_SET_TC0MCI0_RE_SET_Pos (0UL)                   /*!< TC0MCI0_RE_SET (Bit 0)                                */
#define MCPWM_CNTCON_SET_TC0MCI0_RE_SET_Msk (0x1UL)                 /*!< TC0MCI0_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC0MCI0_FE_SET_Pos (1UL)                   /*!< TC0MCI0_FE_SET (Bit 1)                                */
#define MCPWM_CNTCON_SET_TC0MCI0_FE_SET_Msk (0x2UL)                 /*!< TC0MCI0_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC0MCI1_RE_SET_Pos (2UL)                   /*!< TC0MCI1_RE_SET (Bit 2)                                */
#define MCPWM_CNTCON_SET_TC0MCI1_RE_SET_Msk (0x4UL)                 /*!< TC0MCI1_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC0MCI1_FE_SET_Pos (3UL)                   /*!< TC0MCI1_FE_SET (Bit 3)                                */
#define MCPWM_CNTCON_SET_TC0MCI1_FE_SET_Msk (0x8UL)                 /*!< TC0MCI1_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC0MCI2_RE_SET_Pos (4UL)                   /*!< TC0MCI2_RE_SET (Bit 4)                                */
#define MCPWM_CNTCON_SET_TC0MCI2_RE_SET_Msk (0x10UL)                /*!< TC0MCI2_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC0MCI2_FE_SET_Pos (5UL)                   /*!< TC0MCI2_FE_SET (Bit 5)                                */
#define MCPWM_CNTCON_SET_TC0MCI2_FE_SET_Msk (0x20UL)                /*!< TC0MCI2_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI0_RE_SET_Pos (6UL)                   /*!< TC1MCI0_RE_SET (Bit 6)                                */
#define MCPWM_CNTCON_SET_TC1MCI0_RE_SET_Msk (0x40UL)                /*!< TC1MCI0_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI0_FE_SET_Pos (7UL)                   /*!< TC1MCI0_FE_SET (Bit 7)                                */
#define MCPWM_CNTCON_SET_TC1MCI0_FE_SET_Msk (0x80UL)                /*!< TC1MCI0_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI1_RE_SET_Pos (8UL)                   /*!< TC1MCI1_RE_SET (Bit 8)                                */
#define MCPWM_CNTCON_SET_TC1MCI1_RE_SET_Msk (0x100UL)               /*!< TC1MCI1_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI1_FE_SET_Pos (9UL)                   /*!< TC1MCI1_FE_SET (Bit 9)                                */
#define MCPWM_CNTCON_SET_TC1MCI1_FE_SET_Msk (0x200UL)               /*!< TC1MCI1_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI2_RE_SET_Pos (10UL)                  /*!< TC1MCI2_RE_SET (Bit 10)                               */
#define MCPWM_CNTCON_SET_TC1MCI2_RE_SET_Msk (0x400UL)               /*!< TC1MCI2_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC1MCI2_FE_SET_Pos (11UL)                  /*!< TC1MCI2_FE_SET (Bit 11)                               */
#define MCPWM_CNTCON_SET_TC1MCI2_FE_SET_Msk (0x800UL)               /*!< TC1MCI2_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI0_RE_SET_Pos (12UL)                  /*!< TC2MCI0_RE_SET (Bit 12)                               */
#define MCPWM_CNTCON_SET_TC2MCI0_RE_SET_Msk (0x1000UL)              /*!< TC2MCI0_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI0_FE_SET_Pos (13UL)                  /*!< TC2MCI0_FE_SET (Bit 13)                               */
#define MCPWM_CNTCON_SET_TC2MCI0_FE_SET_Msk (0x2000UL)              /*!< TC2MCI0_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI1_RE_SET_Pos (14UL)                  /*!< TC2MCI1_RE_SET (Bit 14)                               */
#define MCPWM_CNTCON_SET_TC2MCI1_RE_SET_Msk (0x4000UL)              /*!< TC2MCI1_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI1_FE_SET_Pos (15UL)                  /*!< TC2MCI1_FE_SET (Bit 15)                               */
#define MCPWM_CNTCON_SET_TC2MCI1_FE_SET_Msk (0x8000UL)              /*!< TC2MCI1_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI2_RE_SET_Pos (16UL)                  /*!< TC2MCI2_RE_SET (Bit 16)                               */
#define MCPWM_CNTCON_SET_TC2MCI2_RE_SET_Msk (0x10000UL)             /*!< TC2MCI2_RE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_TC2MCI2_FE_SET_Pos (17UL)                  /*!< TC2MCI2_FE_SET (Bit 17)                               */
#define MCPWM_CNTCON_SET_TC2MCI2_FE_SET_Msk (0x20000UL)             /*!< TC2MCI2_FE_SET (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_SET_CNTR0_SET_Pos    (29UL)                    /*!< CNTR0_SET (Bit 29)                                    */
#define MCPWM_CNTCON_SET_CNTR0_SET_Msk    (0x20000000UL)            /*!< CNTR0_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_CNTCON_SET_CNTR1_SET_Pos    (30UL)                    /*!< CNTR1_SET (Bit 30)                                    */
#define MCPWM_CNTCON_SET_CNTR1_SET_Msk    (0x40000000UL)            /*!< CNTR1_SET (Bitfield-Mask: 0x01)                       */
#define MCPWM_CNTCON_SET_CNTR2_SET_Pos    (31UL)                    /*!< CNTR2_SET (Bit 31)                                    */
#define MCPWM_CNTCON_SET_CNTR2_SET_Msk    (0x80000000UL)            /*!< CNTR2_SET (Bitfield-Mask: 0x01)                       */
/* ======================================================  CNTCON_CLR  ======================================================= */
#define MCPWM_CNTCON_CLR_TC0MCI0_RE_CLR_Pos (0UL)                   /*!< TC0MCI0_RE_CLR (Bit 0)                                */
#define MCPWM_CNTCON_CLR_TC0MCI0_RE_CLR_Msk (0x1UL)                 /*!< TC0MCI0_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC0MCI0_FE_CLR_Pos (1UL)                   /*!< TC0MCI0_FE_CLR (Bit 1)                                */
#define MCPWM_CNTCON_CLR_TC0MCI0_FE_CLR_Msk (0x2UL)                 /*!< TC0MCI0_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC0MCI1_RE_CLR_Pos (2UL)                   /*!< TC0MCI1_RE_CLR (Bit 2)                                */
#define MCPWM_CNTCON_CLR_TC0MCI1_RE_CLR_Msk (0x4UL)                 /*!< TC0MCI1_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC0MCI1_FE_CLR_Pos (3UL)                   /*!< TC0MCI1_FE_CLR (Bit 3)                                */
#define MCPWM_CNTCON_CLR_TC0MCI1_FE_CLR_Msk (0x8UL)                 /*!< TC0MCI1_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC0MCI2_RE_Pos   (4UL)                     /*!< TC0MCI2_RE (Bit 4)                                    */
#define MCPWM_CNTCON_CLR_TC0MCI2_RE_Msk   (0x10UL)                  /*!< TC0MCI2_RE (Bitfield-Mask: 0x01)                      */
#define MCPWM_CNTCON_CLR_TC0MCI2_FE_CLR_Pos (5UL)                   /*!< TC0MCI2_FE_CLR (Bit 5)                                */
#define MCPWM_CNTCON_CLR_TC0MCI2_FE_CLR_Msk (0x20UL)                /*!< TC0MCI2_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI0_RE_CLR_Pos (6UL)                   /*!< TC1MCI0_RE_CLR (Bit 6)                                */
#define MCPWM_CNTCON_CLR_TC1MCI0_RE_CLR_Msk (0x40UL)                /*!< TC1MCI0_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI0_FE_CLR_Pos (7UL)                   /*!< TC1MCI0_FE_CLR (Bit 7)                                */
#define MCPWM_CNTCON_CLR_TC1MCI0_FE_CLR_Msk (0x80UL)                /*!< TC1MCI0_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI1_RE_CLR_Pos (8UL)                   /*!< TC1MCI1_RE_CLR (Bit 8)                                */
#define MCPWM_CNTCON_CLR_TC1MCI1_RE_CLR_Msk (0x100UL)               /*!< TC1MCI1_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI1_FE_CLR_Pos (9UL)                   /*!< TC1MCI1_FE_CLR (Bit 9)                                */
#define MCPWM_CNTCON_CLR_TC1MCI1_FE_CLR_Msk (0x200UL)               /*!< TC1MCI1_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI2_RE_CLR_Pos (10UL)                  /*!< TC1MCI2_RE_CLR (Bit 10)                               */
#define MCPWM_CNTCON_CLR_TC1MCI2_RE_CLR_Msk (0x400UL)               /*!< TC1MCI2_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC1MCI2_FE_CLR_Pos (11UL)                  /*!< TC1MCI2_FE_CLR (Bit 11)                               */
#define MCPWM_CNTCON_CLR_TC1MCI2_FE_CLR_Msk (0x800UL)               /*!< TC1MCI2_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI0_RE_CLR_Pos (12UL)                  /*!< TC2MCI0_RE_CLR (Bit 12)                               */
#define MCPWM_CNTCON_CLR_TC2MCI0_RE_CLR_Msk (0x1000UL)              /*!< TC2MCI0_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI0_FE_CLR_Pos (13UL)                  /*!< TC2MCI0_FE_CLR (Bit 13)                               */
#define MCPWM_CNTCON_CLR_TC2MCI0_FE_CLR_Msk (0x2000UL)              /*!< TC2MCI0_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI1_RE_CLR_Pos (14UL)                  /*!< TC2MCI1_RE_CLR (Bit 14)                               */
#define MCPWM_CNTCON_CLR_TC2MCI1_RE_CLR_Msk (0x4000UL)              /*!< TC2MCI1_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI1_FE_CLR_Pos (15UL)                  /*!< TC2MCI1_FE_CLR (Bit 15)                               */
#define MCPWM_CNTCON_CLR_TC2MCI1_FE_CLR_Msk (0x8000UL)              /*!< TC2MCI1_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI2_RE_CLR_Pos (16UL)                  /*!< TC2MCI2_RE_CLR (Bit 16)                               */
#define MCPWM_CNTCON_CLR_TC2MCI2_RE_CLR_Msk (0x10000UL)             /*!< TC2MCI2_RE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_TC2MCI2_FE_CLR_Pos (17UL)                  /*!< TC2MCI2_FE_CLR (Bit 17)                               */
#define MCPWM_CNTCON_CLR_TC2MCI2_FE_CLR_Msk (0x20000UL)             /*!< TC2MCI2_FE_CLR (Bitfield-Mask: 0x01)                  */
#define MCPWM_CNTCON_CLR_CNTR0_CLR_Pos    (29UL)                    /*!< CNTR0_CLR (Bit 29)                                    */
#define MCPWM_CNTCON_CLR_CNTR0_CLR_Msk    (0x20000000UL)            /*!< CNTR0_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CNTCON_CLR_CNTR1_CLR_Pos    (30UL)                    /*!< CNTR1_CLR (Bit 30)                                    */
#define MCPWM_CNTCON_CLR_CNTR1_CLR_Msk    (0x40000000UL)            /*!< CNTR1_CLR (Bitfield-Mask: 0x01)                       */
#define MCPWM_CNTCON_CLR_CNTR2_CLR_Pos    (31UL)                    /*!< CNTR2_CLR (Bit 31)                                    */
#define MCPWM_CNTCON_CLR_CNTR2_CLR_Msk    (0x80000000UL)            /*!< CNTR2_CLR (Bitfield-Mask: 0x01)                       */
/* ========================================================  CAP_CLR  ======================================================== */
#define MCPWM_CAP_CLR_CAP_CLR0_Pos        (0UL)                     /*!< CAP_CLR0 (Bit 0)                                      */
#define MCPWM_CAP_CLR_CAP_CLR0_Msk        (0x1UL)                   /*!< CAP_CLR0 (Bitfield-Mask: 0x01)                        */
#define MCPWM_CAP_CLR_CAP_CLR1_Pos        (1UL)                     /*!< CAP_CLR1 (Bit 1)                                      */
#define MCPWM_CAP_CLR_CAP_CLR1_Msk        (0x2UL)                   /*!< CAP_CLR1 (Bitfield-Mask: 0x01)                        */
#define MCPWM_CAP_CLR_CAP_CLR2_Pos        (2UL)                     /*!< CAP_CLR2 (Bit 2)                                      */
#define MCPWM_CAP_CLR_CAP_CLR2_Msk        (0x4UL)                   /*!< CAP_CLR2 (Bitfield-Mask: 0x01)                        */


/* =========================================================================================================================== */
/* ================                                          LPC_QEI                                          ================ */
/* =========================================================================================================================== */

