lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ==========================================================  CON  ========================================================== */
#define QEI_CON_RESP_Pos                  (0UL)                     /*!< RESP (Bit 0)                                          */
#define QEI_CON_RESP_Msk                  (0x1UL)                   /*!< RESP (Bitfield-Mask: 0x01)                            */
#define QEI_CON_RESPI_Pos                 (1UL)                     /*!< RESPI (Bit 1)                                         */
#define QEI_CON_RESPI_Msk                 (0x2UL)                   /*!< RESPI (Bitfield-Mask: 0x01)                           */
#define QEI_CON_RESV_Pos                  (2UL)                     /*!< RESV (Bit 2)                                          */
#define QEI_CON_RESV_Msk                  (0x4UL)                   /*!< RESV (Bitfield-Mask: 0x01)                            */
#define QEI_CON_RESI_Pos                  (3UL)                     /*!< RESI (Bit 3)                                          */
#define QEI_CON_RESI_Msk                  (0x8UL)                   /*!< RESI (Bitfield-Mask: 0x01)                            */
/* =========================================================  CONF  ========================================================== */
#define QEI_CONF_DIRINV_Pos               (0UL)                     /*!< DIRINV (Bit 0)                                        */
#define QEI_CONF_DIRINV_Msk               (0x1UL)                   /*!< DIRINV (Bitfield-Mask: 0x01)                          */
#define QEI_CONF_SIGMODE_Pos              (1UL)                     /*!< SIGMODE (Bit 1)                                       */
#define QEI_CONF_SIGMODE_Msk              (0x2UL)                   /*!< SIGMODE (Bitfield-Mask: 0x01)                         */
#define QEI_CONF_CAPMODE_Pos              (2UL)                     /*!< CAPMODE (Bit 2)                                       */
#define QEI_CONF_CAPMODE_Msk              (0x4UL)                   /*!< CAPMODE (Bitfield-Mask: 0x01)                         */
#define QEI_CONF_INVINX_Pos               (3UL)                     /*!< INVINX (Bit 3)                                        */
#define QEI_CONF_INVINX_Msk               (0x8UL)                   /*!< INVINX (Bitfield-Mask: 0x01)                          */
#define QEI_CONF_CRESPI_Pos               (4UL)                     /*!< CRESPI (Bit 4)                                        */
#define QEI_CONF_CRESPI_Msk               (0x10UL)                  /*!< CRESPI (Bitfield-Mask: 0x01)                          */
#define QEI_CONF_INXGATE_Pos              (16UL)                    /*!< INXGATE (Bit 16)                                      */
#define QEI_CONF_INXGATE_Msk              (0xf0000UL)               /*!< INXGATE (Bitfield-Mask: 0x0f)                         */
/* =========================================================  STAT  ========================================================== */
#define QEI_STAT_DIR_Pos                  (0UL)                     /*!< DIR (Bit 0)                                           */
#define QEI_STAT_DIR_Msk                  (0x1UL)                   /*!< DIR (Bitfield-Mask: 0x01)                             */
/* ==========================================================  POS  ========================================================== */
#define QEI_POS_POS_Pos                   (0UL)                     /*!< POS (Bit 0)                                           */
#define QEI_POS_POS_Msk                   (0xffffffffUL)            /*!< POS (Bitfield-Mask: 0xffffffff)                       */
/* ========================================================  MAXPOS  ========================================================= */
#define QEI_MAXPOS_MAXPOS_Pos             (0UL)                     /*!< MAXPOS (Bit 0)                                        */
#define QEI_MAXPOS_MAXPOS_Msk             (0xffffffffUL)            /*!< MAXPOS (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  CMPOS0  ========================================================= */
#define QEI_CMPOS0_PCMP0_Pos              (0UL)                     /*!< PCMP0 (Bit 0)                                         */
#define QEI_CMPOS0_PCMP0_Msk              (0xffffffffUL)            /*!< PCMP0 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CMPOS1  ========================================================= */
#define QEI_CMPOS1_PCMP1_Pos              (0UL)                     /*!< PCMP1 (Bit 0)                                         */
#define QEI_CMPOS1_PCMP1_Msk              (0xffffffffUL)            /*!< PCMP1 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CMPOS2  ========================================================= */
#define QEI_CMPOS2_PCMP2_Pos              (0UL)                     /*!< PCMP2 (Bit 0)                                         */
#define QEI_CMPOS2_PCMP2_Msk              (0xffffffffUL)            /*!< PCMP2 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  INXCNT  ========================================================= */
#define QEI_INXCNT_ENCPOS_Pos             (0UL)                     /*!< ENCPOS (Bit 0)                                        */
#define QEI_INXCNT_ENCPOS_Msk             (0xffffffffUL)            /*!< ENCPOS (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  INXCMP0  ======================================================== */
#define QEI_INXCMP0_ICMP0_Pos             (0UL)                     /*!< ICMP0 (Bit 0)                                         */
#define QEI_INXCMP0_ICMP0_Msk             (0xffffffffUL)            /*!< ICMP0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  LOAD  ========================================================== */
#define QEI_LOAD_VELLOAD_Pos              (0UL)                     /*!< VELLOAD (Bit 0)                                       */
#define QEI_LOAD_VELLOAD_Msk              (0xffffffffUL)            /*!< VELLOAD (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TIME  ========================================================== */
#define QEI_TIME_VELVAL_Pos               (0UL)                     /*!< VELVAL (Bit 0)                                        */
#define QEI_TIME_VELVAL_Msk               (0xffffffffUL)            /*!< VELVAL (Bitfield-Mask: 0xffffffff)                    */
/* ==========================================================  VEL  ========================================================== */
#define QEI_VEL_VELPC_Pos                 (0UL)                     /*!< VELPC (Bit 0)                                         */
#define QEI_VEL_VELPC_Msk                 (0xffffffffUL)            /*!< VELPC (Bitfield-Mask: 0xffffffff)                     */
/* ==========================================================  CAP  ========================================================== */
#define QEI_CAP_VELCAP_Pos                (0UL)                     /*!< VELCAP (Bit 0)                                        */
#define QEI_CAP_VELCAP_Msk                (0xffffffffUL)            /*!< VELCAP (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  VELCOMP  ======================================================== */
#define QEI_VELCOMP_VELPC_Pos             (0UL)                     /*!< VELPC (Bit 0)                                         */
#define QEI_VELCOMP_VELPC_Msk             (0xffffffffUL)            /*!< VELPC (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  FILTER  ========================================================= */
#define QEI_FILTER_FILTA_Pos              (0UL)                     /*!< FILTA (Bit 0)                                         */
#define QEI_FILTER_FILTA_Msk              (0xffffffffUL)            /*!< FILTA (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  INTSTAT  ======================================================== */
#define QEI_INTSTAT_INX_INT_Pos           (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_INTSTAT_INX_INT_Msk           (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_INTSTAT_TIM_INT_Pos           (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_INTSTAT_TIM_INT_Msk           (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_INTSTAT_VELC_INT_Pos          (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_INTSTAT_VELC_INT_Msk          (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_DIR_INT_Pos           (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_INTSTAT_DIR_INT_Msk           (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_INTSTAT_ERR_INT_Pos           (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_INTSTAT_ERR_INT_Msk           (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_INTSTAT_ENCLK_INT_Pos         (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_INTSTAT_ENCLK_INT_Msk         (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_INTSTAT_POS0_INT_Pos          (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_INTSTAT_POS0_INT_Msk          (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_POS1_INT_Pos          (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_INTSTAT_POS1_INT_Msk          (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_POS2_INT_Pos          (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_INTSTAT_POS2_INT_Msk          (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_REV0_INT_Pos          (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_INTSTAT_REV0_INT_Msk          (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_POS0REV_INT_Pos       (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_INTSTAT_POS0REV_INT_Msk       (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_INTSTAT_POS1REV_INT_Pos       (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_INTSTAT_POS1REV_INT_Msk       (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_INTSTAT_POS2REV_INT_Pos       (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_INTSTAT_POS2REV_INT_Msk       (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_INTSTAT_REV1_INT_Pos          (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_INTSTAT_REV1_INT_Msk          (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_REV2_INT_Pos          (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_INTSTAT_REV2_INT_Msk          (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_INTSTAT_MAXPOS_INT_Pos        (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_INTSTAT_MAXPOS_INT_Msk        (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */
/* ==========================================================  SET  ========================================================== */
#define QEI_SET_INX_INT_Pos               (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_SET_INX_INT_Msk               (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_SET_TIM_INT_Pos               (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_SET_TIM_INT_Msk               (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_SET_VELC_INT_Pos              (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_SET_VELC_INT_Msk              (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_DIR_INT_Pos               (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_SET_DIR_INT_Msk               (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_SET_ERR_INT_Pos               (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_SET_ERR_INT_Msk               (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_SET_ENCLK_INT_Pos             (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_SET_ENCLK_INT_Msk             (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_SET_POS0_INT_Pos              (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_SET_POS0_INT_Msk              (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_POS1_INT_Pos              (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_SET_POS1_INT_Msk              (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_POS2_INT_Pos              (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_SET_POS2_INT_Msk              (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_REV0_INT_Pos              (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_SET_REV0_INT_Msk              (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_POS0REV_INT_Pos           (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_SET_POS0REV_INT_Msk           (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_SET_POS1REV_INT_Pos           (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_SET_POS1REV_INT_Msk           (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_SET_POS2REV_INT_Pos           (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_SET_POS2REV_INT_Msk           (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_SET_REV1_INT_Pos              (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_SET_REV1_INT_Msk              (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_REV2_INT_Pos              (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_SET_REV2_INT_Msk              (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_SET_MAXPOS_INT_Pos            (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_SET_MAXPOS_INT_Msk            (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */
/* ==========================================================  CLR  ========================================================== */
#define QEI_CLR_INX_INT_Pos               (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_CLR_INX_INT_Msk               (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_CLR_TIM_INT_Pos               (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_CLR_TIM_INT_Msk               (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_CLR_VELC_INT_Pos              (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_CLR_VELC_INT_Msk              (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_DIR_INT_Pos               (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_CLR_DIR_INT_Msk               (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_CLR_ERR_INT_Pos               (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_CLR_ERR_INT_Msk               (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_CLR_ENCLK_INT_Pos             (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_CLR_ENCLK_INT_Msk             (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_CLR_POS0_INT_Pos              (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_CLR_POS0_INT_Msk              (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_POS1_INT_Pos              (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_CLR_POS1_INT_Msk              (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_POS2_INT_Pos              (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_CLR_POS2_INT_Msk              (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_REV0_INT_Pos              (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_CLR_REV0_INT_Msk              (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_POS0REV_INT_Pos           (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_CLR_POS0REV_INT_Msk           (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_CLR_POS1REV_INT_Pos           (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_CLR_POS1REV_INT_Msk           (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_CLR_POS2REV_INT_Pos           (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_CLR_POS2REV_INT_Msk           (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_CLR_REV1_INT_Pos              (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_CLR_REV1_INT_Msk              (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_REV2_INT_Pos              (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_CLR_REV2_INT_Msk              (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_CLR_MAXPOS_INT_Pos            (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_CLR_MAXPOS_INT_Msk            (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */
/* ==========================================================  IE  =========================================================== */
#define QEI_IE_INX_INT_Pos                (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_IE_INX_INT_Msk                (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IE_TIM_INT_Pos                (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_IE_TIM_INT_Msk                (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IE_VELC_INT_Pos               (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_IE_VELC_INT_Msk               (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_DIR_INT_Pos                (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_IE_DIR_INT_Msk                (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IE_ERR_INT_Pos                (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_IE_ERR_INT_Msk                (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IE_ENCLK_INT_Pos              (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_IE_ENCLK_INT_Msk              (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_IE_POS0_INT_Pos               (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_IE_POS0_INT_Msk               (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_POS1_INT_Pos               (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_IE_POS1_INT_Msk               (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_POS2_INT_Pos               (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_IE_POS2_INT_Msk               (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_REV0_INT_Pos               (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_IE_REV0_INT_Msk               (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
