lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define QEI_IE_POS0REV_INT_Pos            (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_IE_POS0REV_INT_Msk            (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IE_POS1REV_INT_Pos            (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_IE_POS1REV_INT_Msk            (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IE_POS2REV_INT_Pos            (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_IE_POS2REV_INT_Msk            (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IE_REV1_INT_Pos               (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_IE_REV1_INT_Msk               (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_REV2_INT_Pos               (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_IE_REV2_INT_Msk               (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IE_MAXPOS_INT_Pos             (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_IE_MAXPOS_INT_Msk             (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */
/* ==========================================================  IES  ========================================================== */
#define QEI_IES_INX_INT_Pos               (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_IES_INX_INT_Msk               (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IES_TIM_INT_Pos               (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_IES_TIM_INT_Msk               (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IES_VELC_INT_Pos              (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_IES_VELC_INT_Msk              (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_DIR_INT_Pos               (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_IES_DIR_INT_Msk               (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IES_ERR_INT_Pos               (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_IES_ERR_INT_Msk               (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IES_ENCLK_INT_Pos             (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_IES_ENCLK_INT_Msk             (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_IES_POS0_INT_Pos              (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_IES_POS0_INT_Msk              (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_POS1_INT_Pos              (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_IES_POS1_INT_Msk              (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_POS2_INT_Pos              (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_IES_POS2_INT_Msk              (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_REV0_INT_Pos              (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_IES_REV0_INT_Msk              (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_POS0REV_INT_Pos           (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_IES_POS0REV_INT_Msk           (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IES_POS1REV_INT_Pos           (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_IES_POS1REV_INT_Msk           (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IES_POS2REV_INT_Pos           (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_IES_POS2REV_INT_Msk           (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IES_REV1_INT_Pos              (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_IES_REV1_INT_Msk              (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_REV2_INT_Pos              (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_IES_REV2_INT_Msk              (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IES_MAXPOS_INT_Pos            (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_IES_MAXPOS_INT_Msk            (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */
/* ==========================================================  IEC  ========================================================== */
#define QEI_IEC_INX_INT_Pos               (0UL)                     /*!< INX_INT (Bit 0)                                       */
#define QEI_IEC_INX_INT_Msk               (0x1UL)                   /*!< INX_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IEC_TIM_INT_Pos               (1UL)                     /*!< TIM_INT (Bit 1)                                       */
#define QEI_IEC_TIM_INT_Msk               (0x2UL)                   /*!< TIM_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IEC_VELC_INT_Pos              (2UL)                     /*!< VELC_INT (Bit 2)                                      */
#define QEI_IEC_VELC_INT_Msk              (0x4UL)                   /*!< VELC_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_DIR_INT_Pos               (3UL)                     /*!< DIR_INT (Bit 3)                                       */
#define QEI_IEC_DIR_INT_Msk               (0x8UL)                   /*!< DIR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IEC_ERR_INT_Pos               (4UL)                     /*!< ERR_INT (Bit 4)                                       */
#define QEI_IEC_ERR_INT_Msk               (0x10UL)                  /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
#define QEI_IEC_ENCLK_INT_Pos             (5UL)                     /*!< ENCLK_INT (Bit 5)                                     */
#define QEI_IEC_ENCLK_INT_Msk             (0x20UL)                  /*!< ENCLK_INT (Bitfield-Mask: 0x01)                       */
#define QEI_IEC_POS0_INT_Pos              (6UL)                     /*!< POS0_INT (Bit 6)                                      */
#define QEI_IEC_POS0_INT_Msk              (0x40UL)                  /*!< POS0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_POS1_INT_Pos              (7UL)                     /*!< POS1_INT (Bit 7)                                      */
#define QEI_IEC_POS1_INT_Msk              (0x80UL)                  /*!< POS1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_POS2_INT_Pos              (8UL)                     /*!< POS2_INT (Bit 8)                                      */
#define QEI_IEC_POS2_INT_Msk              (0x100UL)                 /*!< POS2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_REV0_INT_Pos              (9UL)                     /*!< REV0_INT (Bit 9)                                      */
#define QEI_IEC_REV0_INT_Msk              (0x200UL)                 /*!< REV0_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_POS0REV_INT_Pos           (10UL)                    /*!< POS0REV_INT (Bit 10)                                  */
#define QEI_IEC_POS0REV_INT_Msk           (0x400UL)                 /*!< POS0REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IEC_POS1REV_INT_Pos           (11UL)                    /*!< POS1REV_INT (Bit 11)                                  */
#define QEI_IEC_POS1REV_INT_Msk           (0x800UL)                 /*!< POS1REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IEC_POS2REV_INT_Pos           (12UL)                    /*!< POS2REV_INT (Bit 12)                                  */
#define QEI_IEC_POS2REV_INT_Msk           (0x1000UL)                /*!< POS2REV_INT (Bitfield-Mask: 0x01)                     */
#define QEI_IEC_REV1_INT_Pos              (13UL)                    /*!< REV1_INT (Bit 13)                                     */
#define QEI_IEC_REV1_INT_Msk              (0x2000UL)                /*!< REV1_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_REV2_INT_Pos              (14UL)                    /*!< REV2_INT (Bit 14)                                     */
#define QEI_IEC_REV2_INT_Msk              (0x4000UL)                /*!< REV2_INT (Bitfield-Mask: 0x01)                        */
#define QEI_IEC_MAXPOS_INT_Pos            (15UL)                    /*!< MAXPOS_INT (Bit 15)                                   */
#define QEI_IEC_MAXPOS_INT_Msk            (0x8000UL)                /*!< MAXPOS_INT (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                        LPC_SYSCON                                         ================ */
/* =========================================================================================================================== */

