lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* =======================================================  FLASHCFG  ======================================================== */
#define SYSCON_FLASHCFG_FLASHTIM_Pos      (12UL)                    /*!< FLASHTIM (Bit 12)                                     */
#define SYSCON_FLASHCFG_FLASHTIM_Msk      (0xf000UL)                /*!< FLASHTIM (Bitfield-Mask: 0x0f)                        */
/* ========================================================  PLL0CON  ======================================================== */
#define SYSCON_PLL0CON_PLLE0_Pos          (0UL)                     /*!< PLLE0 (Bit 0)                                         */
#define SYSCON_PLL0CON_PLLE0_Msk          (0x1UL)                   /*!< PLLE0 (Bitfield-Mask: 0x01)                           */
#define SYSCON_PLL0CON_PLLC0_Pos          (1UL)                     /*!< PLLC0 (Bit 1)                                         */
#define SYSCON_PLL0CON_PLLC0_Msk          (0x2UL)                   /*!< PLLC0 (Bitfield-Mask: 0x01)                           */
/* ========================================================  PLL0CFG  ======================================================== */
#define SYSCON_PLL0CFG_MSEL0_Pos          (0UL)                     /*!< MSEL0 (Bit 0)                                         */
#define SYSCON_PLL0CFG_MSEL0_Msk          (0x7fffUL)                /*!< MSEL0 (Bitfield-Mask: 0x7fff)                         */
#define SYSCON_PLL0CFG_NSEL0_Pos          (16UL)                    /*!< NSEL0 (Bit 16)                                        */
#define SYSCON_PLL0CFG_NSEL0_Msk          (0xff0000UL)              /*!< NSEL0 (Bitfield-Mask: 0xff)                           */
/* =======================================================  PLL0STAT  ======================================================== */
#define SYSCON_PLL0STAT_MSEL0_Pos         (0UL)                     /*!< MSEL0 (Bit 0)                                         */
#define SYSCON_PLL0STAT_MSEL0_Msk         (0x7fffUL)                /*!< MSEL0 (Bitfield-Mask: 0x7fff)                         */
#define SYSCON_PLL0STAT_NSEL0_Pos         (16UL)                    /*!< NSEL0 (Bit 16)                                        */
#define SYSCON_PLL0STAT_NSEL0_Msk         (0xff0000UL)              /*!< NSEL0 (Bitfield-Mask: 0xff)                           */
#define SYSCON_PLL0STAT_PLLE0_STAT_Pos    (24UL)                    /*!< PLLE0_STAT (Bit 24)                                   */
#define SYSCON_PLL0STAT_PLLE0_STAT_Msk    (0x1000000UL)             /*!< PLLE0_STAT (Bitfield-Mask: 0x01)                      */
#define SYSCON_PLL0STAT_PLLC0_STAT_Pos    (25UL)                    /*!< PLLC0_STAT (Bit 25)                                   */
#define SYSCON_PLL0STAT_PLLC0_STAT_Msk    (0x2000000UL)             /*!< PLLC0_STAT (Bitfield-Mask: 0x01)                      */
#define SYSCON_PLL0STAT_PLOCK0_Pos        (26UL)                    /*!< PLOCK0 (Bit 26)                                       */
#define SYSCON_PLL0STAT_PLOCK0_Msk        (0x4000000UL)             /*!< PLOCK0 (Bitfield-Mask: 0x01)                          */
/* =======================================================  PLL0FEED  ======================================================== */
#define SYSCON_PLL0FEED_PLL0FEED_Pos      (0UL)                     /*!< PLL0FEED (Bit 0)                                      */
#define SYSCON_PLL0FEED_PLL0FEED_Msk      (0xffUL)                  /*!< PLL0FEED (Bitfield-Mask: 0xff)                        */
/* ========================================================  PLL1CON  ======================================================== */
#define SYSCON_PLL1CON_PLLE1_Pos          (0UL)                     /*!< PLLE1 (Bit 0)                                         */
#define SYSCON_PLL1CON_PLLE1_Msk          (0x1UL)                   /*!< PLLE1 (Bitfield-Mask: 0x01)                           */
#define SYSCON_PLL1CON_PLLC1_Pos          (1UL)                     /*!< PLLC1 (Bit 1)                                         */
#define SYSCON_PLL1CON_PLLC1_Msk          (0x2UL)                   /*!< PLLC1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  PLL1CFG  ======================================================== */
#define SYSCON_PLL1CFG_MSEL1_Pos          (0UL)                     /*!< MSEL1 (Bit 0)                                         */
#define SYSCON_PLL1CFG_MSEL1_Msk          (0x1fUL)                  /*!< MSEL1 (Bitfield-Mask: 0x1f)                           */
#define SYSCON_PLL1CFG_PSEL1_Pos          (5UL)                     /*!< PSEL1 (Bit 5)                                         */
#define SYSCON_PLL1CFG_PSEL1_Msk          (0x60UL)                  /*!< PSEL1 (Bitfield-Mask: 0x03)                           */
/* =======================================================  PLL1STAT  ======================================================== */
#define SYSCON_PLL1STAT_MSEL1_Pos         (0UL)                     /*!< MSEL1 (Bit 0)                                         */
#define SYSCON_PLL1STAT_MSEL1_Msk         (0x1fUL)                  /*!< MSEL1 (Bitfield-Mask: 0x1f)                           */
#define SYSCON_PLL1STAT_PSEL1_Pos         (5UL)                     /*!< PSEL1 (Bit 5)                                         */
#define SYSCON_PLL1STAT_PSEL1_Msk         (0x60UL)                  /*!< PSEL1 (Bitfield-Mask: 0x03)                           */
#define SYSCON_PLL1STAT_PLLE1_STAT_Pos    (8UL)                     /*!< PLLE1_STAT (Bit 8)                                    */
#define SYSCON_PLL1STAT_PLLE1_STAT_Msk    (0x100UL)                 /*!< PLLE1_STAT (Bitfield-Mask: 0x01)                      */
#define SYSCON_PLL1STAT_PLLC1_STAT_Pos    (9UL)                     /*!< PLLC1_STAT (Bit 9)                                    */
#define SYSCON_PLL1STAT_PLLC1_STAT_Msk    (0x200UL)                 /*!< PLLC1_STAT (Bitfield-Mask: 0x01)                      */
#define SYSCON_PLL1STAT_PLOCK1_Pos        (10UL)                    /*!< PLOCK1 (Bit 10)                                       */
#define SYSCON_PLL1STAT_PLOCK1_Msk        (0x400UL)                 /*!< PLOCK1 (Bitfield-Mask: 0x01)                          */
/* =======================================================  PLL1FEED  ======================================================== */
#define SYSCON_PLL1FEED_PLL1FEED_Pos      (0UL)                     /*!< PLL1FEED (Bit 0)                                      */
#define SYSCON_PLL1FEED_PLL1FEED_Msk      (0xffUL)                  /*!< PLL1FEED (Bitfield-Mask: 0xff)                        */
/* =========================================================  PCON  ========================================================== */
#define SYSCON_PCON_PM0_Pos               (0UL)                     /*!< PM0 (Bit 0)                                           */
#define SYSCON_PCON_PM0_Msk               (0x1UL)                   /*!< PM0 (Bitfield-Mask: 0x01)                             */
#define SYSCON_PCON_PM1_Pos               (1UL)                     /*!< PM1 (Bit 1)                                           */
#define SYSCON_PCON_PM1_Msk               (0x2UL)                   /*!< PM1 (Bitfield-Mask: 0x01)                             */
#define SYSCON_PCON_BODRPM_Pos            (2UL)                     /*!< BODRPM (Bit 2)                                        */
#define SYSCON_PCON_BODRPM_Msk            (0x4UL)                   /*!< BODRPM (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCON_BOGD_Pos              (3UL)                     /*!< BOGD (Bit 3)                                          */
#define SYSCON_PCON_BOGD_Msk              (0x8UL)                   /*!< BOGD (Bitfield-Mask: 0x01)                            */
#define SYSCON_PCON_BORD_Pos              (4UL)                     /*!< BORD (Bit 4)                                          */
#define SYSCON_PCON_BORD_Msk              (0x10UL)                  /*!< BORD (Bitfield-Mask: 0x01)                            */
#define SYSCON_PCON_SMFLAG_Pos            (8UL)                     /*!< SMFLAG (Bit 8)                                        */
#define SYSCON_PCON_SMFLAG_Msk            (0x100UL)                 /*!< SMFLAG (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCON_DSFLAG_Pos            (9UL)                     /*!< DSFLAG (Bit 9)                                        */
#define SYSCON_PCON_DSFLAG_Msk            (0x200UL)                 /*!< DSFLAG (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCON_PDFLAG_Pos            (10UL)                    /*!< PDFLAG (Bit 10)                                       */
#define SYSCON_PCON_PDFLAG_Msk            (0x400UL)                 /*!< PDFLAG (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCON_DPDFLAG_Pos           (11UL)                    /*!< DPDFLAG (Bit 11)                                      */
#define SYSCON_PCON_DPDFLAG_Msk           (0x800UL)                 /*!< DPDFLAG (Bitfield-Mask: 0x01)                         */
/* =========================================================  PCONP  ========================================================= */
#define SYSCON_PCONP_PCTIM0_Pos           (1UL)                     /*!< PCTIM0 (Bit 1)                                        */
#define SYSCON_PCONP_PCTIM0_Msk           (0x2UL)                   /*!< PCTIM0 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCTIM1_Pos           (2UL)                     /*!< PCTIM1 (Bit 2)                                        */
#define SYSCON_PCONP_PCTIM1_Msk           (0x4UL)                   /*!< PCTIM1 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCUART0_Pos          (3UL)                     /*!< PCUART0 (Bit 3)                                       */
#define SYSCON_PCONP_PCUART0_Msk          (0x8UL)                   /*!< PCUART0 (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCUART1_Pos          (4UL)                     /*!< PCUART1 (Bit 4)                                       */
#define SYSCON_PCONP_PCUART1_Msk          (0x10UL)                  /*!< PCUART1 (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCPWM1_Pos           (6UL)                     /*!< PCPWM1 (Bit 6)                                        */
#define SYSCON_PCONP_PCPWM1_Msk           (0x40UL)                  /*!< PCPWM1 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCI2C0_Pos           (7UL)                     /*!< PCI2C0 (Bit 7)                                        */
#define SYSCON_PCONP_PCI2C0_Msk           (0x80UL)                  /*!< PCI2C0 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCSPI_Pos            (8UL)                     /*!< PCSPI (Bit 8)                                         */
#define SYSCON_PCONP_PCSPI_Msk            (0x100UL)                 /*!< PCSPI (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCRTC_Pos            (9UL)                     /*!< PCRTC (Bit 9)                                         */
#define SYSCON_PCONP_PCRTC_Msk            (0x200UL)                 /*!< PCRTC (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCSSP1_Pos           (10UL)                    /*!< PCSSP1 (Bit 10)                                       */
#define SYSCON_PCONP_PCSSP1_Msk           (0x400UL)                 /*!< PCSSP1 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCADC_Pos            (12UL)                    /*!< PCADC (Bit 12)                                        */
#define SYSCON_PCONP_PCADC_Msk            (0x1000UL)                /*!< PCADC (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCCAN1_Pos           (13UL)                    /*!< PCCAN1 (Bit 13)                                       */
#define SYSCON_PCONP_PCCAN1_Msk           (0x2000UL)                /*!< PCCAN1 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCCAN2_Pos           (14UL)                    /*!< PCCAN2 (Bit 14)                                       */
#define SYSCON_PCONP_PCCAN2_Msk           (0x4000UL)                /*!< PCCAN2 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCGPIO_Pos           (15UL)                    /*!< PCGPIO (Bit 15)                                       */
#define SYSCON_PCONP_PCGPIO_Msk           (0x8000UL)                /*!< PCGPIO (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCRIT_Pos            (16UL)                    /*!< PCRIT (Bit 16)                                        */
#define SYSCON_PCONP_PCRIT_Msk            (0x10000UL)               /*!< PCRIT (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCMCPWM_Pos          (17UL)                    /*!< PCMCPWM (Bit 17)                                      */
#define SYSCON_PCONP_PCMCPWM_Msk          (0x20000UL)               /*!< PCMCPWM (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCQEI_Pos            (18UL)                    /*!< PCQEI (Bit 18)                                        */
#define SYSCON_PCONP_PCQEI_Msk            (0x40000UL)               /*!< PCQEI (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCI2C1_Pos           (19UL)                    /*!< PCI2C1 (Bit 19)                                       */
#define SYSCON_PCONP_PCI2C1_Msk           (0x80000UL)               /*!< PCI2C1 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCSSP0_Pos           (21UL)                    /*!< PCSSP0 (Bit 21)                                       */
#define SYSCON_PCONP_PCSSP0_Msk           (0x200000UL)              /*!< PCSSP0 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCTIM2_Pos           (22UL)                    /*!< PCTIM2 (Bit 22)                                       */
#define SYSCON_PCONP_PCTIM2_Msk           (0x400000UL)              /*!< PCTIM2 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCTIM3_Pos           (23UL)                    /*!< PCTIM3 (Bit 23)                                       */
#define SYSCON_PCONP_PCTIM3_Msk           (0x800000UL)              /*!< PCTIM3 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCUART2_Pos          (24UL)                    /*!< PCUART2 (Bit 24)                                      */
#define SYSCON_PCONP_PCUART2_Msk          (0x1000000UL)             /*!< PCUART2 (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCUART3_Pos          (25UL)                    /*!< PCUART3 (Bit 25)                                      */
#define SYSCON_PCONP_PCUART3_Msk          (0x2000000UL)             /*!< PCUART3 (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCI2C2_Pos           (26UL)                    /*!< PCI2C2 (Bit 26)                                       */
#define SYSCON_PCONP_PCI2C2_Msk           (0x4000000UL)             /*!< PCI2C2 (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCI2S_Pos            (27UL)                    /*!< PCI2S (Bit 27)                                        */
#define SYSCON_PCONP_PCI2S_Msk            (0x8000000UL)             /*!< PCI2S (Bitfield-Mask: 0x01)                           */
#define SYSCON_PCONP_PCGPDMA_Pos          (29UL)                    /*!< PCGPDMA (Bit 29)                                      */
#define SYSCON_PCONP_PCGPDMA_Msk          (0x20000000UL)            /*!< PCGPDMA (Bitfield-Mask: 0x01)                         */
#define SYSCON_PCONP_PCENET_Pos           (30UL)                    /*!< PCENET (Bit 30)                                       */
#define SYSCON_PCONP_PCENET_Msk           (0x40000000UL)            /*!< PCENET (Bitfield-Mask: 0x01)                          */
#define SYSCON_PCONP_PCUSB_Pos            (31UL)                    /*!< PCUSB (Bit 31)                                        */
#define SYSCON_PCONP_PCUSB_Msk            (0x80000000UL)            /*!< PCUSB (Bitfield-Mask: 0x01)                           */
/* ========================================================  CCLKCFG  ======================================================== */
#define SYSCON_CCLKCFG_CCLKSEL_Pos        (0UL)                     /*!< CCLKSEL (Bit 0)                                       */
#define SYSCON_CCLKCFG_CCLKSEL_Msk        (0xffUL)                  /*!< CCLKSEL (Bitfield-Mask: 0xff)                         */
/* =======================================================  USBCLKCFG  ======================================================= */
#define SYSCON_USBCLKCFG_USBSEL_Pos       (0UL)                     /*!< USBSEL (Bit 0)                                        */
#define SYSCON_USBCLKCFG_USBSEL_Msk       (0xfUL)                   /*!< USBSEL (Bitfield-Mask: 0x0f)                          */
/* =======================================================  CLKSRCSEL  ======================================================= */
#define SYSCON_CLKSRCSEL_CLKSRC_Pos       (0UL)                     /*!< CLKSRC (Bit 0)                                        */
#define SYSCON_CLKSRCSEL_CLKSRC_Msk       (0x3UL)                   /*!< CLKSRC (Bitfield-Mask: 0x03)                          */
/* ======================================================  CANSLEEPCLR  ====================================================== */
#define SYSCON_CANSLEEPCLR_CAN1SLEEP_Pos  (1UL)                     /*!< CAN1SLEEP (Bit 1)                                     */
#define SYSCON_CANSLEEPCLR_CAN1SLEEP_Msk  (0x2UL)                   /*!< CAN1SLEEP (Bitfield-Mask: 0x01)                       */
#define SYSCON_CANSLEEPCLR_CAN2SLEEP_Pos  (2UL)                     /*!< CAN2SLEEP (Bit 2)                                     */
#define SYSCON_CANSLEEPCLR_CAN2SLEEP_Msk  (0x4UL)                   /*!< CAN2SLEEP (Bitfield-Mask: 0x01)                       */
/* =====================================================  CANWAKEFLAGS  ====================================================== */
#define SYSCON_CANWAKEFLAGS_CAN1WAKE_Pos  (1UL)                     /*!< CAN1WAKE (Bit 1)                                      */
#define SYSCON_CANWAKEFLAGS_CAN1WAKE_Msk  (0x2UL)                   /*!< CAN1WAKE (Bitfield-Mask: 0x01)                        */
#define SYSCON_CANWAKEFLAGS_CAN2WAKE_Pos  (2UL)                     /*!< CAN2WAKE (Bit 2)                                      */
#define SYSCON_CANWAKEFLAGS_CAN2WAKE_Msk  (0x4UL)                   /*!< CAN2WAKE (Bitfield-Mask: 0x01)                        */
/* ========================================================  EXTINT  ========================================================= */
#define SYSCON_EXTINT_EINT0_Pos           (0UL)                     /*!< EINT0 (Bit 0)                                         */
#define SYSCON_EXTINT_EINT0_Msk           (0x1UL)                   /*!< EINT0 (Bitfield-Mask: 0x01)                           */
#define SYSCON_EXTINT_EINT1_Pos           (1UL)                     /*!< EINT1 (Bit 1)                                         */
#define SYSCON_EXTINT_EINT1_Msk           (0x2UL)                   /*!< EINT1 (Bitfield-Mask: 0x01)                           */
#define SYSCON_EXTINT_EINT2_Pos           (2UL)                     /*!< EINT2 (Bit 2)                                         */
#define SYSCON_EXTINT_EINT2_Msk           (0x4UL)                   /*!< EINT2 (Bitfield-Mask: 0x01)                           */
#define SYSCON_EXTINT_EINT3_Pos           (3UL)                     /*!< EINT3 (Bit 3)                                         */
#define SYSCON_EXTINT_EINT3_Msk           (0x8UL)                   /*!< EINT3 (Bitfield-Mask: 0x01)                           */
/* ========================================================  EXTMODE  ======================================================== */
#define SYSCON_EXTMODE_EXTMODE0_Pos       (0UL)                     /*!< EXTMODE0 (Bit 0)                                      */
#define SYSCON_EXTMODE_EXTMODE0_Msk       (0x1UL)                   /*!< EXTMODE0 (Bitfield-Mask: 0x01)                        */
#define SYSCON_EXTMODE_EXTMODE1_Pos       (1UL)                     /*!< EXTMODE1 (Bit 1)                                      */
#define SYSCON_EXTMODE_EXTMODE1_Msk       (0x2UL)                   /*!< EXTMODE1 (Bitfield-Mask: 0x01)                        */
#define SYSCON_EXTMODE_EXTMODE2_Pos       (2UL)                     /*!< EXTMODE2 (Bit 2)                                      */
#define SYSCON_EXTMODE_EXTMODE2_Msk       (0x4UL)                   /*!< EXTMODE2 (Bitfield-Mask: 0x01)                        */
#define SYSCON_EXTMODE_EXTMODE3_Pos       (3UL)                     /*!< EXTMODE3 (Bit 3)                                      */
#define SYSCON_EXTMODE_EXTMODE3_Msk       (0x8UL)                   /*!< EXTMODE3 (Bitfield-Mask: 0x01)                        */
/* =======================================================  EXTPOLAR  ======================================================== */
#define SYSCON_EXTPOLAR_EXTPOLAR0_Pos     (0UL)                     /*!< EXTPOLAR0 (Bit 0)                                     */
#define SYSCON_EXTPOLAR_EXTPOLAR0_Msk     (0x1UL)                   /*!< EXTPOLAR0 (Bitfield-Mask: 0x01)                       */
#define SYSCON_EXTPOLAR_EXTPOLAR1_Pos     (1UL)                     /*!< EXTPOLAR1 (Bit 1)                                     */
#define SYSCON_EXTPOLAR_EXTPOLAR1_Msk     (0x2UL)                   /*!< EXTPOLAR1 (Bitfield-Mask: 0x01)                       */
#define SYSCON_EXTPOLAR_EXTPOLAR2_Pos     (2UL)                     /*!< EXTPOLAR2 (Bit 2)                                     */
#define SYSCON_EXTPOLAR_EXTPOLAR2_Msk     (0x4UL)                   /*!< EXTPOLAR2 (Bitfield-Mask: 0x01)                       */
#define SYSCON_EXTPOLAR_EXTPOLAR3_Pos     (3UL)                     /*!< EXTPOLAR3 (Bit 3)                                     */
#define SYSCON_EXTPOLAR_EXTPOLAR3_Msk     (0x8UL)                   /*!< EXTPOLAR3 (Bitfield-Mask: 0x01)                       */
/* =========================================================  RSID  ========================================================== */
#define SYSCON_RSID_POR_Pos               (0UL)                     /*!< POR (Bit 0)                                           */
#define SYSCON_RSID_POR_Msk               (0x1UL)                   /*!< POR (Bitfield-Mask: 0x01)                             */
#define SYSCON_RSID_EXTR_Pos              (1UL)                     /*!< EXTR (Bit 1)                                          */
#define SYSCON_RSID_EXTR_Msk              (0x2UL)                   /*!< EXTR (Bitfield-Mask: 0x01)                            */
#define SYSCON_RSID_WDTR_Pos              (2UL)                     /*!< WDTR (Bit 2)                                          */
#define SYSCON_RSID_WDTR_Msk              (0x4UL)                   /*!< WDTR (Bitfield-Mask: 0x01)                            */
#define SYSCON_RSID_BODR_Pos              (3UL)                     /*!< BODR (Bit 3)                                          */
#define SYSCON_RSID_BODR_Msk              (0x8UL)                   /*!< BODR (Bitfield-Mask: 0x01)                            */
/* ==========================================================  SCS  ========================================================== */
#define SYSCON_SCS_OSCRANGE_Pos           (4UL)                     /*!< OSCRANGE (Bit 4)                                      */
#define SYSCON_SCS_OSCRANGE_Msk           (0x10UL)                  /*!< OSCRANGE (Bitfield-Mask: 0x01)                        */
#define SYSCON_SCS_OSCEN_Pos              (5UL)                     /*!< OSCEN (Bit 5)                                         */
