lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define SYSCON_SCS_OSCEN_Msk              (0x20UL)                  /*!< OSCEN (Bitfield-Mask: 0x01)                           */
#define SYSCON_SCS_OSCSTAT_Pos            (6UL)                     /*!< OSCSTAT (Bit 6)                                       */
#define SYSCON_SCS_OSCSTAT_Msk            (0x40UL)                  /*!< OSCSTAT (Bitfield-Mask: 0x01)                         */
/* =======================================================  PCLKSEL0  ======================================================== */
#define SYSCON_PCLKSEL0_PCLK_WDT_Pos      (0UL)                     /*!< PCLK_WDT (Bit 0)                                      */
#define SYSCON_PCLKSEL0_PCLK_WDT_Msk      (0x3UL)                   /*!< PCLK_WDT (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL0_PCLK_TIMER0_Pos   (2UL)                     /*!< PCLK_TIMER0 (Bit 2)                                   */
#define SYSCON_PCLKSEL0_PCLK_TIMER0_Msk   (0xcUL)                   /*!< PCLK_TIMER0 (Bitfield-Mask: 0x03)                     */
#define SYSCON_PCLKSEL0_PCLK_TIMER1_Pos   (4UL)                     /*!< PCLK_TIMER1 (Bit 4)                                   */
#define SYSCON_PCLKSEL0_PCLK_TIMER1_Msk   (0x30UL)                  /*!< PCLK_TIMER1 (Bitfield-Mask: 0x03)                     */
#define SYSCON_PCLKSEL0_PCLK_UART0_Pos    (6UL)                     /*!< PCLK_UART0 (Bit 6)                                    */
#define SYSCON_PCLKSEL0_PCLK_UART0_Msk    (0xc0UL)                  /*!< PCLK_UART0 (Bitfield-Mask: 0x03)                      */
#define SYSCON_PCLKSEL0_PCLK_UART1_Pos    (8UL)                     /*!< PCLK_UART1 (Bit 8)                                    */
#define SYSCON_PCLKSEL0_PCLK_UART1_Msk    (0x300UL)                 /*!< PCLK_UART1 (Bitfield-Mask: 0x03)                      */
#define SYSCON_PCLKSEL0_PCLK_PWM1_Pos     (12UL)                    /*!< PCLK_PWM1 (Bit 12)                                    */
#define SYSCON_PCLKSEL0_PCLK_PWM1_Msk     (0x3000UL)                /*!< PCLK_PWM1 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL0_PCLK_I2C0_Pos     (14UL)                    /*!< PCLK_I2C0 (Bit 14)                                    */
#define SYSCON_PCLKSEL0_PCLK_I2C0_Msk     (0xc000UL)                /*!< PCLK_I2C0 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL0_PCLK_SPI_Pos      (16UL)                    /*!< PCLK_SPI (Bit 16)                                     */
#define SYSCON_PCLKSEL0_PCLK_SPI_Msk      (0x30000UL)               /*!< PCLK_SPI (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL0_PCLK_SSP1_Pos     (20UL)                    /*!< PCLK_SSP1 (Bit 20)                                    */
#define SYSCON_PCLKSEL0_PCLK_SSP1_Msk     (0x300000UL)              /*!< PCLK_SSP1 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL0_PCLK_DAC_Pos      (22UL)                    /*!< PCLK_DAC (Bit 22)                                     */
#define SYSCON_PCLKSEL0_PCLK_DAC_Msk      (0xc00000UL)              /*!< PCLK_DAC (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL0_PCLK_ADC_Pos      (24UL)                    /*!< PCLK_ADC (Bit 24)                                     */
#define SYSCON_PCLKSEL0_PCLK_ADC_Msk      (0x3000000UL)             /*!< PCLK_ADC (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL0_PCLK_CAN1_Pos     (26UL)                    /*!< PCLK_CAN1 (Bit 26)                                    */
#define SYSCON_PCLKSEL0_PCLK_CAN1_Msk     (0xc000000UL)             /*!< PCLK_CAN1 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL0_PCLK_CAN2_Pos     (28UL)                    /*!< PCLK_CAN2 (Bit 28)                                    */
#define SYSCON_PCLKSEL0_PCLK_CAN2_Msk     (0x30000000UL)            /*!< PCLK_CAN2 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL0_PCLK_ACF_Pos      (30UL)                    /*!< PCLK_ACF (Bit 30)                                     */
#define SYSCON_PCLKSEL0_PCLK_ACF_Msk      (0xc0000000UL)            /*!< PCLK_ACF (Bitfield-Mask: 0x03)                        */
/* =======================================================  PCLKSEL1  ======================================================== */
#define SYSCON_PCLKSEL1_PCLK_QEI_Pos      (0UL)                     /*!< PCLK_QEI (Bit 0)                                      */
#define SYSCON_PCLKSEL1_PCLK_QEI_Msk      (0x3UL)                   /*!< PCLK_QEI (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL1_PCLK_GPIOINT_Pos  (2UL)                     /*!< PCLK_GPIOINT (Bit 2)                                  */
#define SYSCON_PCLKSEL1_PCLK_GPIOINT_Msk  (0xcUL)                   /*!< PCLK_GPIOINT (Bitfield-Mask: 0x03)                    */
#define SYSCON_PCLKSEL1_PCLK_PCB_Pos      (4UL)                     /*!< PCLK_PCB (Bit 4)                                      */
#define SYSCON_PCLKSEL1_PCLK_PCB_Msk      (0x30UL)                  /*!< PCLK_PCB (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL1_PCLK_I2C1_Pos     (6UL)                     /*!< PCLK_I2C1 (Bit 6)                                     */
#define SYSCON_PCLKSEL1_PCLK_I2C1_Msk     (0xc0UL)                  /*!< PCLK_I2C1 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL1_PCLK_SSP0_Pos     (10UL)                    /*!< PCLK_SSP0 (Bit 10)                                    */
#define SYSCON_PCLKSEL1_PCLK_SSP0_Msk     (0xc00UL)                 /*!< PCLK_SSP0 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL1_PCLK_TIMER2_Pos   (12UL)                    /*!< PCLK_TIMER2 (Bit 12)                                  */
#define SYSCON_PCLKSEL1_PCLK_TIMER2_Msk   (0x3000UL)                /*!< PCLK_TIMER2 (Bitfield-Mask: 0x03)                     */
#define SYSCON_PCLKSEL1_PCLK_TIMER3_Pos   (14UL)                    /*!< PCLK_TIMER3 (Bit 14)                                  */
#define SYSCON_PCLKSEL1_PCLK_TIMER3_Msk   (0xc000UL)                /*!< PCLK_TIMER3 (Bitfield-Mask: 0x03)                     */
#define SYSCON_PCLKSEL1_PCLK_UART2_Pos    (16UL)                    /*!< PCLK_UART2 (Bit 16)                                   */
#define SYSCON_PCLKSEL1_PCLK_UART2_Msk    (0x30000UL)               /*!< PCLK_UART2 (Bitfield-Mask: 0x03)                      */
#define SYSCON_PCLKSEL1_PCLK_UART3_Pos    (18UL)                    /*!< PCLK_UART3 (Bit 18)                                   */
#define SYSCON_PCLKSEL1_PCLK_UART3_Msk    (0xc0000UL)               /*!< PCLK_UART3 (Bitfield-Mask: 0x03)                      */
#define SYSCON_PCLKSEL1_PCLK_I2C2_Pos     (20UL)                    /*!< PCLK_I2C2 (Bit 20)                                    */
#define SYSCON_PCLKSEL1_PCLK_I2C2_Msk     (0x300000UL)              /*!< PCLK_I2C2 (Bitfield-Mask: 0x03)                       */
#define SYSCON_PCLKSEL1_PCLK_I2S_Pos      (22UL)                    /*!< PCLK_I2S (Bit 22)                                     */
#define SYSCON_PCLKSEL1_PCLK_I2S_Msk      (0xc00000UL)              /*!< PCLK_I2S (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL1_PCLK_RIT_Pos      (26UL)                    /*!< PCLK_RIT (Bit 26)                                     */
#define SYSCON_PCLKSEL1_PCLK_RIT_Msk      (0xc000000UL)             /*!< PCLK_RIT (Bitfield-Mask: 0x03)                        */
#define SYSCON_PCLKSEL1_PCLK_SYSCON_Pos   (28UL)                    /*!< PCLK_SYSCON (Bit 28)                                  */
#define SYSCON_PCLKSEL1_PCLK_SYSCON_Msk   (0x30000000UL)            /*!< PCLK_SYSCON (Bitfield-Mask: 0x03)                     */
#define SYSCON_PCLKSEL1_PCLK_MC_Pos       (30UL)                    /*!< PCLK_MC (Bit 30)                                      */
#define SYSCON_PCLKSEL1_PCLK_MC_Msk       (0xc0000000UL)            /*!< PCLK_MC (Bitfield-Mask: 0x03)                         */
/* =======================================================  USBINTST  ======================================================== */
#define SYSCON_USBINTST_USB_INT_REQ_LP_Pos (0UL)                    /*!< USB_INT_REQ_LP (Bit 0)                                */
#define SYSCON_USBINTST_USB_INT_REQ_LP_Msk (0x1UL)                  /*!< USB_INT_REQ_LP (Bitfield-Mask: 0x01)                  */
#define SYSCON_USBINTST_USB_INT_REQ_HP_Pos (1UL)                    /*!< USB_INT_REQ_HP (Bit 1)                                */
#define SYSCON_USBINTST_USB_INT_REQ_HP_Msk (0x2UL)                  /*!< USB_INT_REQ_HP (Bitfield-Mask: 0x01)                  */
#define SYSCON_USBINTST_USB_INT_REQ_DMA_Pos (2UL)                   /*!< USB_INT_REQ_DMA (Bit 2)                               */
#define SYSCON_USBINTST_USB_INT_REQ_DMA_Msk (0x4UL)                 /*!< USB_INT_REQ_DMA (Bitfield-Mask: 0x01)                 */
#define SYSCON_USBINTST_USB_HOST_INT_Pos  (3UL)                     /*!< USB_HOST_INT (Bit 3)                                  */
#define SYSCON_USBINTST_USB_HOST_INT_Msk  (0x8UL)                   /*!< USB_HOST_INT (Bitfield-Mask: 0x01)                    */
#define SYSCON_USBINTST_USB_ATX_INT_Pos   (4UL)                     /*!< USB_ATX_INT (Bit 4)                                   */
#define SYSCON_USBINTST_USB_ATX_INT_Msk   (0x10UL)                  /*!< USB_ATX_INT (Bitfield-Mask: 0x01)                     */
#define SYSCON_USBINTST_USB_OTG_INT_Pos   (5UL)                     /*!< USB_OTG_INT (Bit 5)                                   */
#define SYSCON_USBINTST_USB_OTG_INT_Msk   (0x20UL)                  /*!< USB_OTG_INT (Bitfield-Mask: 0x01)                     */
#define SYSCON_USBINTST_USB_I2C_INT_Pos   (6UL)                     /*!< USB_I2C_INT (Bit 6)                                   */
#define SYSCON_USBINTST_USB_I2C_INT_Msk   (0x40UL)                  /*!< USB_I2C_INT (Bitfield-Mask: 0x01)                     */
#define SYSCON_USBINTST_USB_NEED_CLK_Pos  (8UL)                     /*!< USB_NEED_CLK (Bit 8)                                  */
#define SYSCON_USBINTST_USB_NEED_CLK_Msk  (0x100UL)                 /*!< USB_NEED_CLK (Bitfield-Mask: 0x01)                    */
#define SYSCON_USBINTST_EN_USB_INTS_Pos   (31UL)                    /*!< EN_USB_INTS (Bit 31)                                  */
#define SYSCON_USBINTST_EN_USB_INTS_Msk   (0x80000000UL)            /*!< EN_USB_INTS (Bitfield-Mask: 0x01)                     */
/* ======================================================  DMACREQSEL  ======================================================= */
#define SYSCON_DMACREQSEL_DMASEL08_Pos    (0UL)                     /*!< DMASEL08 (Bit 0)                                      */
#define SYSCON_DMACREQSEL_DMASEL08_Msk    (0x1UL)                   /*!< DMASEL08 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL09_Pos    (1UL)                     /*!< DMASEL09 (Bit 1)                                      */
#define SYSCON_DMACREQSEL_DMASEL09_Msk    (0x2UL)                   /*!< DMASEL09 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL10_Pos    (2UL)                     /*!< DMASEL10 (Bit 2)                                      */
#define SYSCON_DMACREQSEL_DMASEL10_Msk    (0x4UL)                   /*!< DMASEL10 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL11_Pos    (3UL)                     /*!< DMASEL11 (Bit 3)                                      */
#define SYSCON_DMACREQSEL_DMASEL11_Msk    (0x8UL)                   /*!< DMASEL11 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL12_Pos    (4UL)                     /*!< DMASEL12 (Bit 4)                                      */
#define SYSCON_DMACREQSEL_DMASEL12_Msk    (0x10UL)                  /*!< DMASEL12 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL13_Pos    (5UL)                     /*!< DMASEL13 (Bit 5)                                      */
#define SYSCON_DMACREQSEL_DMASEL13_Msk    (0x20UL)                  /*!< DMASEL13 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL14_Pos    (6UL)                     /*!< DMASEL14 (Bit 6)                                      */
#define SYSCON_DMACREQSEL_DMASEL14_Msk    (0x40UL)                  /*!< DMASEL14 (Bitfield-Mask: 0x01)                        */
#define SYSCON_DMACREQSEL_DMASEL15_Pos    (7UL)                     /*!< DMASEL15 (Bit 7)                                      */
#define SYSCON_DMACREQSEL_DMASEL15_Msk    (0x80UL)                  /*!< DMASEL15 (Bitfield-Mask: 0x01)                        */
/* =======================================================  CLKOUTCFG  ======================================================= */
#define SYSCON_CLKOUTCFG_CLKOUTSEL_Pos    (0UL)                     /*!< CLKOUTSEL (Bit 0)                                     */
#define SYSCON_CLKOUTCFG_CLKOUTSEL_Msk    (0xfUL)                   /*!< CLKOUTSEL (Bitfield-Mask: 0x0f)                       */
#define SYSCON_CLKOUTCFG_CLKOUTDIV_Pos    (4UL)                     /*!< CLKOUTDIV (Bit 4)                                     */
#define SYSCON_CLKOUTCFG_CLKOUTDIV_Msk    (0xf0UL)                  /*!< CLKOUTDIV (Bitfield-Mask: 0x0f)                       */
#define SYSCON_CLKOUTCFG_CLKOUT_EN_Pos    (8UL)                     /*!< CLKOUT_EN (Bit 8)                                     */
#define SYSCON_CLKOUTCFG_CLKOUT_EN_Msk    (0x100UL)                 /*!< CLKOUT_EN (Bitfield-Mask: 0x01)                       */
#define SYSCON_CLKOUTCFG_CLKOUT_ACT_Pos   (9UL)                     /*!< CLKOUT_ACT (Bit 9)                                    */
#define SYSCON_CLKOUTCFG_CLKOUT_ACT_Msk   (0x200UL)                 /*!< CLKOUT_ACT (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                         LPC_EMAC                                          ================ */
/* =========================================================================================================================== */

