lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* =========================================================  MAC1  ========================================================== */
#define EMAC_MAC1_RXENABLE_Pos            (0UL)                     /*!< RXENABLE (Bit 0)                                      */
#define EMAC_MAC1_RXENABLE_Msk            (0x1UL)                   /*!< RXENABLE (Bitfield-Mask: 0x01)                        */
#define EMAC_MAC1_PARF_Pos                (1UL)                     /*!< PARF (Bit 1)                                          */
#define EMAC_MAC1_PARF_Msk                (0x2UL)                   /*!< PARF (Bitfield-Mask: 0x01)                            */
#define EMAC_MAC1_RXFLOWCTRL_Pos          (2UL)                     /*!< RXFLOWCTRL (Bit 2)                                    */
#define EMAC_MAC1_RXFLOWCTRL_Msk          (0x4UL)                   /*!< RXFLOWCTRL (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC1_TXFLOWCTRL_Pos          (3UL)                     /*!< TXFLOWCTRL (Bit 3)                                    */
#define EMAC_MAC1_TXFLOWCTRL_Msk          (0x8UL)                   /*!< TXFLOWCTRL (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC1_LOOPBACK_Pos            (4UL)                     /*!< LOOPBACK (Bit 4)                                      */
#define EMAC_MAC1_LOOPBACK_Msk            (0x10UL)                  /*!< LOOPBACK (Bitfield-Mask: 0x01)                        */
#define EMAC_MAC1_RESETTX_Pos             (8UL)                     /*!< RESETTX (Bit 8)                                       */
#define EMAC_MAC1_RESETTX_Msk             (0x100UL)                 /*!< RESETTX (Bitfield-Mask: 0x01)                         */
#define EMAC_MAC1_RESETMCSTX_Pos          (9UL)                     /*!< RESETMCSTX (Bit 9)                                    */
#define EMAC_MAC1_RESETMCSTX_Msk          (0x200UL)                 /*!< RESETMCSTX (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC1_RESETRX_Pos             (10UL)                    /*!< RESETRX (Bit 10)                                      */
#define EMAC_MAC1_RESETRX_Msk             (0x400UL)                 /*!< RESETRX (Bitfield-Mask: 0x01)                         */
#define EMAC_MAC1_RESETMCSRX_Pos          (11UL)                    /*!< RESETMCSRX (Bit 11)                                   */
#define EMAC_MAC1_RESETMCSRX_Msk          (0x800UL)                 /*!< RESETMCSRX (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC1_SIMRESET_Pos            (14UL)                    /*!< SIMRESET (Bit 14)                                     */
#define EMAC_MAC1_SIMRESET_Msk            (0x4000UL)                /*!< SIMRESET (Bitfield-Mask: 0x01)                        */
#define EMAC_MAC1_SOFTRESET_Pos           (15UL)                    /*!< SOFTRESET (Bit 15)                                    */
#define EMAC_MAC1_SOFTRESET_Msk           (0x8000UL)                /*!< SOFTRESET (Bitfield-Mask: 0x01)                       */
/* =========================================================  MAC2  ========================================================== */
#define EMAC_MAC2_FULLDUPLEX_Pos          (0UL)                     /*!< FULLDUPLEX (Bit 0)                                    */
#define EMAC_MAC2_FULLDUPLEX_Msk          (0x1UL)                   /*!< FULLDUPLEX (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC2_FLC_Pos                 (1UL)                     /*!< FLC (Bit 1)                                           */
#define EMAC_MAC2_FLC_Msk                 (0x2UL)                   /*!< FLC (Bitfield-Mask: 0x01)                             */
#define EMAC_MAC2_HFEN_Pos                (2UL)                     /*!< HFEN (Bit 2)                                          */
#define EMAC_MAC2_HFEN_Msk                (0x4UL)                   /*!< HFEN (Bitfield-Mask: 0x01)                            */
#define EMAC_MAC2_DELAYEDCRC_Pos          (3UL)                     /*!< DELAYEDCRC (Bit 3)                                    */
#define EMAC_MAC2_DELAYEDCRC_Msk          (0x8UL)                   /*!< DELAYEDCRC (Bitfield-Mask: 0x01)                      */
#define EMAC_MAC2_CRCEN_Pos               (4UL)                     /*!< CRCEN (Bit 4)                                         */
#define EMAC_MAC2_CRCEN_Msk               (0x10UL)                  /*!< CRCEN (Bitfield-Mask: 0x01)                           */
#define EMAC_MAC2_PADCRCEN_Pos            (5UL)                     /*!< PADCRCEN (Bit 5)                                      */
#define EMAC_MAC2_PADCRCEN_Msk            (0x20UL)                  /*!< PADCRCEN (Bitfield-Mask: 0x01)                        */
#define EMAC_MAC2_VLANPADEN_Pos           (6UL)                     /*!< VLANPADEN (Bit 6)                                     */
#define EMAC_MAC2_VLANPADEN_Msk           (0x40UL)                  /*!< VLANPADEN (Bitfield-Mask: 0x01)                       */
#define EMAC_MAC2_AUTODETPADEN_Pos        (7UL)                     /*!< AUTODETPADEN (Bit 7)                                  */
#define EMAC_MAC2_AUTODETPADEN_Msk        (0x80UL)                  /*!< AUTODETPADEN (Bitfield-Mask: 0x01)                    */
#define EMAC_MAC2_PPENF_Pos               (8UL)                     /*!< PPENF (Bit 8)                                         */
#define EMAC_MAC2_PPENF_Msk               (0x100UL)                 /*!< PPENF (Bitfield-Mask: 0x01)                           */
#define EMAC_MAC2_LPENF_Pos               (9UL)                     /*!< LPENF (Bit 9)                                         */
#define EMAC_MAC2_LPENF_Msk               (0x200UL)                 /*!< LPENF (Bitfield-Mask: 0x01)                           */
#define EMAC_MAC2_NOBACKOFF_Pos           (12UL)                    /*!< NOBACKOFF (Bit 12)                                    */
#define EMAC_MAC2_NOBACKOFF_Msk           (0x1000UL)                /*!< NOBACKOFF (Bitfield-Mask: 0x01)                       */
#define EMAC_MAC2_BP_NOBACKOFF_Pos        (13UL)                    /*!< BP_NOBACKOFF (Bit 13)                                 */
#define EMAC_MAC2_BP_NOBACKOFF_Msk        (0x2000UL)                /*!< BP_NOBACKOFF (Bitfield-Mask: 0x01)                    */
#define EMAC_MAC2_EXCESSDEFER_Pos         (14UL)                    /*!< EXCESSDEFER (Bit 14)                                  */
#define EMAC_MAC2_EXCESSDEFER_Msk         (0x4000UL)                /*!< EXCESSDEFER (Bitfield-Mask: 0x01)                     */
/* =========================================================  IPGT  ========================================================== */
#define EMAC_IPGT_BTOBINTEGAP_Pos         (0UL)                     /*!< BTOBINTEGAP (Bit 0)                                   */
#define EMAC_IPGT_BTOBINTEGAP_Msk         (0x7fUL)                  /*!< BTOBINTEGAP (Bitfield-Mask: 0x7f)                     */
/* =========================================================  IPGR  ========================================================== */
#define EMAC_IPGR_NBTOBINTEGAP2_Pos       (0UL)                     /*!< NBTOBINTEGAP2 (Bit 0)                                 */
#define EMAC_IPGR_NBTOBINTEGAP2_Msk       (0x7fUL)                  /*!< NBTOBINTEGAP2 (Bitfield-Mask: 0x7f)                   */
#define EMAC_IPGR_NBTOBINTEGAP1_Pos       (8UL)                     /*!< NBTOBINTEGAP1 (Bit 8)                                 */
#define EMAC_IPGR_NBTOBINTEGAP1_Msk       (0x7f00UL)                /*!< NBTOBINTEGAP1 (Bitfield-Mask: 0x7f)                   */
/* =========================================================  CLRT  ========================================================== */
#define EMAC_CLRT_RETRANSMAX_Pos          (0UL)                     /*!< RETRANSMAX (Bit 0)                                    */
#define EMAC_CLRT_RETRANSMAX_Msk          (0xfUL)                   /*!< RETRANSMAX (Bitfield-Mask: 0x0f)                      */
#define EMAC_CLRT_COLLWIN_Pos             (8UL)                     /*!< COLLWIN (Bit 8)                                       */
#define EMAC_CLRT_COLLWIN_Msk             (0x3f00UL)                /*!< COLLWIN (Bitfield-Mask: 0x3f)                         */
/* =========================================================  MAXF  ========================================================== */
#define EMAC_MAXF_MAXFLEN_Pos             (0UL)                     /*!< MAXFLEN (Bit 0)                                       */
#define EMAC_MAXF_MAXFLEN_Msk             (0xffffUL)                /*!< MAXFLEN (Bitfield-Mask: 0xffff)                       */
/* =========================================================  SUPP  ========================================================== */
#define EMAC_SUPP_SPEED_Pos               (8UL)                     /*!< SPEED (Bit 8)                                         */
#define EMAC_SUPP_SPEED_Msk               (0x100UL)                 /*!< SPEED (Bitfield-Mask: 0x01)                           */
/* =========================================================  TEST  ========================================================== */
#define EMAC_TEST_SCPQ_Pos                (0UL)                     /*!< SCPQ (Bit 0)                                          */
#define EMAC_TEST_SCPQ_Msk                (0x1UL)                   /*!< SCPQ (Bitfield-Mask: 0x01)                            */
#define EMAC_TEST_TESTPAUSE_Pos           (1UL)                     /*!< TESTPAUSE (Bit 1)                                     */
#define EMAC_TEST_TESTPAUSE_Msk           (0x2UL)                   /*!< TESTPAUSE (Bitfield-Mask: 0x01)                       */
#define EMAC_TEST_TESTBP_Pos              (2UL)                     /*!< TESTBP (Bit 2)                                        */
#define EMAC_TEST_TESTBP_Msk              (0x4UL)                   /*!< TESTBP (Bitfield-Mask: 0x01)                          */
/* =========================================================  MCFG  ========================================================== */
#define EMAC_MCFG_SCANINC_Pos             (0UL)                     /*!< SCANINC (Bit 0)                                       */
#define EMAC_MCFG_SCANINC_Msk             (0x1UL)                   /*!< SCANINC (Bitfield-Mask: 0x01)                         */
#define EMAC_MCFG_SUPPPREAMBLE_Pos        (1UL)                     /*!< SUPPPREAMBLE (Bit 1)                                  */
#define EMAC_MCFG_SUPPPREAMBLE_Msk        (0x2UL)                   /*!< SUPPPREAMBLE (Bitfield-Mask: 0x01)                    */
#define EMAC_MCFG_CLOCKSEL_Pos            (2UL)                     /*!< CLOCKSEL (Bit 2)                                      */
#define EMAC_MCFG_CLOCKSEL_Msk            (0x3cUL)                  /*!< CLOCKSEL (Bitfield-Mask: 0x0f)                        */
#define EMAC_MCFG_RESETMIIMGMT_Pos        (15UL)                    /*!< RESETMIIMGMT (Bit 15)                                 */
#define EMAC_MCFG_RESETMIIMGMT_Msk        (0x8000UL)                /*!< RESETMIIMGMT (Bitfield-Mask: 0x01)                    */
/* =========================================================  MCMD  ========================================================== */
#define EMAC_MCMD_READ_Pos                (0UL)                     /*!< READ (Bit 0)                                          */
#define EMAC_MCMD_READ_Msk                (0x1UL)                   /*!< READ (Bitfield-Mask: 0x01)                            */
#define EMAC_MCMD_SCAN_Pos                (1UL)                     /*!< SCAN (Bit 1)                                          */
#define EMAC_MCMD_SCAN_Msk                (0x2UL)                   /*!< SCAN (Bitfield-Mask: 0x01)                            */
/* =========================================================  MADR  ========================================================== */
#define EMAC_MADR_REGADDR_Pos             (0UL)                     /*!< REGADDR (Bit 0)                                       */
#define EMAC_MADR_REGADDR_Msk             (0x1fUL)                  /*!< REGADDR (Bitfield-Mask: 0x1f)                         */
#define EMAC_MADR_PHYADDR_Pos             (8UL)                     /*!< PHYADDR (Bit 8)                                       */
#define EMAC_MADR_PHYADDR_Msk             (0x1f00UL)                /*!< PHYADDR (Bitfield-Mask: 0x1f)                         */
/* =========================================================  MWTD  ========================================================== */
#define EMAC_MWTD_WRITEDATA_Pos           (0UL)                     /*!< WRITEDATA (Bit 0)                                     */
#define EMAC_MWTD_WRITEDATA_Msk           (0xffffUL)                /*!< WRITEDATA (Bitfield-Mask: 0xffff)                     */
/* =========================================================  MRDD  ========================================================== */
#define EMAC_MRDD_READDATA_Pos            (0UL)                     /*!< READDATA (Bit 0)                                      */
#define EMAC_MRDD_READDATA_Msk            (0xffffUL)                /*!< READDATA (Bitfield-Mask: 0xffff)                      */
/* =========================================================  MIND  ========================================================== */
#define EMAC_MIND_BUSY_Pos                (0UL)                     /*!< BUSY (Bit 0)                                          */
#define EMAC_MIND_BUSY_Msk                (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define EMAC_MIND_SCANNING_Pos            (1UL)                     /*!< SCANNING (Bit 1)                                      */
#define EMAC_MIND_SCANNING_Msk            (0x2UL)                   /*!< SCANNING (Bitfield-Mask: 0x01)                        */
#define EMAC_MIND_NOTVALID_Pos            (2UL)                     /*!< NOTVALID (Bit 2)                                      */
#define EMAC_MIND_NOTVALID_Msk            (0x4UL)                   /*!< NOTVALID (Bitfield-Mask: 0x01)                        */
#define EMAC_MIND_MIILINKFAIL_Pos         (3UL)                     /*!< MIILINKFAIL (Bit 3)                                   */
#define EMAC_MIND_MIILINKFAIL_Msk         (0x8UL)                   /*!< MIILINKFAIL (Bitfield-Mask: 0x01)                     */
/* ==========================================================  SA0  ========================================================== */
#define EMAC_SA0_SADDR2_Pos               (0UL)                     /*!< SADDR2 (Bit 0)                                        */
#define EMAC_SA0_SADDR2_Msk               (0xffUL)                  /*!< SADDR2 (Bitfield-Mask: 0xff)                          */
#define EMAC_SA0_SADDR1_Pos               (8UL)                     /*!< SADDR1 (Bit 8)                                        */
#define EMAC_SA0_SADDR1_Msk               (0xff00UL)                /*!< SADDR1 (Bitfield-Mask: 0xff)                          */
/* ==========================================================  SA1  ========================================================== */
#define EMAC_SA1_SADDR4_Pos               (0UL)                     /*!< SADDR4 (Bit 0)                                        */
#define EMAC_SA1_SADDR4_Msk               (0xffUL)                  /*!< SADDR4 (Bitfield-Mask: 0xff)                          */
#define EMAC_SA1_SADDR3_Pos               (8UL)                     /*!< SADDR3 (Bit 8)                                        */
#define EMAC_SA1_SADDR3_Msk               (0xff00UL)                /*!< SADDR3 (Bitfield-Mask: 0xff)                          */
/* ==========================================================  SA2  ========================================================== */
#define EMAC_SA2_SADDR6_Pos               (0UL)                     /*!< SADDR6 (Bit 0)                                        */
#define EMAC_SA2_SADDR6_Msk               (0xffUL)                  /*!< SADDR6 (Bitfield-Mask: 0xff)                          */
#define EMAC_SA2_SADDR5_Pos               (8UL)                     /*!< SADDR5 (Bit 8)                                        */
#define EMAC_SA2_SADDR5_Msk               (0xff00UL)                /*!< SADDR5 (Bitfield-Mask: 0xff)                          */
/* ========================================================  COMMAND  ======================================================== */
#define EMAC_COMMAND_RXENABLE_Pos         (0UL)                     /*!< RXENABLE (Bit 0)                                      */
#define EMAC_COMMAND_RXENABLE_Msk         (0x1UL)                   /*!< RXENABLE (Bitfield-Mask: 0x01)                        */
#define EMAC_COMMAND_TXENABLE_Pos         (1UL)                     /*!< TXENABLE (Bit 1)                                      */
#define EMAC_COMMAND_TXENABLE_Msk         (0x2UL)                   /*!< TXENABLE (Bitfield-Mask: 0x01)                        */
#define EMAC_COMMAND_REGRESET_Pos         (3UL)                     /*!< REGRESET (Bit 3)                                      */
#define EMAC_COMMAND_REGRESET_Msk         (0x8UL)                   /*!< REGRESET (Bitfield-Mask: 0x01)                        */
#define EMAC_COMMAND_TXRESET_Pos          (4UL)                     /*!< TXRESET (Bit 4)                                       */
#define EMAC_COMMAND_TXRESET_Msk          (0x10UL)                  /*!< TXRESET (Bitfield-Mask: 0x01)                         */
#define EMAC_COMMAND_RXRESET_Pos          (5UL)                     /*!< RXRESET (Bit 5)                                       */
#define EMAC_COMMAND_RXRESET_Msk          (0x20UL)                  /*!< RXRESET (Bitfield-Mask: 0x01)                         */
#define EMAC_COMMAND_PASSRUNTFRAME_Pos    (6UL)                     /*!< PASSRUNTFRAME (Bit 6)                                 */
#define EMAC_COMMAND_PASSRUNTFRAME_Msk    (0x40UL)                  /*!< PASSRUNTFRAME (Bitfield-Mask: 0x01)                   */
#define EMAC_COMMAND_PASSRXFILTER_Pos     (7UL)                     /*!< PASSRXFILTER (Bit 7)                                  */
#define EMAC_COMMAND_PASSRXFILTER_Msk     (0x80UL)                  /*!< PASSRXFILTER (Bitfield-Mask: 0x01)                    */
#define EMAC_COMMAND_TXFLOWCONTROL_Pos    (8UL)                     /*!< TXFLOWCONTROL (Bit 8)                                 */
#define EMAC_COMMAND_TXFLOWCONTROL_Msk    (0x100UL)                 /*!< TXFLOWCONTROL (Bitfield-Mask: 0x01)                   */
#define EMAC_COMMAND_RMII_Pos             (9UL)                     /*!< RMII (Bit 9)                                          */
#define EMAC_COMMAND_RMII_Msk             (0x200UL)                 /*!< RMII (Bitfield-Mask: 0x01)                            */
#define EMAC_COMMAND_FULLDUPLEX_Pos       (10UL)                    /*!< FULLDUPLEX (Bit 10)                                   */
#define EMAC_COMMAND_FULLDUPLEX_Msk       (0x400UL)                 /*!< FULLDUPLEX (Bitfield-Mask: 0x01)                      */
/* ========================================================  STATUS  ========================================================= */
#define EMAC_STATUS_RXSTATUS_Pos          (0UL)                     /*!< RXSTATUS (Bit 0)                                      */
#define EMAC_STATUS_RXSTATUS_Msk          (0x1UL)                   /*!< RXSTATUS (Bitfield-Mask: 0x01)                        */
#define EMAC_STATUS_TXSTATUS_Pos          (1UL)                     /*!< TXSTATUS (Bit 1)                                      */
#define EMAC_STATUS_TXSTATUS_Msk          (0x2UL)                   /*!< TXSTATUS (Bitfield-Mask: 0x01)                        */
/* =====================================================  RXDESCRIPTOR  ====================================================== */
#define EMAC_RXDESCRIPTOR_RXDESCRIPTOR_Pos (2UL)                    /*!< RXDESCRIPTOR (Bit 2)                                  */
#define EMAC_RXDESCRIPTOR_RXDESCRIPTOR_Msk (0xfffffffcUL)           /*!< RXDESCRIPTOR (Bitfield-Mask: 0x3fffffff)              */
/* =======================================================  RXSTATUS  ======================================================== */
#define EMAC_RXSTATUS_RXSTATUS_Pos        (3UL)                     /*!< RXSTATUS (Bit 3)                                      */
#define EMAC_RXSTATUS_RXSTATUS_Msk        (0xfffffff8UL)            /*!< RXSTATUS (Bitfield-Mask: 0x1fffffff)                  */
/* ==================================================  RXDESCRIPTORNUMBER  =================================================== */
#define EMAC_RXDESCRIPTORNUMBER_RXDESCRIPTORN_Pos (0UL)             /*!< RXDESCRIPTORN (Bit 0)                                 */
#define EMAC_RXDESCRIPTORNUMBER_RXDESCRIPTORN_Msk (0xffffUL)        /*!< RXDESCRIPTORN (Bitfield-Mask: 0xffff)                 */
/* ====================================================  RXPRODUCEINDEX  ===================================================== */
#define EMAC_RXPRODUCEINDEX_RXPRODUCEIX_Pos (0UL)                   /*!< RXPRODUCEIX (Bit 0)                                   */
#define EMAC_RXPRODUCEINDEX_RXPRODUCEIX_Msk (0xffffUL)              /*!< RXPRODUCEIX (Bitfield-Mask: 0xffff)                   */
/* ====================================================  RXCONSUMEINDEX  ===================================================== */
#define EMAC_RXCONSUMEINDEX_RXCONSUMEIX_Pos (0UL)                   /*!< RXCONSUMEIX (Bit 0)                                   */
#define EMAC_RXCONSUMEINDEX_RXCONSUMEIX_Msk (0xffffUL)              /*!< RXCONSUMEIX (Bitfield-Mask: 0xffff)                   */
/* =====================================================  TXDESCRIPTOR  ====================================================== */
#define EMAC_TXDESCRIPTOR_TXD_Pos         (2UL)                     /*!< TXD (Bit 2)                                           */
#define EMAC_TXDESCRIPTOR_TXD_Msk         (0xfffffffcUL)            /*!< TXD (Bitfield-Mask: 0x3fffffff)                       */
/* =======================================================  TXSTATUS  ======================================================== */
#define EMAC_TXSTATUS_TXSTAT_Pos          (2UL)                     /*!< TXSTAT (Bit 2)                                        */
#define EMAC_TXSTATUS_TXSTAT_Msk          (0xfffffffcUL)            /*!< TXSTAT (Bitfield-Mask: 0x3fffffff)                    */
/* ==================================================  TXDESCRIPTORNUMBER  =================================================== */
#define EMAC_TXDESCRIPTORNUMBER_TXDN_Pos  (0UL)                     /*!< TXDN (Bit 0)                                          */
#define EMAC_TXDESCRIPTORNUMBER_TXDN_Msk  (0xffffUL)                /*!< TXDN (Bitfield-Mask: 0xffff)                          */
/* ====================================================  TXPRODUCEINDEX  ===================================================== */
#define EMAC_TXPRODUCEINDEX_TXPI_Pos      (0UL)                     /*!< TXPI (Bit 0)                                          */
#define EMAC_TXPRODUCEINDEX_TXPI_Msk      (0xffffUL)                /*!< TXPI (Bitfield-Mask: 0xffff)                          */
/* ====================================================  TXCONSUMEINDEX  ===================================================== */
#define EMAC_TXCONSUMEINDEX_TXCI_Pos      (0UL)                     /*!< TXCI (Bit 0)                                          */
#define EMAC_TXCONSUMEINDEX_TXCI_Msk      (0xffffUL)                /*!< TXCI (Bitfield-Mask: 0xffff)                          */
/* =========================================================  TSV0  ========================================================== */
#define EMAC_TSV0_CRCERR_Pos              (0UL)                     /*!< CRCERR (Bit 0)                                        */
#define EMAC_TSV0_CRCERR_Msk              (0x1UL)                   /*!< CRCERR (Bitfield-Mask: 0x01)                          */
