lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define EMAC_TSV0_LCE_Pos                 (1UL)                     /*!< LCE (Bit 1)                                           */
#define EMAC_TSV0_LCE_Msk                 (0x2UL)                   /*!< LCE (Bitfield-Mask: 0x01)                             */
#define EMAC_TSV0_LOR_Pos                 (2UL)                     /*!< LOR (Bit 2)                                           */
#define EMAC_TSV0_LOR_Msk                 (0x4UL)                   /*!< LOR (Bitfield-Mask: 0x01)                             */
#define EMAC_TSV0_DONE_Pos                (3UL)                     /*!< DONE (Bit 3)                                          */
#define EMAC_TSV0_DONE_Msk                (0x8UL)                   /*!< DONE (Bitfield-Mask: 0x01)                            */
#define EMAC_TSV0_MULTICAST_Pos           (4UL)                     /*!< MULTICAST (Bit 4)                                     */
#define EMAC_TSV0_MULTICAST_Msk           (0x10UL)                  /*!< MULTICAST (Bitfield-Mask: 0x01)                       */
#define EMAC_TSV0_BROADCAST_Pos           (5UL)                     /*!< BROADCAST (Bit 5)                                     */
#define EMAC_TSV0_BROADCAST_Msk           (0x20UL)                  /*!< BROADCAST (Bitfield-Mask: 0x01)                       */
#define EMAC_TSV0_PACKETDEFER_Pos         (6UL)                     /*!< PACKETDEFER (Bit 6)                                   */
#define EMAC_TSV0_PACKETDEFER_Msk         (0x40UL)                  /*!< PACKETDEFER (Bitfield-Mask: 0x01)                     */
#define EMAC_TSV0_EXDF_Pos                (7UL)                     /*!< EXDF (Bit 7)                                          */
#define EMAC_TSV0_EXDF_Msk                (0x80UL)                  /*!< EXDF (Bitfield-Mask: 0x01)                            */
#define EMAC_TSV0_EXCOL_Pos               (8UL)                     /*!< EXCOL (Bit 8)                                         */
#define EMAC_TSV0_EXCOL_Msk               (0x100UL)                 /*!< EXCOL (Bitfield-Mask: 0x01)                           */
#define EMAC_TSV0_LCOL_Pos                (9UL)                     /*!< LCOL (Bit 9)                                          */
#define EMAC_TSV0_LCOL_Msk                (0x200UL)                 /*!< LCOL (Bitfield-Mask: 0x01)                            */
#define EMAC_TSV0_GIANT_Pos               (10UL)                    /*!< GIANT (Bit 10)                                        */
#define EMAC_TSV0_GIANT_Msk               (0x400UL)                 /*!< GIANT (Bitfield-Mask: 0x01)                           */
#define EMAC_TSV0_UNDERRUN_Pos            (11UL)                    /*!< UNDERRUN (Bit 11)                                     */
#define EMAC_TSV0_UNDERRUN_Msk            (0x800UL)                 /*!< UNDERRUN (Bitfield-Mask: 0x01)                        */
#define EMAC_TSV0_TOTALBYTES_Pos          (12UL)                    /*!< TOTALBYTES (Bit 12)                                   */
#define EMAC_TSV0_TOTALBYTES_Msk          (0xffff000UL)             /*!< TOTALBYTES (Bitfield-Mask: 0xffff)                    */
#define EMAC_TSV0_CONTROLFRAME_Pos        (28UL)                    /*!< CONTROLFRAME (Bit 28)                                 */
#define EMAC_TSV0_CONTROLFRAME_Msk        (0x10000000UL)            /*!< CONTROLFRAME (Bitfield-Mask: 0x01)                    */
#define EMAC_TSV0_PAUSE_Pos               (29UL)                    /*!< PAUSE (Bit 29)                                        */
#define EMAC_TSV0_PAUSE_Msk               (0x20000000UL)            /*!< PAUSE (Bitfield-Mask: 0x01)                           */
#define EMAC_TSV0_BACKPRESSURE_Pos        (30UL)                    /*!< BACKPRESSURE (Bit 30)                                 */
#define EMAC_TSV0_BACKPRESSURE_Msk        (0x40000000UL)            /*!< BACKPRESSURE (Bitfield-Mask: 0x01)                    */
#define EMAC_TSV0_VLAN_Pos                (31UL)                    /*!< VLAN (Bit 31)                                         */
#define EMAC_TSV0_VLAN_Msk                (0x80000000UL)            /*!< VLAN (Bitfield-Mask: 0x01)                            */
/* =========================================================  TSV1  ========================================================== */
#define EMAC_TSV1_TBC_Pos                 (0UL)                     /*!< TBC (Bit 0)                                           */
#define EMAC_TSV1_TBC_Msk                 (0xffffUL)                /*!< TBC (Bitfield-Mask: 0xffff)                           */
#define EMAC_TSV1_TCC_Pos                 (16UL)                    /*!< TCC (Bit 16)                                          */
#define EMAC_TSV1_TCC_Msk                 (0xf0000UL)               /*!< TCC (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  RSV  ========================================================== */
#define EMAC_RSV_RBC_Pos                  (0UL)                     /*!< RBC (Bit 0)                                           */
#define EMAC_RSV_RBC_Msk                  (0xffffUL)                /*!< RBC (Bitfield-Mask: 0xffff)                           */
#define EMAC_RSV_PPI_Pos                  (16UL)                    /*!< PPI (Bit 16)                                          */
#define EMAC_RSV_PPI_Msk                  (0x10000UL)               /*!< PPI (Bitfield-Mask: 0x01)                             */
#define EMAC_RSV_RXDVSEEN_Pos             (17UL)                    /*!< RXDVSEEN (Bit 17)                                     */
#define EMAC_RSV_RXDVSEEN_Msk             (0x20000UL)               /*!< RXDVSEEN (Bitfield-Mask: 0x01)                        */
#define EMAC_RSV_CESEEN_Pos               (18UL)                    /*!< CESEEN (Bit 18)                                       */
#define EMAC_RSV_CESEEN_Msk               (0x40000UL)               /*!< CESEEN (Bitfield-Mask: 0x01)                          */
#define EMAC_RSV_RCV_Pos                  (19UL)                    /*!< RCV (Bit 19)                                          */
#define EMAC_RSV_RCV_Msk                  (0x80000UL)               /*!< RCV (Bitfield-Mask: 0x01)                             */
#define EMAC_RSV_CRCERR_Pos               (20UL)                    /*!< CRCERR (Bit 20)                                       */
#define EMAC_RSV_CRCERR_Msk               (0x100000UL)              /*!< CRCERR (Bitfield-Mask: 0x01)                          */
#define EMAC_RSV_LCERR_Pos                (21UL)                    /*!< LCERR (Bit 21)                                        */
#define EMAC_RSV_LCERR_Msk                (0x200000UL)              /*!< LCERR (Bitfield-Mask: 0x01)                           */
#define EMAC_RSV_LOR_Pos                  (22UL)                    /*!< LOR (Bit 22)                                          */
#define EMAC_RSV_LOR_Msk                  (0x400000UL)              /*!< LOR (Bitfield-Mask: 0x01)                             */
#define EMAC_RSV_ROK_Pos                  (23UL)                    /*!< ROK (Bit 23)                                          */
#define EMAC_RSV_ROK_Msk                  (0x800000UL)              /*!< ROK (Bitfield-Mask: 0x01)                             */
#define EMAC_RSV_MULTICAST_Pos            (24UL)                    /*!< MULTICAST (Bit 24)                                    */
#define EMAC_RSV_MULTICAST_Msk            (0x1000000UL)             /*!< MULTICAST (Bitfield-Mask: 0x01)                       */
#define EMAC_RSV_BROADCAST_Pos            (25UL)                    /*!< BROADCAST (Bit 25)                                    */
#define EMAC_RSV_BROADCAST_Msk            (0x2000000UL)             /*!< BROADCAST (Bitfield-Mask: 0x01)                       */
#define EMAC_RSV_DRIBBLENIBBLE_Pos        (26UL)                    /*!< DRIBBLENIBBLE (Bit 26)                                */
#define EMAC_RSV_DRIBBLENIBBLE_Msk        (0x4000000UL)             /*!< DRIBBLENIBBLE (Bitfield-Mask: 0x01)                   */
#define EMAC_RSV_CONTROLFRAME_Pos         (27UL)                    /*!< CONTROLFRAME (Bit 27)                                 */
#define EMAC_RSV_CONTROLFRAME_Msk         (0x8000000UL)             /*!< CONTROLFRAME (Bitfield-Mask: 0x01)                    */
#define EMAC_RSV_PAUSE_Pos                (28UL)                    /*!< PAUSE (Bit 28)                                        */
#define EMAC_RSV_PAUSE_Msk                (0x10000000UL)            /*!< PAUSE (Bitfield-Mask: 0x01)                           */
#define EMAC_RSV_UO_Pos                   (29UL)                    /*!< UO (Bit 29)                                           */
#define EMAC_RSV_UO_Msk                   (0x20000000UL)            /*!< UO (Bitfield-Mask: 0x01)                              */
#define EMAC_RSV_VLAN_Pos                 (30UL)                    /*!< VLAN (Bit 30)                                         */
#define EMAC_RSV_VLAN_Msk                 (0x40000000UL)            /*!< VLAN (Bitfield-Mask: 0x01)                            */
/* ==================================================  FLOWCONTROLCOUNTER  =================================================== */
#define EMAC_FLOWCONTROLCOUNTER_MC_Pos    (0UL)                     /*!< MC (Bit 0)                                            */
#define EMAC_FLOWCONTROLCOUNTER_MC_Msk    (0xffffUL)                /*!< MC (Bitfield-Mask: 0xffff)                            */
#define EMAC_FLOWCONTROLCOUNTER_PT_Pos    (16UL)                    /*!< PT (Bit 16)                                           */
#define EMAC_FLOWCONTROLCOUNTER_PT_Msk    (0xffff0000UL)            /*!< PT (Bitfield-Mask: 0xffff)                            */
/* ===================================================  FLOWCONTROLSTATUS  =================================================== */
#define EMAC_FLOWCONTROLSTATUS_MCC_Pos    (0UL)                     /*!< MCC (Bit 0)                                           */
#define EMAC_FLOWCONTROLSTATUS_MCC_Msk    (0xffffUL)                /*!< MCC (Bitfield-Mask: 0xffff)                           */
/* =====================================================  RXFILTERCTRL  ====================================================== */
#define EMAC_RXFILTERCTRL_AUE_Pos         (0UL)                     /*!< AUE (Bit 0)                                           */
#define EMAC_RXFILTERCTRL_AUE_Msk         (0x1UL)                   /*!< AUE (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERCTRL_ABE_Pos         (1UL)                     /*!< ABE (Bit 1)                                           */
#define EMAC_RXFILTERCTRL_ABE_Msk         (0x2UL)                   /*!< ABE (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERCTRL_AME_Pos         (2UL)                     /*!< AME (Bit 2)                                           */
#define EMAC_RXFILTERCTRL_AME_Msk         (0x4UL)                   /*!< AME (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERCTRL_AUHE_Pos        (3UL)                     /*!< AUHE (Bit 3)                                          */
#define EMAC_RXFILTERCTRL_AUHE_Msk        (0x8UL)                   /*!< AUHE (Bitfield-Mask: 0x01)                            */
#define EMAC_RXFILTERCTRL_AMHE_Pos        (4UL)                     /*!< AMHE (Bit 4)                                          */
#define EMAC_RXFILTERCTRL_AMHE_Msk        (0x10UL)                  /*!< AMHE (Bitfield-Mask: 0x01)                            */
#define EMAC_RXFILTERCTRL_APE_Pos         (5UL)                     /*!< APE (Bit 5)                                           */
#define EMAC_RXFILTERCTRL_APE_Msk         (0x20UL)                  /*!< APE (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERCTRL_MPEW_Pos        (12UL)                    /*!< MPEW (Bit 12)                                         */
#define EMAC_RXFILTERCTRL_MPEW_Msk        (0x1000UL)                /*!< MPEW (Bitfield-Mask: 0x01)                            */
#define EMAC_RXFILTERCTRL_RFEW_Pos        (13UL)                    /*!< RFEW (Bit 13)                                         */
#define EMAC_RXFILTERCTRL_RFEW_Msk        (0x2000UL)                /*!< RFEW (Bitfield-Mask: 0x01)                            */
/* ===================================================  RXFILTERWOLSTATUS  =================================================== */
#define EMAC_RXFILTERWOLSTATUS_AUW_Pos    (0UL)                     /*!< AUW (Bit 0)                                           */
#define EMAC_RXFILTERWOLSTATUS_AUW_Msk    (0x1UL)                   /*!< AUW (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERWOLSTATUS_ABW_Pos    (1UL)                     /*!< ABW (Bit 1)                                           */
#define EMAC_RXFILTERWOLSTATUS_ABW_Msk    (0x2UL)                   /*!< ABW (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERWOLSTATUS_AMW_Pos    (2UL)                     /*!< AMW (Bit 2)                                           */
#define EMAC_RXFILTERWOLSTATUS_AMW_Msk    (0x4UL)                   /*!< AMW (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERWOLSTATUS_AUHW_Pos   (3UL)                     /*!< AUHW (Bit 3)                                          */
#define EMAC_RXFILTERWOLSTATUS_AUHW_Msk   (0x8UL)                   /*!< AUHW (Bitfield-Mask: 0x01)                            */
#define EMAC_RXFILTERWOLSTATUS_AMHW_Pos   (4UL)                     /*!< AMHW (Bit 4)                                          */
#define EMAC_RXFILTERWOLSTATUS_AMHW_Msk   (0x10UL)                  /*!< AMHW (Bitfield-Mask: 0x01)                            */
#define EMAC_RXFILTERWOLSTATUS_APW_Pos    (5UL)                     /*!< APW (Bit 5)                                           */
#define EMAC_RXFILTERWOLSTATUS_APW_Msk    (0x20UL)                  /*!< APW (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERWOLSTATUS_RFW_Pos    (7UL)                     /*!< RFW (Bit 7)                                           */
#define EMAC_RXFILTERWOLSTATUS_RFW_Msk    (0x80UL)                  /*!< RFW (Bitfield-Mask: 0x01)                             */
#define EMAC_RXFILTERWOLSTATUS_MPW_Pos    (8UL)                     /*!< MPW (Bit 8)                                           */
#define EMAC_RXFILTERWOLSTATUS_MPW_Msk    (0x100UL)                 /*!< MPW (Bitfield-Mask: 0x01)                             */
/* ===================================================  RXFILTERWOLCLEAR  ==================================================== */
#define EMAC_RXFILTERWOLCLEAR_AUWCLR_Pos  (0UL)                     /*!< AUWCLR (Bit 0)                                        */
#define EMAC_RXFILTERWOLCLEAR_AUWCLR_Msk  (0x1UL)                   /*!< AUWCLR (Bitfield-Mask: 0x01)                          */
#define EMAC_RXFILTERWOLCLEAR_ABWCLR_Pos  (1UL)                     /*!< ABWCLR (Bit 1)                                        */
#define EMAC_RXFILTERWOLCLEAR_ABWCLR_Msk  (0x2UL)                   /*!< ABWCLR (Bitfield-Mask: 0x01)                          */
#define EMAC_RXFILTERWOLCLEAR_AMWCLR_Pos  (2UL)                     /*!< AMWCLR (Bit 2)                                        */
#define EMAC_RXFILTERWOLCLEAR_AMWCLR_Msk  (0x4UL)                   /*!< AMWCLR (Bitfield-Mask: 0x01)                          */
#define EMAC_RXFILTERWOLCLEAR_AUHWCLR_Pos (3UL)                     /*!< AUHWCLR (Bit 3)                                       */
#define EMAC_RXFILTERWOLCLEAR_AUHWCLR_Msk (0x8UL)                   /*!< AUHWCLR (Bitfield-Mask: 0x01)                         */
#define EMAC_RXFILTERWOLCLEAR_AMHWCLR_Pos (4UL)                     /*!< AMHWCLR (Bit 4)                                       */
#define EMAC_RXFILTERWOLCLEAR_AMHWCLR_Msk (0x10UL)                  /*!< AMHWCLR (Bitfield-Mask: 0x01)                         */
#define EMAC_RXFILTERWOLCLEAR_APWCLR_Pos  (5UL)                     /*!< APWCLR (Bit 5)                                        */
#define EMAC_RXFILTERWOLCLEAR_APWCLR_Msk  (0x20UL)                  /*!< APWCLR (Bitfield-Mask: 0x01)                          */
#define EMAC_RXFILTERWOLCLEAR_RFWCLR_Pos  (7UL)                     /*!< RFWCLR (Bit 7)                                        */
#define EMAC_RXFILTERWOLCLEAR_RFWCLR_Msk  (0x80UL)                  /*!< RFWCLR (Bitfield-Mask: 0x01)                          */
#define EMAC_RXFILTERWOLCLEAR_MPWCLR_Pos  (8UL)                     /*!< MPWCLR (Bit 8)                                        */
#define EMAC_RXFILTERWOLCLEAR_MPWCLR_Msk  (0x100UL)                 /*!< MPWCLR (Bitfield-Mask: 0x01)                          */
/* ======================================================  HASHFILTERL  ====================================================== */
#define EMAC_HASHFILTERL_HFL_Pos          (0UL)                     /*!< HFL (Bit 0)                                           */
#define EMAC_HASHFILTERL_HFL_Msk          (0xffffffffUL)            /*!< HFL (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  HASHFILTERH  ====================================================== */
#define EMAC_HASHFILTERH_HFH_Pos          (0UL)                     /*!< HFH (Bit 0)                                           */
#define EMAC_HASHFILTERH_HFH_Msk          (0xffffffffUL)            /*!< HFH (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  INTSTATUS  ======================================================= */
#define EMAC_INTSTATUS_RXOVERRUNINT_Pos   (0UL)                     /*!< RXOVERRUNINT (Bit 0)                                  */
#define EMAC_INTSTATUS_RXOVERRUNINT_Msk   (0x1UL)                   /*!< RXOVERRUNINT (Bitfield-Mask: 0x01)                    */
#define EMAC_INTSTATUS_RXERRORINT_Pos     (1UL)                     /*!< RXERRORINT (Bit 1)                                    */
#define EMAC_INTSTATUS_RXERRORINT_Msk     (0x2UL)                   /*!< RXERRORINT (Bitfield-Mask: 0x01)                      */
#define EMAC_INTSTATUS_RXFINISHEDINT_Pos  (2UL)                     /*!< RXFINISHEDINT (Bit 2)                                 */
#define EMAC_INTSTATUS_RXFINISHEDINT_Msk  (0x4UL)                   /*!< RXFINISHEDINT (Bitfield-Mask: 0x01)                   */
#define EMAC_INTSTATUS_RXDONEINT_Pos      (3UL)                     /*!< RXDONEINT (Bit 3)                                     */
#define EMAC_INTSTATUS_RXDONEINT_Msk      (0x8UL)                   /*!< RXDONEINT (Bitfield-Mask: 0x01)                       */
#define EMAC_INTSTATUS_TXUNDERRUNINT_Pos  (4UL)                     /*!< TXUNDERRUNINT (Bit 4)                                 */
#define EMAC_INTSTATUS_TXUNDERRUNINT_Msk  (0x10UL)                  /*!< TXUNDERRUNINT (Bitfield-Mask: 0x01)                   */
#define EMAC_INTSTATUS_TXERRORINT_Pos     (5UL)                     /*!< TXERRORINT (Bit 5)                                    */
#define EMAC_INTSTATUS_TXERRORINT_Msk     (0x20UL)                  /*!< TXERRORINT (Bitfield-Mask: 0x01)                      */
#define EMAC_INTSTATUS_TXFINISHEDINT_Pos  (6UL)                     /*!< TXFINISHEDINT (Bit 6)                                 */
#define EMAC_INTSTATUS_TXFINISHEDINT_Msk  (0x40UL)                  /*!< TXFINISHEDINT (Bitfield-Mask: 0x01)                   */
#define EMAC_INTSTATUS_TXDONEINT_Pos      (7UL)                     /*!< TXDONEINT (Bit 7)                                     */
#define EMAC_INTSTATUS_TXDONEINT_Msk      (0x80UL)                  /*!< TXDONEINT (Bitfield-Mask: 0x01)                       */
#define EMAC_INTSTATUS_SOFTINT_Pos        (12UL)                    /*!< SOFTINT (Bit 12)                                      */
#define EMAC_INTSTATUS_SOFTINT_Msk        (0x1000UL)                /*!< SOFTINT (Bitfield-Mask: 0x01)                         */
#define EMAC_INTSTATUS_WAKEUPINT_Pos      (13UL)                    /*!< WAKEUPINT (Bit 13)                                    */
#define EMAC_INTSTATUS_WAKEUPINT_Msk      (0x2000UL)                /*!< WAKEUPINT (Bitfield-Mask: 0x01)                       */
/* =======================================================  INTENABLE  ======================================================= */
#define EMAC_INTENABLE_RXOVERRUNINTEN_Pos (0UL)                     /*!< RXOVERRUNINTEN (Bit 0)                                */
#define EMAC_INTENABLE_RXOVERRUNINTEN_Msk (0x1UL)                   /*!< RXOVERRUNINTEN (Bitfield-Mask: 0x01)                  */
#define EMAC_INTENABLE_RXERRORINTEN_Pos   (1UL)                     /*!< RXERRORINTEN (Bit 1)                                  */
#define EMAC_INTENABLE_RXERRORINTEN_Msk   (0x2UL)                   /*!< RXERRORINTEN (Bitfield-Mask: 0x01)                    */
#define EMAC_INTENABLE_RXFINISHEDINTEN_Pos (2UL)                    /*!< RXFINISHEDINTEN (Bit 2)                               */
#define EMAC_INTENABLE_RXFINISHEDINTEN_Msk (0x4UL)                  /*!< RXFINISHEDINTEN (Bitfield-Mask: 0x01)                 */
#define EMAC_INTENABLE_RXDONEINTEN_Pos    (3UL)                     /*!< RXDONEINTEN (Bit 3)                                   */
#define EMAC_INTENABLE_RXDONEINTEN_Msk    (0x8UL)                   /*!< RXDONEINTEN (Bitfield-Mask: 0x01)                     */
#define EMAC_INTENABLE_TXUNDERRUNINTEN_Pos (4UL)                    /*!< TXUNDERRUNINTEN (Bit 4)                               */
#define EMAC_INTENABLE_TXUNDERRUNINTEN_Msk (0x10UL)                 /*!< TXUNDERRUNINTEN (Bitfield-Mask: 0x01)                 */
#define EMAC_INTENABLE_TXERRORINTEN_Pos   (5UL)                     /*!< TXERRORINTEN (Bit 5)                                  */
#define EMAC_INTENABLE_TXERRORINTEN_Msk   (0x20UL)                  /*!< TXERRORINTEN (Bitfield-Mask: 0x01)                    */
#define EMAC_INTENABLE_TXFINISHEDINTEN_Pos (6UL)                    /*!< TXFINISHEDINTEN (Bit 6)                               */
#define EMAC_INTENABLE_TXFINISHEDINTEN_Msk (0x40UL)                 /*!< TXFINISHEDINTEN (Bitfield-Mask: 0x01)                 */
#define EMAC_INTENABLE_TXDONEINTEN_Pos    (7UL)                     /*!< TXDONEINTEN (Bit 7)                                   */
#define EMAC_INTENABLE_TXDONEINTEN_Msk    (0x80UL)                  /*!< TXDONEINTEN (Bitfield-Mask: 0x01)                     */
#define EMAC_INTENABLE_SOFTINTEN_Pos      (12UL)                    /*!< SOFTINTEN (Bit 12)                                    */
#define EMAC_INTENABLE_SOFTINTEN_Msk      (0x1000UL)                /*!< SOFTINTEN (Bitfield-Mask: 0x01)                       */
#define EMAC_INTENABLE_WAKEUPINTEN_Pos    (13UL)                    /*!< WAKEUPINTEN (Bit 13)                                  */
#define EMAC_INTENABLE_WAKEUPINTEN_Msk    (0x2000UL)                /*!< WAKEUPINTEN (Bitfield-Mask: 0x01)                     */
/* =======================================================  INTCLEAR  ======================================================== */
#define EMAC_INTCLEAR_RXOVERRUNINTCLR_Pos (0UL)                     /*!< RXOVERRUNINTCLR (Bit 0)                               */
#define EMAC_INTCLEAR_RXOVERRUNINTCLR_Msk (0x1UL)                   /*!< RXOVERRUNINTCLR (Bitfield-Mask: 0x01)                 */
#define EMAC_INTCLEAR_RXERRORINTCLR_Pos   (1UL)                     /*!< RXERRORINTCLR (Bit 1)                                 */
#define EMAC_INTCLEAR_RXERRORINTCLR_Msk   (0x2UL)                   /*!< RXERRORINTCLR (Bitfield-Mask: 0x01)                   */
#define EMAC_INTCLEAR_RXFINISHEDINTCLR_Pos (2UL)                    /*!< RXFINISHEDINTCLR (Bit 2)                              */
#define EMAC_INTCLEAR_RXFINISHEDINTCLR_Msk (0x4UL)                  /*!< RXFINISHEDINTCLR (Bitfield-Mask: 0x01)                */
