lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define EMAC_INTCLEAR_RXDONEINTCLR_Pos    (3UL)                     /*!< RXDONEINTCLR (Bit 3)                                  */
#define EMAC_INTCLEAR_RXDONEINTCLR_Msk    (0x8UL)                   /*!< RXDONEINTCLR (Bitfield-Mask: 0x01)                    */
#define EMAC_INTCLEAR_TXUNDERRUNINTCLR_Pos (4UL)                    /*!< TXUNDERRUNINTCLR (Bit 4)                              */
#define EMAC_INTCLEAR_TXUNDERRUNINTCLR_Msk (0x10UL)                 /*!< TXUNDERRUNINTCLR (Bitfield-Mask: 0x01)                */
#define EMAC_INTCLEAR_TXERRORINTCLR_Pos   (5UL)                     /*!< TXERRORINTCLR (Bit 5)                                 */
#define EMAC_INTCLEAR_TXERRORINTCLR_Msk   (0x20UL)                  /*!< TXERRORINTCLR (Bitfield-Mask: 0x01)                   */
#define EMAC_INTCLEAR_TXFINISHEDINTCLR_Pos (6UL)                    /*!< TXFINISHEDINTCLR (Bit 6)                              */
#define EMAC_INTCLEAR_TXFINISHEDINTCLR_Msk (0x40UL)                 /*!< TXFINISHEDINTCLR (Bitfield-Mask: 0x01)                */
#define EMAC_INTCLEAR_TXDONEINTCLR_Pos    (7UL)                     /*!< TXDONEINTCLR (Bit 7)                                  */
#define EMAC_INTCLEAR_TXDONEINTCLR_Msk    (0x80UL)                  /*!< TXDONEINTCLR (Bitfield-Mask: 0x01)                    */
#define EMAC_INTCLEAR_SOFTINTCLR_Pos      (12UL)                    /*!< SOFTINTCLR (Bit 12)                                   */
#define EMAC_INTCLEAR_SOFTINTCLR_Msk      (0x1000UL)                /*!< SOFTINTCLR (Bitfield-Mask: 0x01)                      */
#define EMAC_INTCLEAR_WAKEUPINTCLR_Pos    (13UL)                    /*!< WAKEUPINTCLR (Bit 13)                                 */
#define EMAC_INTCLEAR_WAKEUPINTCLR_Msk    (0x2000UL)                /*!< WAKEUPINTCLR (Bitfield-Mask: 0x01)                    */
/* ========================================================  INTSET  ========================================================= */
#define EMAC_INTSET_RXOVERRUNINTSET_Pos   (0UL)                     /*!< RXOVERRUNINTSET (Bit 0)                               */
#define EMAC_INTSET_RXOVERRUNINTSET_Msk   (0x1UL)                   /*!< RXOVERRUNINTSET (Bitfield-Mask: 0x01)                 */
#define EMAC_INTSET_RXERRORINTSET_Pos     (1UL)                     /*!< RXERRORINTSET (Bit 1)                                 */
#define EMAC_INTSET_RXERRORINTSET_Msk     (0x2UL)                   /*!< RXERRORINTSET (Bitfield-Mask: 0x01)                   */
#define EMAC_INTSET_RXFINISHEDINTSET_Pos  (2UL)                     /*!< RXFINISHEDINTSET (Bit 2)                              */
#define EMAC_INTSET_RXFINISHEDINTSET_Msk  (0x4UL)                   /*!< RXFINISHEDINTSET (Bitfield-Mask: 0x01)                */
#define EMAC_INTSET_RXDONEINTSET_Pos      (3UL)                     /*!< RXDONEINTSET (Bit 3)                                  */
#define EMAC_INTSET_RXDONEINTSET_Msk      (0x8UL)                   /*!< RXDONEINTSET (Bitfield-Mask: 0x01)                    */
#define EMAC_INTSET_TXUNDERRUNINTSET_Pos  (4UL)                     /*!< TXUNDERRUNINTSET (Bit 4)                              */
#define EMAC_INTSET_TXUNDERRUNINTSET_Msk  (0x10UL)                  /*!< TXUNDERRUNINTSET (Bitfield-Mask: 0x01)                */
#define EMAC_INTSET_TXERRORINTSET_Pos     (5UL)                     /*!< TXERRORINTSET (Bit 5)                                 */
#define EMAC_INTSET_TXERRORINTSET_Msk     (0x20UL)                  /*!< TXERRORINTSET (Bitfield-Mask: 0x01)                   */
#define EMAC_INTSET_TXFINISHEDINTSET_Pos  (6UL)                     /*!< TXFINISHEDINTSET (Bit 6)                              */
#define EMAC_INTSET_TXFINISHEDINTSET_Msk  (0x40UL)                  /*!< TXFINISHEDINTSET (Bitfield-Mask: 0x01)                */
#define EMAC_INTSET_TXDONEINTSET_Pos      (7UL)                     /*!< TXDONEINTSET (Bit 7)                                  */
#define EMAC_INTSET_TXDONEINTSET_Msk      (0x80UL)                  /*!< TXDONEINTSET (Bitfield-Mask: 0x01)                    */
#define EMAC_INTSET_SOFTINTSET_Pos        (12UL)                    /*!< SOFTINTSET (Bit 12)                                   */
#define EMAC_INTSET_SOFTINTSET_Msk        (0x1000UL)                /*!< SOFTINTSET (Bitfield-Mask: 0x01)                      */
#define EMAC_INTSET_WAKEUPINTSET_Pos      (13UL)                    /*!< WAKEUPINTSET (Bit 13)                                 */
#define EMAC_INTSET_WAKEUPINTSET_Msk      (0x2000UL)                /*!< WAKEUPINTSET (Bitfield-Mask: 0x01)                    */
/* =======================================================  POWERDOWN  ======================================================= */
#define EMAC_POWERDOWN_PD_Pos             (31UL)                    /*!< PD (Bit 31)                                           */
#define EMAC_POWERDOWN_PD_Msk             (0x80000000UL)            /*!< PD (Bitfield-Mask: 0x01)                              */


/* =========================================================================================================================== */
/* ================                                         LPC_GPDMA                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  INTSTAT  ======================================================== */
#define GPDMA_INTSTAT_INTSTAT0_Pos        (0UL)                     /*!< INTSTAT0 (Bit 0)                                      */
#define GPDMA_INTSTAT_INTSTAT0_Msk        (0x1UL)                   /*!< INTSTAT0 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT1_Pos        (1UL)                     /*!< INTSTAT1 (Bit 1)                                      */
#define GPDMA_INTSTAT_INTSTAT1_Msk        (0x2UL)                   /*!< INTSTAT1 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT2_Pos        (2UL)                     /*!< INTSTAT2 (Bit 2)                                      */
#define GPDMA_INTSTAT_INTSTAT2_Msk        (0x4UL)                   /*!< INTSTAT2 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT3_Pos        (3UL)                     /*!< INTSTAT3 (Bit 3)                                      */
#define GPDMA_INTSTAT_INTSTAT3_Msk        (0x8UL)                   /*!< INTSTAT3 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT4_Pos        (4UL)                     /*!< INTSTAT4 (Bit 4)                                      */
#define GPDMA_INTSTAT_INTSTAT4_Msk        (0x10UL)                  /*!< INTSTAT4 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT5_Pos        (5UL)                     /*!< INTSTAT5 (Bit 5)                                      */
#define GPDMA_INTSTAT_INTSTAT5_Msk        (0x20UL)                  /*!< INTSTAT5 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT6_Pos        (6UL)                     /*!< INTSTAT6 (Bit 6)                                      */
#define GPDMA_INTSTAT_INTSTAT6_Msk        (0x40UL)                  /*!< INTSTAT6 (Bitfield-Mask: 0x01)                        */
#define GPDMA_INTSTAT_INTSTAT7_Pos        (7UL)                     /*!< INTSTAT7 (Bit 7)                                      */
#define GPDMA_INTSTAT_INTSTAT7_Msk        (0x80UL)                  /*!< INTSTAT7 (Bitfield-Mask: 0x01)                        */
/* =======================================================  INTTCSTAT  ======================================================= */
#define GPDMA_INTTCSTAT_INTTCSTAT0_Pos    (0UL)                     /*!< INTTCSTAT0 (Bit 0)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT0_Msk    (0x1UL)                   /*!< INTTCSTAT0 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT1_Pos    (1UL)                     /*!< INTTCSTAT1 (Bit 1)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT1_Msk    (0x2UL)                   /*!< INTTCSTAT1 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT2_Pos    (2UL)                     /*!< INTTCSTAT2 (Bit 2)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT2_Msk    (0x4UL)                   /*!< INTTCSTAT2 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT3_Pos    (3UL)                     /*!< INTTCSTAT3 (Bit 3)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT3_Msk    (0x8UL)                   /*!< INTTCSTAT3 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT4_Pos    (4UL)                     /*!< INTTCSTAT4 (Bit 4)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT4_Msk    (0x10UL)                  /*!< INTTCSTAT4 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT5_Pos    (5UL)                     /*!< INTTCSTAT5 (Bit 5)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT5_Msk    (0x20UL)                  /*!< INTTCSTAT5 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT6_Pos    (6UL)                     /*!< INTTCSTAT6 (Bit 6)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT6_Msk    (0x40UL)                  /*!< INTTCSTAT6 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTTCSTAT_INTTCSTAT7_Pos    (7UL)                     /*!< INTTCSTAT7 (Bit 7)                                    */
#define GPDMA_INTTCSTAT_INTTCSTAT7_Msk    (0x80UL)                  /*!< INTTCSTAT7 (Bitfield-Mask: 0x01)                      */
/* ======================================================  INTTCCLEAR  ======================================================= */
#define GPDMA_INTTCCLEAR_INTTCCLEAR0_Pos  (0UL)                     /*!< INTTCCLEAR0 (Bit 0)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR0_Msk  (0x1UL)                   /*!< INTTCCLEAR0 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR1_Pos  (1UL)                     /*!< INTTCCLEAR1 (Bit 1)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR1_Msk  (0x2UL)                   /*!< INTTCCLEAR1 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR2_Pos  (2UL)                     /*!< INTTCCLEAR2 (Bit 2)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR2_Msk  (0x4UL)                   /*!< INTTCCLEAR2 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR3_Pos  (3UL)                     /*!< INTTCCLEAR3 (Bit 3)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR3_Msk  (0x8UL)                   /*!< INTTCCLEAR3 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR4_Pos  (4UL)                     /*!< INTTCCLEAR4 (Bit 4)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR4_Msk  (0x10UL)                  /*!< INTTCCLEAR4 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR5_Pos  (5UL)                     /*!< INTTCCLEAR5 (Bit 5)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR5_Msk  (0x20UL)                  /*!< INTTCCLEAR5 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR6_Pos  (6UL)                     /*!< INTTCCLEAR6 (Bit 6)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR6_Msk  (0x40UL)                  /*!< INTTCCLEAR6 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTTCCLEAR_INTTCCLEAR7_Pos  (7UL)                     /*!< INTTCCLEAR7 (Bit 7)                                   */
#define GPDMA_INTTCCLEAR_INTTCCLEAR7_Msk  (0x80UL)                  /*!< INTTCCLEAR7 (Bitfield-Mask: 0x01)                     */
/* ======================================================  INTERRSTAT  ======================================================= */
#define GPDMA_INTERRSTAT_INTERRSTAT0_Pos  (0UL)                     /*!< INTERRSTAT0 (Bit 0)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT0_Msk  (0x1UL)                   /*!< INTERRSTAT0 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT1_Pos  (1UL)                     /*!< INTERRSTAT1 (Bit 1)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT1_Msk  (0x2UL)                   /*!< INTERRSTAT1 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT2_Pos  (2UL)                     /*!< INTERRSTAT2 (Bit 2)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT2_Msk  (0x4UL)                   /*!< INTERRSTAT2 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT3_Pos  (3UL)                     /*!< INTERRSTAT3 (Bit 3)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT3_Msk  (0x8UL)                   /*!< INTERRSTAT3 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT4_Pos  (4UL)                     /*!< INTERRSTAT4 (Bit 4)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT4_Msk  (0x10UL)                  /*!< INTERRSTAT4 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT5_Pos  (5UL)                     /*!< INTERRSTAT5 (Bit 5)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT5_Msk  (0x20UL)                  /*!< INTERRSTAT5 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT6_Pos  (6UL)                     /*!< INTERRSTAT6 (Bit 6)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT6_Msk  (0x40UL)                  /*!< INTERRSTAT6 (Bitfield-Mask: 0x01)                     */
#define GPDMA_INTERRSTAT_INTERRSTAT7_Pos  (7UL)                     /*!< INTERRSTAT7 (Bit 7)                                   */
#define GPDMA_INTERRSTAT_INTERRSTAT7_Msk  (0x80UL)                  /*!< INTERRSTAT7 (Bitfield-Mask: 0x01)                     */
/* =======================================================  INTERRCLR  ======================================================= */
#define GPDMA_INTERRCLR_INTERRCLR0_Pos    (0UL)                     /*!< INTERRCLR0 (Bit 0)                                    */
#define GPDMA_INTERRCLR_INTERRCLR0_Msk    (0x1UL)                   /*!< INTERRCLR0 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR1_Pos    (1UL)                     /*!< INTERRCLR1 (Bit 1)                                    */
#define GPDMA_INTERRCLR_INTERRCLR1_Msk    (0x2UL)                   /*!< INTERRCLR1 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR2_Pos    (2UL)                     /*!< INTERRCLR2 (Bit 2)                                    */
#define GPDMA_INTERRCLR_INTERRCLR2_Msk    (0x4UL)                   /*!< INTERRCLR2 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR3_Pos    (3UL)                     /*!< INTERRCLR3 (Bit 3)                                    */
#define GPDMA_INTERRCLR_INTERRCLR3_Msk    (0x8UL)                   /*!< INTERRCLR3 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR4_Pos    (4UL)                     /*!< INTERRCLR4 (Bit 4)                                    */
#define GPDMA_INTERRCLR_INTERRCLR4_Msk    (0x10UL)                  /*!< INTERRCLR4 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR5_Pos    (5UL)                     /*!< INTERRCLR5 (Bit 5)                                    */
#define GPDMA_INTERRCLR_INTERRCLR5_Msk    (0x20UL)                  /*!< INTERRCLR5 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR6_Pos    (6UL)                     /*!< INTERRCLR6 (Bit 6)                                    */
#define GPDMA_INTERRCLR_INTERRCLR6_Msk    (0x40UL)                  /*!< INTERRCLR6 (Bitfield-Mask: 0x01)                      */
#define GPDMA_INTERRCLR_INTERRCLR7_Pos    (7UL)                     /*!< INTERRCLR7 (Bit 7)                                    */
#define GPDMA_INTERRCLR_INTERRCLR7_Msk    (0x80UL)                  /*!< INTERRCLR7 (Bitfield-Mask: 0x01)                      */
/* =====================================================  RAWINTTCSTAT  ====================================================== */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT0_Pos (0UL)                  /*!< RAWINTTCSTAT0 (Bit 0)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT0_Msk (0x1UL)                /*!< RAWINTTCSTAT0 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT1_Pos (1UL)                  /*!< RAWINTTCSTAT1 (Bit 1)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT1_Msk (0x2UL)                /*!< RAWINTTCSTAT1 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT2_Pos (2UL)                  /*!< RAWINTTCSTAT2 (Bit 2)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT2_Msk (0x4UL)                /*!< RAWINTTCSTAT2 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT3_Pos (3UL)                  /*!< RAWINTTCSTAT3 (Bit 3)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT3_Msk (0x8UL)                /*!< RAWINTTCSTAT3 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT4_Pos (4UL)                  /*!< RAWINTTCSTAT4 (Bit 4)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT4_Msk (0x10UL)               /*!< RAWINTTCSTAT4 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT5_Pos (5UL)                  /*!< RAWINTTCSTAT5 (Bit 5)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT5_Msk (0x20UL)               /*!< RAWINTTCSTAT5 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT6_Pos (6UL)                  /*!< RAWINTTCSTAT6 (Bit 6)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT6_Msk (0x40UL)               /*!< RAWINTTCSTAT6 (Bitfield-Mask: 0x01)                   */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT7_Pos (7UL)                  /*!< RAWINTTCSTAT7 (Bit 7)                                 */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT7_Msk (0x80UL)               /*!< RAWINTTCSTAT7 (Bitfield-Mask: 0x01)                   */
/* =====================================================  RAWINTERRSTAT  ===================================================== */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT0_Pos (0UL)                /*!< RAWINTERRSTAT0 (Bit 0)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT0_Msk (0x1UL)              /*!< RAWINTERRSTAT0 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT1_Pos (1UL)                /*!< RAWINTERRSTAT1 (Bit 1)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT1_Msk (0x2UL)              /*!< RAWINTERRSTAT1 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT2_Pos (2UL)                /*!< RAWINTERRSTAT2 (Bit 2)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT2_Msk (0x4UL)              /*!< RAWINTERRSTAT2 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT3_Pos (3UL)                /*!< RAWINTERRSTAT3 (Bit 3)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT3_Msk (0x8UL)              /*!< RAWINTERRSTAT3 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT4_Pos (4UL)                /*!< RAWINTERRSTAT4 (Bit 4)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT4_Msk (0x10UL)             /*!< RAWINTERRSTAT4 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT5_Pos (5UL)                /*!< RAWINTERRSTAT5 (Bit 5)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT5_Msk (0x20UL)             /*!< RAWINTERRSTAT5 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT6_Pos (6UL)                /*!< RAWINTERRSTAT6 (Bit 6)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT6_Msk (0x40UL)             /*!< RAWINTERRSTAT6 (Bitfield-Mask: 0x01)                  */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT7_Pos (7UL)                /*!< RAWINTERRSTAT7 (Bit 7)                                */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT7_Msk (0x80UL)             /*!< RAWINTERRSTAT7 (Bitfield-Mask: 0x01)                  */
/* =======================================================  ENBLDCHNS  ======================================================= */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS0_Pos (0UL)                  /*!< ENABLEDCHANNELS0 (Bit 0)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS0_Msk (0x1UL)                /*!< ENABLEDCHANNELS0 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS1_Pos (1UL)                  /*!< ENABLEDCHANNELS1 (Bit 1)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS1_Msk (0x2UL)                /*!< ENABLEDCHANNELS1 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS2_Pos (2UL)                  /*!< ENABLEDCHANNELS2 (Bit 2)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS2_Msk (0x4UL)                /*!< ENABLEDCHANNELS2 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS3_Pos (3UL)                  /*!< ENABLEDCHANNELS3 (Bit 3)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS3_Msk (0x8UL)                /*!< ENABLEDCHANNELS3 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS4_Pos (4UL)                  /*!< ENABLEDCHANNELS4 (Bit 4)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS4_Msk (0x10UL)               /*!< ENABLEDCHANNELS4 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS5_Pos (5UL)                  /*!< ENABLEDCHANNELS5 (Bit 5)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS5_Msk (0x20UL)               /*!< ENABLEDCHANNELS5 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS6_Pos (6UL)                  /*!< ENABLEDCHANNELS6 (Bit 6)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS6_Msk (0x40UL)               /*!< ENABLEDCHANNELS6 (Bitfield-Mask: 0x01)                */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS7_Pos (7UL)                  /*!< ENABLEDCHANNELS7 (Bit 7)                              */
#define GPDMA_ENBLDCHNS_ENABLEDCHANNELS7_Msk (0x80UL)               /*!< ENABLEDCHANNELS7 (Bitfield-Mask: 0x01)                */
/* =======================================================  SOFTBREQ  ======================================================== */
#define GPDMA_SOFTBREQ_SOFTBREQ0_Pos      (0UL)                     /*!< SOFTBREQ0 (Bit 0)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ0_Msk      (0x1UL)                   /*!< SOFTBREQ0 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ1_Pos      (1UL)                     /*!< SOFTBREQ1 (Bit 1)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ1_Msk      (0x2UL)                   /*!< SOFTBREQ1 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ2_Pos      (2UL)                     /*!< SOFTBREQ2 (Bit 2)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ2_Msk      (0x4UL)                   /*!< SOFTBREQ2 (Bitfield-Mask: 0x01)                       */
