lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPDMA_SOFTBREQ_SOFTBREQ3_Pos      (3UL)                     /*!< SOFTBREQ3 (Bit 3)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ3_Msk      (0x8UL)                   /*!< SOFTBREQ3 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ4_Pos      (4UL)                     /*!< SOFTBREQ4 (Bit 4)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ4_Msk      (0x10UL)                  /*!< SOFTBREQ4 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ5_Pos      (5UL)                     /*!< SOFTBREQ5 (Bit 5)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ5_Msk      (0x20UL)                  /*!< SOFTBREQ5 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ6_Pos      (6UL)                     /*!< SOFTBREQ6 (Bit 6)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ6_Msk      (0x40UL)                  /*!< SOFTBREQ6 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ7_Pos      (7UL)                     /*!< SOFTBREQ7 (Bit 7)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ7_Msk      (0x80UL)                  /*!< SOFTBREQ7 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ8_Pos      (8UL)                     /*!< SOFTBREQ8 (Bit 8)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ8_Msk      (0x100UL)                 /*!< SOFTBREQ8 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ9_Pos      (9UL)                     /*!< SOFTBREQ9 (Bit 9)                                     */
#define GPDMA_SOFTBREQ_SOFTBREQ9_Msk      (0x200UL)                 /*!< SOFTBREQ9 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTBREQ_SOFTBREQ10_Pos     (10UL)                    /*!< SOFTBREQ10 (Bit 10)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ10_Msk     (0x400UL)                 /*!< SOFTBREQ10 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTBREQ_SOFTBREQ11_Pos     (11UL)                    /*!< SOFTBREQ11 (Bit 11)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ11_Msk     (0x800UL)                 /*!< SOFTBREQ11 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTBREQ_SOFTBREQ12_Pos     (12UL)                    /*!< SOFTBREQ12 (Bit 12)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ12_Msk     (0x1000UL)                /*!< SOFTBREQ12 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTBREQ_SOFTBREQ13_Pos     (13UL)                    /*!< SOFTBREQ13 (Bit 13)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ13_Msk     (0x2000UL)                /*!< SOFTBREQ13 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTBREQ_SOFTBREQ14_Pos     (14UL)                    /*!< SOFTBREQ14 (Bit 14)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ14_Msk     (0x4000UL)                /*!< SOFTBREQ14 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTBREQ_SOFTBREQ15_Pos     (15UL)                    /*!< SOFTBREQ15 (Bit 15)                                   */
#define GPDMA_SOFTBREQ_SOFTBREQ15_Msk     (0x8000UL)                /*!< SOFTBREQ15 (Bitfield-Mask: 0x01)                      */
/* =======================================================  SOFTSREQ  ======================================================== */
#define GPDMA_SOFTSREQ_SOFTSREQ0_Pos      (0UL)                     /*!< SOFTSREQ0 (Bit 0)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ0_Msk      (0x1UL)                   /*!< SOFTSREQ0 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ1_Pos      (1UL)                     /*!< SOFTSREQ1 (Bit 1)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ1_Msk      (0x2UL)                   /*!< SOFTSREQ1 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ2_Pos      (2UL)                     /*!< SOFTSREQ2 (Bit 2)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ2_Msk      (0x4UL)                   /*!< SOFTSREQ2 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ3_Pos      (3UL)                     /*!< SOFTSREQ3 (Bit 3)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ3_Msk      (0x8UL)                   /*!< SOFTSREQ3 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ4_Pos      (4UL)                     /*!< SOFTSREQ4 (Bit 4)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ4_Msk      (0x10UL)                  /*!< SOFTSREQ4 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ5_Pos      (5UL)                     /*!< SOFTSREQ5 (Bit 5)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ5_Msk      (0x20UL)                  /*!< SOFTSREQ5 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ6_Pos      (6UL)                     /*!< SOFTSREQ6 (Bit 6)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ6_Msk      (0x40UL)                  /*!< SOFTSREQ6 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ7_Pos      (7UL)                     /*!< SOFTSREQ7 (Bit 7)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ7_Msk      (0x80UL)                  /*!< SOFTSREQ7 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ8_Pos      (8UL)                     /*!< SOFTSREQ8 (Bit 8)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ8_Msk      (0x100UL)                 /*!< SOFTSREQ8 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ9_Pos      (9UL)                     /*!< SOFTSREQ9 (Bit 9)                                     */
#define GPDMA_SOFTSREQ_SOFTSREQ9_Msk      (0x200UL)                 /*!< SOFTSREQ9 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SOFTSREQ_SOFTSREQ10_Pos     (10UL)                    /*!< SOFTSREQ10 (Bit 10)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ10_Msk     (0x400UL)                 /*!< SOFTSREQ10 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTSREQ_SOFTSREQ11_Pos     (11UL)                    /*!< SOFTSREQ11 (Bit 11)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ11_Msk     (0x800UL)                 /*!< SOFTSREQ11 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTSREQ_SOFTSREQ12_Pos     (12UL)                    /*!< SOFTSREQ12 (Bit 12)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ12_Msk     (0x1000UL)                /*!< SOFTSREQ12 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTSREQ_SOFTSREQ13_Pos     (13UL)                    /*!< SOFTSREQ13 (Bit 13)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ13_Msk     (0x2000UL)                /*!< SOFTSREQ13 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTSREQ_SOFTSREQ14_Pos     (14UL)                    /*!< SOFTSREQ14 (Bit 14)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ14_Msk     (0x4000UL)                /*!< SOFTSREQ14 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTSREQ_SOFTSREQ15_Pos     (15UL)                    /*!< SOFTSREQ15 (Bit 15)                                   */
#define GPDMA_SOFTSREQ_SOFTSREQ15_Msk     (0x8000UL)                /*!< SOFTSREQ15 (Bitfield-Mask: 0x01)                      */
/* =======================================================  SOFTLBREQ  ======================================================= */
#define GPDMA_SOFTLBREQ_SOFTLBREQ0_Pos    (0UL)                     /*!< SOFTLBREQ0 (Bit 0)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ0_Msk    (0x1UL)                   /*!< SOFTLBREQ0 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ1_Pos    (1UL)                     /*!< SOFTLBREQ1 (Bit 1)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ1_Msk    (0x2UL)                   /*!< SOFTLBREQ1 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ2_Pos    (2UL)                     /*!< SOFTLBREQ2 (Bit 2)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ2_Msk    (0x4UL)                   /*!< SOFTLBREQ2 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ3_Pos    (3UL)                     /*!< SOFTLBREQ3 (Bit 3)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ3_Msk    (0x8UL)                   /*!< SOFTLBREQ3 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ4_Pos    (4UL)                     /*!< SOFTLBREQ4 (Bit 4)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ4_Msk    (0x10UL)                  /*!< SOFTLBREQ4 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ5_Pos    (5UL)                     /*!< SOFTLBREQ5 (Bit 5)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ5_Msk    (0x20UL)                  /*!< SOFTLBREQ5 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ6_Pos    (6UL)                     /*!< SOFTLBREQ6 (Bit 6)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ6_Msk    (0x40UL)                  /*!< SOFTLBREQ6 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ7_Pos    (7UL)                     /*!< SOFTLBREQ7 (Bit 7)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ7_Msk    (0x80UL)                  /*!< SOFTLBREQ7 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ8_Pos    (8UL)                     /*!< SOFTLBREQ8 (Bit 8)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ8_Msk    (0x100UL)                 /*!< SOFTLBREQ8 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ9_Pos    (9UL)                     /*!< SOFTLBREQ9 (Bit 9)                                    */
#define GPDMA_SOFTLBREQ_SOFTLBREQ9_Msk    (0x200UL)                 /*!< SOFTLBREQ9 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLBREQ_SOFTLBREQ10_Pos   (10UL)                    /*!< SOFTLBREQ10 (Bit 10)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ10_Msk   (0x400UL)                 /*!< SOFTLBREQ10 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLBREQ_SOFTLBREQ11_Pos   (11UL)                    /*!< SOFTLBREQ11 (Bit 11)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ11_Msk   (0x800UL)                 /*!< SOFTLBREQ11 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLBREQ_SOFTLBREQ12_Pos   (12UL)                    /*!< SOFTLBREQ12 (Bit 12)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ12_Msk   (0x1000UL)                /*!< SOFTLBREQ12 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLBREQ_SOFTLBREQ13_Pos   (13UL)                    /*!< SOFTLBREQ13 (Bit 13)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ13_Msk   (0x2000UL)                /*!< SOFTLBREQ13 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLBREQ_SOFTLBREQ14_Pos   (14UL)                    /*!< SOFTLBREQ14 (Bit 14)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ14_Msk   (0x4000UL)                /*!< SOFTLBREQ14 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLBREQ_SOFTLBREQ15_Pos   (15UL)                    /*!< SOFTLBREQ15 (Bit 15)                                  */
#define GPDMA_SOFTLBREQ_SOFTLBREQ15_Msk   (0x8000UL)                /*!< SOFTLBREQ15 (Bitfield-Mask: 0x01)                     */
/* =======================================================  SOFTLSREQ  ======================================================= */
#define GPDMA_SOFTLSREQ_SOFTLSREQ0_Pos    (0UL)                     /*!< SOFTLSREQ0 (Bit 0)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ0_Msk    (0x1UL)                   /*!< SOFTLSREQ0 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ1_Pos    (1UL)                     /*!< SOFTLSREQ1 (Bit 1)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ1_Msk    (0x2UL)                   /*!< SOFTLSREQ1 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ2_Pos    (2UL)                     /*!< SOFTLSREQ2 (Bit 2)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ2_Msk    (0x4UL)                   /*!< SOFTLSREQ2 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ3_Pos    (3UL)                     /*!< SOFTLSREQ3 (Bit 3)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ3_Msk    (0x8UL)                   /*!< SOFTLSREQ3 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ4_Pos    (4UL)                     /*!< SOFTLSREQ4 (Bit 4)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ4_Msk    (0x10UL)                  /*!< SOFTLSREQ4 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ5_Pos    (5UL)                     /*!< SOFTLSREQ5 (Bit 5)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ5_Msk    (0x20UL)                  /*!< SOFTLSREQ5 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ6_Pos    (6UL)                     /*!< SOFTLSREQ6 (Bit 6)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ6_Msk    (0x40UL)                  /*!< SOFTLSREQ6 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ7_Pos    (7UL)                     /*!< SOFTLSREQ7 (Bit 7)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ7_Msk    (0x80UL)                  /*!< SOFTLSREQ7 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ8_Pos    (8UL)                     /*!< SOFTLSREQ8 (Bit 8)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ8_Msk    (0x100UL)                 /*!< SOFTLSREQ8 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ9_Pos    (9UL)                     /*!< SOFTLSREQ9 (Bit 9)                                    */
#define GPDMA_SOFTLSREQ_SOFTLSREQ9_Msk    (0x200UL)                 /*!< SOFTLSREQ9 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SOFTLSREQ_SOFTLSREQ10_Pos   (10UL)                    /*!< SOFTLSREQ10 (Bit 10)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ10_Msk   (0x400UL)                 /*!< SOFTLSREQ10 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLSREQ_SOFTLSREQ11_Pos   (11UL)                    /*!< SOFTLSREQ11 (Bit 11)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ11_Msk   (0x800UL)                 /*!< SOFTLSREQ11 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLSREQ_SOFTLSREQ12_Pos   (12UL)                    /*!< SOFTLSREQ12 (Bit 12)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ12_Msk   (0x1000UL)                /*!< SOFTLSREQ12 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLSREQ_SOFTLSREQ13_Pos   (13UL)                    /*!< SOFTLSREQ13 (Bit 13)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ13_Msk   (0x2000UL)                /*!< SOFTLSREQ13 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLSREQ_SOFTLSREQ14_Pos   (14UL)                    /*!< SOFTLSREQ14 (Bit 14)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ14_Msk   (0x4000UL)                /*!< SOFTLSREQ14 (Bitfield-Mask: 0x01)                     */
#define GPDMA_SOFTLSREQ_SOFTLSREQ15_Pos   (15UL)                    /*!< SOFTLSREQ15 (Bit 15)                                  */
#define GPDMA_SOFTLSREQ_SOFTLSREQ15_Msk   (0x8000UL)                /*!< SOFTLSREQ15 (Bitfield-Mask: 0x01)                     */
/* ========================================================  CONFIG  ========================================================= */
#define GPDMA_CONFIG_E_Pos                (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG_E_Msk                (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG_M_Pos                (1UL)                     /*!< M (Bit 1)                                             */
#define GPDMA_CONFIG_M_Msk                (0x2UL)                   /*!< M (Bitfield-Mask: 0x01)                               */
/* =========================================================  SYNC  ========================================================== */
#define GPDMA_SYNC_DMACSYNC0_Pos          (0UL)                     /*!< DMACSYNC0 (Bit 0)                                     */
#define GPDMA_SYNC_DMACSYNC0_Msk          (0x1UL)                   /*!< DMACSYNC0 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC1_Pos          (1UL)                     /*!< DMACSYNC1 (Bit 1)                                     */
#define GPDMA_SYNC_DMACSYNC1_Msk          (0x2UL)                   /*!< DMACSYNC1 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC2_Pos          (2UL)                     /*!< DMACSYNC2 (Bit 2)                                     */
#define GPDMA_SYNC_DMACSYNC2_Msk          (0x4UL)                   /*!< DMACSYNC2 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC3_Pos          (3UL)                     /*!< DMACSYNC3 (Bit 3)                                     */
#define GPDMA_SYNC_DMACSYNC3_Msk          (0x8UL)                   /*!< DMACSYNC3 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC4_Pos          (4UL)                     /*!< DMACSYNC4 (Bit 4)                                     */
#define GPDMA_SYNC_DMACSYNC4_Msk          (0x10UL)                  /*!< DMACSYNC4 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC5_Pos          (5UL)                     /*!< DMACSYNC5 (Bit 5)                                     */
#define GPDMA_SYNC_DMACSYNC5_Msk          (0x20UL)                  /*!< DMACSYNC5 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC6_Pos          (6UL)                     /*!< DMACSYNC6 (Bit 6)                                     */
#define GPDMA_SYNC_DMACSYNC6_Msk          (0x40UL)                  /*!< DMACSYNC6 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC7_Pos          (7UL)                     /*!< DMACSYNC7 (Bit 7)                                     */
#define GPDMA_SYNC_DMACSYNC7_Msk          (0x80UL)                  /*!< DMACSYNC7 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC8_Pos          (8UL)                     /*!< DMACSYNC8 (Bit 8)                                     */
#define GPDMA_SYNC_DMACSYNC8_Msk          (0x100UL)                 /*!< DMACSYNC8 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC9_Pos          (9UL)                     /*!< DMACSYNC9 (Bit 9)                                     */
#define GPDMA_SYNC_DMACSYNC9_Msk          (0x200UL)                 /*!< DMACSYNC9 (Bitfield-Mask: 0x01)                       */
#define GPDMA_SYNC_DMACSYNC10_Pos         (10UL)                    /*!< DMACSYNC10 (Bit 10)                                   */
#define GPDMA_SYNC_DMACSYNC10_Msk         (0x400UL)                 /*!< DMACSYNC10 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SYNC_DMACSYNC11_Pos         (11UL)                    /*!< DMACSYNC11 (Bit 11)                                   */
#define GPDMA_SYNC_DMACSYNC11_Msk         (0x800UL)                 /*!< DMACSYNC11 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SYNC_DMACSYNC12_Pos         (12UL)                    /*!< DMACSYNC12 (Bit 12)                                   */
#define GPDMA_SYNC_DMACSYNC12_Msk         (0x1000UL)                /*!< DMACSYNC12 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SYNC_DMACSYNC13_Pos         (13UL)                    /*!< DMACSYNC13 (Bit 13)                                   */
#define GPDMA_SYNC_DMACSYNC13_Msk         (0x2000UL)                /*!< DMACSYNC13 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SYNC_DMACSYNC14_Pos         (14UL)                    /*!< DMACSYNC14 (Bit 14)                                   */
#define GPDMA_SYNC_DMACSYNC14_Msk         (0x4000UL)                /*!< DMACSYNC14 (Bitfield-Mask: 0x01)                      */
#define GPDMA_SYNC_DMACSYNC15_Pos         (15UL)                    /*!< DMACSYNC15 (Bit 15)                                   */
#define GPDMA_SYNC_DMACSYNC15_Msk         (0x8000UL)                /*!< DMACSYNC15 (Bitfield-Mask: 0x01)                      */
/* =======================================================  SRCADDR0  ======================================================== */
#define GPDMA_SRCADDR0_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR0_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR1  ======================================================== */
#define GPDMA_SRCADDR1_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR1_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR2  ======================================================== */
#define GPDMA_SRCADDR2_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR2_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR3  ======================================================== */
#define GPDMA_SRCADDR3_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR3_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR4  ======================================================== */
#define GPDMA_SRCADDR4_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR4_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR5  ======================================================== */
#define GPDMA_SRCADDR5_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR5_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  SRCADDR6  ======================================================== */
#define GPDMA_SRCADDR6_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR6_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
