lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* =======================================================  SRCADDR7  ======================================================== */
#define GPDMA_SRCADDR7_SRCADDR_Pos        (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define GPDMA_SRCADDR7_SRCADDR_Msk        (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DESTADDR0  ======================================================= */
#define GPDMA_DESTADDR0_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR0_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR1  ======================================================= */
#define GPDMA_DESTADDR1_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR1_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR2  ======================================================= */
#define GPDMA_DESTADDR2_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR2_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR3  ======================================================= */
#define GPDMA_DESTADDR3_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR3_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR4  ======================================================= */
#define GPDMA_DESTADDR4_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR4_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR5  ======================================================= */
#define GPDMA_DESTADDR5_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR5_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR6  ======================================================= */
#define GPDMA_DESTADDR6_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR6_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DESTADDR7  ======================================================= */
#define GPDMA_DESTADDR7_DESTADDR_Pos      (0UL)                     /*!< DESTADDR (Bit 0)                                      */
#define GPDMA_DESTADDR7_DESTADDR_Msk      (0xffffffffUL)            /*!< DESTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  LLI0  ========================================================== */
#define GPDMA_LLI0_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI0_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI1  ========================================================== */
#define GPDMA_LLI1_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI1_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI2  ========================================================== */
#define GPDMA_LLI2_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI2_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI3  ========================================================== */
#define GPDMA_LLI3_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI3_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI4  ========================================================== */
#define GPDMA_LLI4_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI4_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI5  ========================================================== */
#define GPDMA_LLI5_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI5_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI6  ========================================================== */
#define GPDMA_LLI6_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI6_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =========================================================  LLI7  ========================================================== */
#define GPDMA_LLI7_LLI_Pos                (2UL)                     /*!< LLI (Bit 2)                                           */
#define GPDMA_LLI7_LLI_Msk                (0xfffffffcUL)            /*!< LLI (Bitfield-Mask: 0x3fffffff)                       */
/* =======================================================  CONTROL0  ======================================================== */
#define GPDMA_CONTROL0_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL0_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL0_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL0_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL0_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL0_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL0_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL0_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL0_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL0_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL0_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL0_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL0_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL0_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL0_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL0_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL0_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL0_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL0_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL0_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL0_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL0_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL1  ======================================================== */
#define GPDMA_CONTROL1_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL1_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL1_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL1_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL1_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL1_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL1_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL1_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL1_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL1_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL1_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL1_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL1_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL1_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL1_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL1_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL1_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL1_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL1_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL1_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL1_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL1_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL2  ======================================================== */
#define GPDMA_CONTROL2_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL2_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL2_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL2_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL2_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL2_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL2_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL2_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL2_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL2_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL2_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL2_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL2_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL2_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL2_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL2_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL2_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL2_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL2_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL2_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL2_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL2_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL3  ======================================================== */
#define GPDMA_CONTROL3_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL3_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL3_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL3_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL3_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL3_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL3_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL3_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL3_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL3_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL3_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL3_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL3_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL3_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL3_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL3_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL3_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL3_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL3_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL3_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL3_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL3_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL4  ======================================================== */
#define GPDMA_CONTROL4_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL4_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL4_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL4_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL4_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL4_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL4_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL4_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL4_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL4_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL4_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL4_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL4_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL4_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL4_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL4_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL4_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL4_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL4_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL4_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL4_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL4_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL5  ======================================================== */
#define GPDMA_CONTROL5_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL5_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL5_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL5_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL5_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL5_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL5_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL5_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL5_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL5_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL5_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL5_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL5_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL5_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL5_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL5_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL5_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
