lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPDMA_CONTROL5_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL5_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL5_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL5_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL5_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL6  ======================================================== */
#define GPDMA_CONTROL6_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL6_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL6_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL6_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL6_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL6_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL6_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL6_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL6_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL6_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL6_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL6_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL6_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL6_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL6_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL6_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL6_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL6_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL6_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL6_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL6_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL6_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* =======================================================  CONTROL7  ======================================================== */
#define GPDMA_CONTROL7_TRANSFERSIZE_Pos   (0UL)                     /*!< TRANSFERSIZE (Bit 0)                                  */
#define GPDMA_CONTROL7_TRANSFERSIZE_Msk   (0xfffUL)                 /*!< TRANSFERSIZE (Bitfield-Mask: 0xfff)                   */
#define GPDMA_CONTROL7_SBSIZE_Pos         (12UL)                    /*!< SBSIZE (Bit 12)                                       */
#define GPDMA_CONTROL7_SBSIZE_Msk         (0x7000UL)                /*!< SBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL7_DBSIZE_Pos         (15UL)                    /*!< DBSIZE (Bit 15)                                       */
#define GPDMA_CONTROL7_DBSIZE_Msk         (0x38000UL)               /*!< DBSIZE (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL7_SWIDTH_Pos         (18UL)                    /*!< SWIDTH (Bit 18)                                       */
#define GPDMA_CONTROL7_SWIDTH_Msk         (0x1c0000UL)              /*!< SWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL7_DWIDTH_Pos         (21UL)                    /*!< DWIDTH (Bit 21)                                       */
#define GPDMA_CONTROL7_DWIDTH_Msk         (0xe00000UL)              /*!< DWIDTH (Bitfield-Mask: 0x07)                          */
#define GPDMA_CONTROL7_SI_Pos             (26UL)                    /*!< SI (Bit 26)                                           */
#define GPDMA_CONTROL7_SI_Msk             (0x4000000UL)             /*!< SI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL7_DI_Pos             (27UL)                    /*!< DI (Bit 27)                                           */
#define GPDMA_CONTROL7_DI_Msk             (0x8000000UL)             /*!< DI (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONTROL7_PROT1_Pos          (28UL)                    /*!< PROT1 (Bit 28)                                        */
#define GPDMA_CONTROL7_PROT1_Msk          (0x10000000UL)            /*!< PROT1 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL7_PROT2_Pos          (29UL)                    /*!< PROT2 (Bit 29)                                        */
#define GPDMA_CONTROL7_PROT2_Msk          (0x20000000UL)            /*!< PROT2 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL7_PROT3_Pos          (30UL)                    /*!< PROT3 (Bit 30)                                        */
#define GPDMA_CONTROL7_PROT3_Msk          (0x40000000UL)            /*!< PROT3 (Bitfield-Mask: 0x01)                           */
#define GPDMA_CONTROL7_I_Pos              (31UL)                    /*!< I (Bit 31)                                            */
#define GPDMA_CONTROL7_I_Msk              (0x80000000UL)            /*!< I (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG0  ======================================================== */
#define GPDMA_CONFIG0_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG0_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG0_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG0_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG0_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG0_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG0_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG0_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG0_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG0_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG0_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG0_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG0_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG0_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG0_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG0_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG0_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG0_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG1  ======================================================== */
#define GPDMA_CONFIG1_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG1_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG1_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG1_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG1_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG1_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG1_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG1_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG1_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG1_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG1_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG1_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG1_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG1_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG1_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG1_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG1_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG1_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG2  ======================================================== */
#define GPDMA_CONFIG2_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG2_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG2_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG2_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG2_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG2_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG2_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG2_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG2_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG2_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG2_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG2_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG2_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG2_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG2_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG2_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG2_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG2_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG3  ======================================================== */
#define GPDMA_CONFIG3_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG3_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG3_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG3_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG3_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG3_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG3_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG3_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG3_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG3_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG3_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG3_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG3_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG3_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG3_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG3_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG3_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG3_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG4  ======================================================== */
#define GPDMA_CONFIG4_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG4_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG4_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG4_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG4_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG4_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG4_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG4_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG4_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG4_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG4_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG4_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG4_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG4_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG4_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG4_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG4_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG4_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG5  ======================================================== */
#define GPDMA_CONFIG5_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG5_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG5_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG5_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG5_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG5_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG5_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG5_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG5_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG5_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG5_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG5_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG5_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG5_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG5_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG5_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG5_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG5_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
/* ========================================================  CONFIG6  ======================================================== */
#define GPDMA_CONFIG6_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG6_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG6_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG6_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG6_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG6_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG6_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG6_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG6_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG6_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG6_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG6_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG6_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG6_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG6_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG6_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG6_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG6_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */
