lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
/* ========================================================  CONFIG7  ======================================================== */
#define GPDMA_CONFIG7_E_Pos               (0UL)                     /*!< E (Bit 0)                                             */
#define GPDMA_CONFIG7_E_Msk               (0x1UL)                   /*!< E (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG7_SRCPERIPHERAL_Pos   (1UL)                     /*!< SRCPERIPHERAL (Bit 1)                                 */
#define GPDMA_CONFIG7_SRCPERIPHERAL_Msk   (0x3eUL)                  /*!< SRCPERIPHERAL (Bitfield-Mask: 0x1f)                   */
#define GPDMA_CONFIG7_DESTPERIPHERAL_Pos  (6UL)                     /*!< DESTPERIPHERAL (Bit 6)                                */
#define GPDMA_CONFIG7_DESTPERIPHERAL_Msk  (0x7c0UL)                 /*!< DESTPERIPHERAL (Bitfield-Mask: 0x1f)                  */
#define GPDMA_CONFIG7_TRANSFERTYPE_Pos    (11UL)                    /*!< TRANSFERTYPE (Bit 11)                                 */
#define GPDMA_CONFIG7_TRANSFERTYPE_Msk    (0x3800UL)                /*!< TRANSFERTYPE (Bitfield-Mask: 0x07)                    */
#define GPDMA_CONFIG7_IE_Pos              (14UL)                    /*!< IE (Bit 14)                                           */
#define GPDMA_CONFIG7_IE_Msk              (0x4000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define GPDMA_CONFIG7_ITC_Pos             (15UL)                    /*!< ITC (Bit 15)                                          */
#define GPDMA_CONFIG7_ITC_Msk             (0x8000UL)                /*!< ITC (Bitfield-Mask: 0x01)                             */
#define GPDMA_CONFIG7_L_Pos               (16UL)                    /*!< L (Bit 16)                                            */
#define GPDMA_CONFIG7_L_Msk               (0x10000UL)               /*!< L (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG7_A_Pos               (17UL)                    /*!< A (Bit 17)                                            */
#define GPDMA_CONFIG7_A_Msk               (0x20000UL)               /*!< A (Bitfield-Mask: 0x01)                               */
#define GPDMA_CONFIG7_H_Pos               (18UL)                    /*!< H (Bit 18)                                            */
#define GPDMA_CONFIG7_H_Msk               (0x40000UL)               /*!< H (Bitfield-Mask: 0x01)                               */


/* =========================================================================================================================== */
/* ================                                          LPC_USB                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  INTST  ========================================================= */
#define USB_INTST_TMR_Pos                 (0UL)                     /*!< TMR (Bit 0)                                           */
#define USB_INTST_TMR_Msk                 (0x1UL)                   /*!< TMR (Bitfield-Mask: 0x01)                             */
#define USB_INTST_REMOVE_PU_Pos           (1UL)                     /*!< REMOVE_PU (Bit 1)                                     */
#define USB_INTST_REMOVE_PU_Msk           (0x2UL)                   /*!< REMOVE_PU (Bitfield-Mask: 0x01)                       */
#define USB_INTST_HNP_FAILURE_Pos         (2UL)                     /*!< HNP_FAILURE (Bit 2)                                   */
#define USB_INTST_HNP_FAILURE_Msk         (0x4UL)                   /*!< HNP_FAILURE (Bitfield-Mask: 0x01)                     */
#define USB_INTST_HNP_SUCCESS_Pos         (3UL)                     /*!< HNP_SUCCESS (Bit 3)                                   */
#define USB_INTST_HNP_SUCCESS_Msk         (0x8UL)                   /*!< HNP_SUCCESS (Bitfield-Mask: 0x01)                     */
/* =========================================================  INTEN  ========================================================= */
#define USB_INTEN_TMR_EN_Pos              (0UL)                     /*!< TMR_EN (Bit 0)                                        */
#define USB_INTEN_TMR_EN_Msk              (0x1UL)                   /*!< TMR_EN (Bitfield-Mask: 0x01)                          */
#define USB_INTEN_REMOVE_PU_EN_Pos        (1UL)                     /*!< REMOVE_PU_EN (Bit 1)                                  */
#define USB_INTEN_REMOVE_PU_EN_Msk        (0x2UL)                   /*!< REMOVE_PU_EN (Bitfield-Mask: 0x01)                    */
#define USB_INTEN_HNP_FAILURE_EN_Pos      (2UL)                     /*!< HNP_FAILURE_EN (Bit 2)                                */
#define USB_INTEN_HNP_FAILURE_EN_Msk      (0x4UL)                   /*!< HNP_FAILURE_EN (Bitfield-Mask: 0x01)                  */
#define USB_INTEN_HNP_SUCCES_EN_Pos       (3UL)                     /*!< HNP_SUCCES_EN (Bit 3)                                 */
#define USB_INTEN_HNP_SUCCES_EN_Msk       (0x8UL)                   /*!< HNP_SUCCES_EN (Bitfield-Mask: 0x01)                   */
/* ========================================================  INTSET  ========================================================= */
#define USB_INTSET_TMR_SET_Pos            (0UL)                     /*!< TMR_SET (Bit 0)                                       */
#define USB_INTSET_TMR_SET_Msk            (0x1UL)                   /*!< TMR_SET (Bitfield-Mask: 0x01)                         */
#define USB_INTSET_REMOVE_PU_SET_Pos      (1UL)                     /*!< REMOVE_PU_SET (Bit 1)                                 */
#define USB_INTSET_REMOVE_PU_SET_Msk      (0x2UL)                   /*!< REMOVE_PU_SET (Bitfield-Mask: 0x01)                   */
#define USB_INTSET_HNP_FAILURE_SET_Pos    (2UL)                     /*!< HNP_FAILURE_SET (Bit 2)                               */
#define USB_INTSET_HNP_FAILURE_SET_Msk    (0x4UL)                   /*!< HNP_FAILURE_SET (Bitfield-Mask: 0x01)                 */
#define USB_INTSET_HNP_SUCCES_SET_Pos     (3UL)                     /*!< HNP_SUCCES_SET (Bit 3)                                */
#define USB_INTSET_HNP_SUCCES_SET_Msk     (0x8UL)                   /*!< HNP_SUCCES_SET (Bitfield-Mask: 0x01)                  */
/* ========================================================  INTCLR  ========================================================= */
#define USB_INTCLR_TMR_CLR_Pos            (0UL)                     /*!< TMR_CLR (Bit 0)                                       */
#define USB_INTCLR_TMR_CLR_Msk            (0x1UL)                   /*!< TMR_CLR (Bitfield-Mask: 0x01)                         */
#define USB_INTCLR_REMOVE_PU_CLR_Pos      (1UL)                     /*!< REMOVE_PU_CLR (Bit 1)                                 */
#define USB_INTCLR_REMOVE_PU_CLR_Msk      (0x2UL)                   /*!< REMOVE_PU_CLR (Bitfield-Mask: 0x01)                   */
#define USB_INTCLR_HNP_FAILURE_CLR_Pos    (2UL)                     /*!< HNP_FAILURE_CLR (Bit 2)                               */
#define USB_INTCLR_HNP_FAILURE_CLR_Msk    (0x4UL)                   /*!< HNP_FAILURE_CLR (Bitfield-Mask: 0x01)                 */
#define USB_INTCLR_HNP_SUCCES_CLR_Pos     (3UL)                     /*!< HNP_SUCCES_CLR (Bit 3)                                */
#define USB_INTCLR_HNP_SUCCES_CLR_Msk     (0x8UL)                   /*!< HNP_SUCCES_CLR (Bitfield-Mask: 0x01)                  */
/* ========================================================  STCTRL  ========================================================= */
#define USB_STCTRL_PORT_FUNC_Pos          (0UL)                     /*!< PORT_FUNC (Bit 0)                                     */
#define USB_STCTRL_PORT_FUNC_Msk          (0x3UL)                   /*!< PORT_FUNC (Bitfield-Mask: 0x03)                       */
#define USB_STCTRL_TMR_SCALE_Pos          (2UL)                     /*!< TMR_SCALE (Bit 2)                                     */
#define USB_STCTRL_TMR_SCALE_Msk          (0xcUL)                   /*!< TMR_SCALE (Bitfield-Mask: 0x03)                       */
#define USB_STCTRL_TMR_MODE_Pos           (4UL)                     /*!< TMR_MODE (Bit 4)                                      */
#define USB_STCTRL_TMR_MODE_Msk           (0x10UL)                  /*!< TMR_MODE (Bitfield-Mask: 0x01)                        */
#define USB_STCTRL_TMR_EN_Pos             (5UL)                     /*!< TMR_EN (Bit 5)                                        */
#define USB_STCTRL_TMR_EN_Msk             (0x20UL)                  /*!< TMR_EN (Bitfield-Mask: 0x01)                          */
#define USB_STCTRL_TMR_RST_Pos            (6UL)                     /*!< TMR_RST (Bit 6)                                       */
#define USB_STCTRL_TMR_RST_Msk            (0x40UL)                  /*!< TMR_RST (Bitfield-Mask: 0x01)                         */
#define USB_STCTRL_B_HNP_TRACK_Pos        (8UL)                     /*!< B_HNP_TRACK (Bit 8)                                   */
#define USB_STCTRL_B_HNP_TRACK_Msk        (0x100UL)                 /*!< B_HNP_TRACK (Bitfield-Mask: 0x01)                     */
#define USB_STCTRL_A_HNP_TRACK_Pos        (9UL)                     /*!< A_HNP_TRACK (Bit 9)                                   */
#define USB_STCTRL_A_HNP_TRACK_Msk        (0x200UL)                 /*!< A_HNP_TRACK (Bitfield-Mask: 0x01)                     */
#define USB_STCTRL_PU_REMOVED_Pos         (10UL)                    /*!< PU_REMOVED (Bit 10)                                   */
#define USB_STCTRL_PU_REMOVED_Msk         (0x400UL)                 /*!< PU_REMOVED (Bitfield-Mask: 0x01)                      */
#define USB_STCTRL_TMR_CNT_Pos            (16UL)                    /*!< TMR_CNT (Bit 16)                                      */
#define USB_STCTRL_TMR_CNT_Msk            (0xffff0000UL)            /*!< TMR_CNT (Bitfield-Mask: 0xffff)                       */
/* ==========================================================  TMR  ========================================================== */
#define USB_TMR_TIMEOUT_CNT_Pos           (0UL)                     /*!< TIMEOUT_CNT (Bit 0)                                   */
#define USB_TMR_TIMEOUT_CNT_Msk           (0xffffUL)                /*!< TIMEOUT_CNT (Bitfield-Mask: 0xffff)                   */
/* =======================================================  DEVINTST  ======================================================== */
#define USB_DEVINTST_FRAME_Pos            (0UL)                     /*!< FRAME (Bit 0)                                         */
#define USB_DEVINTST_FRAME_Msk            (0x1UL)                   /*!< FRAME (Bitfield-Mask: 0x01)                           */
#define USB_DEVINTST_EP_FAST_Pos          (1UL)                     /*!< EP_FAST (Bit 1)                                       */
#define USB_DEVINTST_EP_FAST_Msk          (0x2UL)                   /*!< EP_FAST (Bitfield-Mask: 0x01)                         */
#define USB_DEVINTST_EP_SLOW_Pos          (2UL)                     /*!< EP_SLOW (Bit 2)                                       */
#define USB_DEVINTST_EP_SLOW_Msk          (0x4UL)                   /*!< EP_SLOW (Bitfield-Mask: 0x01)                         */
#define USB_DEVINTST_DEV_STAT_Pos         (3UL)                     /*!< DEV_STAT (Bit 3)                                      */
#define USB_DEVINTST_DEV_STAT_Msk         (0x8UL)                   /*!< DEV_STAT (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTST_CCEMPTY_Pos          (4UL)                     /*!< CCEMPTY (Bit 4)                                       */
#define USB_DEVINTST_CCEMPTY_Msk          (0x10UL)                  /*!< CCEMPTY (Bitfield-Mask: 0x01)                         */
#define USB_DEVINTST_CDFULL_Pos           (5UL)                     /*!< CDFULL (Bit 5)                                        */
#define USB_DEVINTST_CDFULL_Msk           (0x20UL)                  /*!< CDFULL (Bitfield-Mask: 0x01)                          */
#define USB_DEVINTST_RxENDPKT_Pos         (6UL)                     /*!< RxENDPKT (Bit 6)                                      */
#define USB_DEVINTST_RxENDPKT_Msk         (0x40UL)                  /*!< RxENDPKT (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTST_TxENDPKT_Pos         (7UL)                     /*!< TxENDPKT (Bit 7)                                      */
#define USB_DEVINTST_TxENDPKT_Msk         (0x80UL)                  /*!< TxENDPKT (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTST_EP_RLZED_Pos         (8UL)                     /*!< EP_RLZED (Bit 8)                                      */
#define USB_DEVINTST_EP_RLZED_Msk         (0x100UL)                 /*!< EP_RLZED (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTST_ERR_INT_Pos          (9UL)                     /*!< ERR_INT (Bit 9)                                       */
#define USB_DEVINTST_ERR_INT_Msk          (0x200UL)                 /*!< ERR_INT (Bitfield-Mask: 0x01)                         */
/* =======================================================  DEVINTEN  ======================================================== */
#define USB_DEVINTEN_FRAMEEN_Pos          (0UL)                     /*!< FRAMEEN (Bit 0)                                       */
#define USB_DEVINTEN_FRAMEEN_Msk          (0x1UL)                   /*!< FRAMEEN (Bitfield-Mask: 0x01)                         */
#define USB_DEVINTEN_EP_FASTEN_Pos        (1UL)                     /*!< EP_FASTEN (Bit 1)                                     */
#define USB_DEVINTEN_EP_FASTEN_Msk        (0x2UL)                   /*!< EP_FASTEN (Bitfield-Mask: 0x01)                       */
#define USB_DEVINTEN_EP_SLOWEN_Pos        (2UL)                     /*!< EP_SLOWEN (Bit 2)                                     */
#define USB_DEVINTEN_EP_SLOWEN_Msk        (0x4UL)                   /*!< EP_SLOWEN (Bitfield-Mask: 0x01)                       */
#define USB_DEVINTEN_DEV_STATEN_Pos       (3UL)                     /*!< DEV_STATEN (Bit 3)                                    */
#define USB_DEVINTEN_DEV_STATEN_Msk       (0x8UL)                   /*!< DEV_STATEN (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTEN_CCEMPTYEN_Pos        (4UL)                     /*!< CCEMPTYEN (Bit 4)                                     */
#define USB_DEVINTEN_CCEMPTYEN_Msk        (0x10UL)                  /*!< CCEMPTYEN (Bitfield-Mask: 0x01)                       */
#define USB_DEVINTEN_CDFULLEN_Pos         (5UL)                     /*!< CDFULLEN (Bit 5)                                      */
#define USB_DEVINTEN_CDFULLEN_Msk         (0x20UL)                  /*!< CDFULLEN (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTEN_RxENDPKTEN_Pos       (6UL)                     /*!< RxENDPKTEN (Bit 6)                                    */
#define USB_DEVINTEN_RxENDPKTEN_Msk       (0x40UL)                  /*!< RxENDPKTEN (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTEN_TxENDPKTEN_Pos       (7UL)                     /*!< TxENDPKTEN (Bit 7)                                    */
#define USB_DEVINTEN_TxENDPKTEN_Msk       (0x80UL)                  /*!< TxENDPKTEN (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTEN_EP_RLZEDEN_Pos       (8UL)                     /*!< EP_RLZEDEN (Bit 8)                                    */
#define USB_DEVINTEN_EP_RLZEDEN_Msk       (0x100UL)                 /*!< EP_RLZEDEN (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTEN_ERR_INTEN_Pos        (9UL)                     /*!< ERR_INTEN (Bit 9)                                     */
#define USB_DEVINTEN_ERR_INTEN_Msk        (0x200UL)                 /*!< ERR_INTEN (Bitfield-Mask: 0x01)                       */
/* =======================================================  DEVINTCLR  ======================================================= */
#define USB_DEVINTCLR_FRAMECLR_Pos        (0UL)                     /*!< FRAMECLR (Bit 0)                                      */
#define USB_DEVINTCLR_FRAMECLR_Msk        (0x1UL)                   /*!< FRAMECLR (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTCLR_EP_FASTCLR_Pos      (1UL)                     /*!< EP_FASTCLR (Bit 1)                                    */
#define USB_DEVINTCLR_EP_FASTCLR_Msk      (0x2UL)                   /*!< EP_FASTCLR (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTCLR_EP_SLOWCLR_Pos      (2UL)                     /*!< EP_SLOWCLR (Bit 2)                                    */
#define USB_DEVINTCLR_EP_SLOWCLR_Msk      (0x4UL)                   /*!< EP_SLOWCLR (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTCLR_DEV_STATCLR_Pos     (3UL)                     /*!< DEV_STATCLR (Bit 3)                                   */
#define USB_DEVINTCLR_DEV_STATCLR_Msk     (0x8UL)                   /*!< DEV_STATCLR (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTCLR_CCEMPTYCLR_Pos      (4UL)                     /*!< CCEMPTYCLR (Bit 4)                                    */
#define USB_DEVINTCLR_CCEMPTYCLR_Msk      (0x10UL)                  /*!< CCEMPTYCLR (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTCLR_CDFULLCLR_Pos       (5UL)                     /*!< CDFULLCLR (Bit 5)                                     */
#define USB_DEVINTCLR_CDFULLCLR_Msk       (0x20UL)                  /*!< CDFULLCLR (Bitfield-Mask: 0x01)                       */
#define USB_DEVINTCLR_RxENDPKTCLR_Pos     (6UL)                     /*!< RxENDPKTCLR (Bit 6)                                   */
#define USB_DEVINTCLR_RxENDPKTCLR_Msk     (0x40UL)                  /*!< RxENDPKTCLR (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTCLR_TxENDPKTCLR_Pos     (7UL)                     /*!< TxENDPKTCLR (Bit 7)                                   */
#define USB_DEVINTCLR_TxENDPKTCLR_Msk     (0x80UL)                  /*!< TxENDPKTCLR (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTCLR_EP_RLZEDCLR_Pos     (8UL)                     /*!< EP_RLZEDCLR (Bit 8)                                   */
#define USB_DEVINTCLR_EP_RLZEDCLR_Msk     (0x100UL)                 /*!< EP_RLZEDCLR (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTCLR_ERR_INTCLR_Pos      (9UL)                     /*!< ERR_INTCLR (Bit 9)                                    */
#define USB_DEVINTCLR_ERR_INTCLR_Msk      (0x200UL)                 /*!< ERR_INTCLR (Bitfield-Mask: 0x01)                      */
/* =======================================================  DEVINTSET  ======================================================= */
#define USB_DEVINTSET_FRAMESET_Pos        (0UL)                     /*!< FRAMESET (Bit 0)                                      */
#define USB_DEVINTSET_FRAMESET_Msk        (0x1UL)                   /*!< FRAMESET (Bitfield-Mask: 0x01)                        */
#define USB_DEVINTSET_EP_FASTSET_Pos      (1UL)                     /*!< EP_FASTSET (Bit 1)                                    */
#define USB_DEVINTSET_EP_FASTSET_Msk      (0x2UL)                   /*!< EP_FASTSET (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTSET_EP_SLOWSET_Pos      (2UL)                     /*!< EP_SLOWSET (Bit 2)                                    */
#define USB_DEVINTSET_EP_SLOWSET_Msk      (0x4UL)                   /*!< EP_SLOWSET (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTSET_DEV_STATSET_Pos     (3UL)                     /*!< DEV_STATSET (Bit 3)                                   */
#define USB_DEVINTSET_DEV_STATSET_Msk     (0x8UL)                   /*!< DEV_STATSET (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTSET_CCEMPTYSET_Pos      (4UL)                     /*!< CCEMPTYSET (Bit 4)                                    */
#define USB_DEVINTSET_CCEMPTYSET_Msk      (0x10UL)                  /*!< CCEMPTYSET (Bitfield-Mask: 0x01)                      */
#define USB_DEVINTSET_CDFULLSET_Pos       (5UL)                     /*!< CDFULLSET (Bit 5)                                     */
#define USB_DEVINTSET_CDFULLSET_Msk       (0x20UL)                  /*!< CDFULLSET (Bitfield-Mask: 0x01)                       */
#define USB_DEVINTSET_RxENDPKTSET_Pos     (6UL)                     /*!< RxENDPKTSET (Bit 6)                                   */
#define USB_DEVINTSET_RxENDPKTSET_Msk     (0x40UL)                  /*!< RxENDPKTSET (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTSET_TxENDPKTSET_Pos     (7UL)                     /*!< TxENDPKTSET (Bit 7)                                   */
#define USB_DEVINTSET_TxENDPKTSET_Msk     (0x80UL)                  /*!< TxENDPKTSET (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTSET_EP_RLZEDSET_Pos     (8UL)                     /*!< EP_RLZEDSET (Bit 8)                                   */
#define USB_DEVINTSET_EP_RLZEDSET_Msk     (0x100UL)                 /*!< EP_RLZEDSET (Bitfield-Mask: 0x01)                     */
#define USB_DEVINTSET_ERR_INTSET_Pos      (9UL)                     /*!< ERR_INTSET (Bit 9)                                    */
#define USB_DEVINTSET_ERR_INTSET_Msk      (0x200UL)                 /*!< ERR_INTSET (Bitfield-Mask: 0x01)                      */
/* ========================================================  CMDCODE  ======================================================== */
#define USB_CMDCODE_CMD_PHASE_Pos         (8UL)                     /*!< CMD_PHASE (Bit 8)                                     */
#define USB_CMDCODE_CMD_PHASE_Msk         (0xff00UL)                /*!< CMD_PHASE (Bitfield-Mask: 0xff)                       */
#define USB_CMDCODE_CMD_CODE_WDATA_Pos    (16UL)                    /*!< CMD_CODE_WDATA (Bit 16)                               */
#define USB_CMDCODE_CMD_CODE_WDATA_Msk    (0xff0000UL)              /*!< CMD_CODE_WDATA (Bitfield-Mask: 0xff)                  */
/* ========================================================  CMDDATA  ======================================================== */
#define USB_CMDDATA_CMD_RDATA_Pos         (0UL)                     /*!< CMD_RDATA (Bit 0)                                     */
#define USB_CMDDATA_CMD_RDATA_Msk         (0xffUL)                  /*!< CMD_RDATA (Bitfield-Mask: 0xff)                       */
/* ========================================================  RXDATA  ========================================================= */
#define USB_RXDATA_RX_DATA_Pos            (0UL)                     /*!< RX_DATA (Bit 0)                                       */
#define USB_RXDATA_RX_DATA_Msk            (0xffffffffUL)            /*!< RX_DATA (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  TXDATA  ========================================================= */
#define USB_TXDATA_TX_DATA_Pos            (0UL)                     /*!< TX_DATA (Bit 0)                                       */
#define USB_TXDATA_TX_DATA_Msk            (0xffffffffUL)            /*!< TX_DATA (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  RXPLEN  ========================================================= */
#define USB_RXPLEN_PKT_LNGTH_Pos          (0UL)                     /*!< PKT_LNGTH (Bit 0)                                     */
#define USB_RXPLEN_PKT_LNGTH_Msk          (0x3ffUL)                 /*!< PKT_LNGTH (Bitfield-Mask: 0x3ff)                      */
#define USB_RXPLEN_DV_Pos                 (10UL)                    /*!< DV (Bit 10)                                           */
#define USB_RXPLEN_DV_Msk                 (0x400UL)                 /*!< DV (Bitfield-Mask: 0x01)                              */
#define USB_RXPLEN_PKT_RDY_Pos            (11UL)                    /*!< PKT_RDY (Bit 11)                                      */
