lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_RXPLEN_PKT_RDY_Msk            (0x800UL)                 /*!< PKT_RDY (Bitfield-Mask: 0x01)                         */
/* ========================================================  TXPLEN  ========================================================= */
#define USB_TXPLEN_PKT_LNGTH_Pos          (0UL)                     /*!< PKT_LNGTH (Bit 0)                                     */
#define USB_TXPLEN_PKT_LNGTH_Msk          (0x3ffUL)                 /*!< PKT_LNGTH (Bitfield-Mask: 0x3ff)                      */
/* =========================================================  CTRL  ========================================================== */
#define USB_CTRL_RD_EN_Pos                (0UL)                     /*!< RD_EN (Bit 0)                                         */
#define USB_CTRL_RD_EN_Msk                (0x1UL)                   /*!< RD_EN (Bitfield-Mask: 0x01)                           */
#define USB_CTRL_WR_EN_Pos                (1UL)                     /*!< WR_EN (Bit 1)                                         */
#define USB_CTRL_WR_EN_Msk                (0x2UL)                   /*!< WR_EN (Bitfield-Mask: 0x01)                           */
#define USB_CTRL_LOG_ENDPOINT_Pos         (2UL)                     /*!< LOG_ENDPOINT (Bit 2)                                  */
#define USB_CTRL_LOG_ENDPOINT_Msk         (0x3cUL)                  /*!< LOG_ENDPOINT (Bitfield-Mask: 0x0f)                    */
/* =======================================================  DEVINTPRI  ======================================================= */
#define USB_DEVINTPRI_FRAME_Pos           (0UL)                     /*!< FRAME (Bit 0)                                         */
#define USB_DEVINTPRI_FRAME_Msk           (0x1UL)                   /*!< FRAME (Bitfield-Mask: 0x01)                           */
#define USB_DEVINTPRI_EP_FAST_Pos         (1UL)                     /*!< EP_FAST (Bit 1)                                       */
#define USB_DEVINTPRI_EP_FAST_Msk         (0x2UL)                   /*!< EP_FAST (Bitfield-Mask: 0x01)                         */
/* ========================================================  EPINTST  ======================================================== */
#define USB_EPINTST_EPST0_Pos             (0UL)                     /*!< EPST0 (Bit 0)                                         */
#define USB_EPINTST_EPST0_Msk             (0x1UL)                   /*!< EPST0 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST1_Pos             (1UL)                     /*!< EPST1 (Bit 1)                                         */
#define USB_EPINTST_EPST1_Msk             (0x2UL)                   /*!< EPST1 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST2_Pos             (2UL)                     /*!< EPST2 (Bit 2)                                         */
#define USB_EPINTST_EPST2_Msk             (0x4UL)                   /*!< EPST2 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST3_Pos             (3UL)                     /*!< EPST3 (Bit 3)                                         */
#define USB_EPINTST_EPST3_Msk             (0x8UL)                   /*!< EPST3 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST4_Pos             (4UL)                     /*!< EPST4 (Bit 4)                                         */
#define USB_EPINTST_EPST4_Msk             (0x10UL)                  /*!< EPST4 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST5_Pos             (5UL)                     /*!< EPST5 (Bit 5)                                         */
#define USB_EPINTST_EPST5_Msk             (0x20UL)                  /*!< EPST5 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST6_Pos             (6UL)                     /*!< EPST6 (Bit 6)                                         */
#define USB_EPINTST_EPST6_Msk             (0x40UL)                  /*!< EPST6 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST7_Pos             (7UL)                     /*!< EPST7 (Bit 7)                                         */
#define USB_EPINTST_EPST7_Msk             (0x80UL)                  /*!< EPST7 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST8_Pos             (8UL)                     /*!< EPST8 (Bit 8)                                         */
#define USB_EPINTST_EPST8_Msk             (0x100UL)                 /*!< EPST8 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST9_Pos             (9UL)                     /*!< EPST9 (Bit 9)                                         */
#define USB_EPINTST_EPST9_Msk             (0x200UL)                 /*!< EPST9 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTST_EPST10_Pos            (10UL)                    /*!< EPST10 (Bit 10)                                       */
#define USB_EPINTST_EPST10_Msk            (0x400UL)                 /*!< EPST10 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST11_Pos            (11UL)                    /*!< EPST11 (Bit 11)                                       */
#define USB_EPINTST_EPST11_Msk            (0x800UL)                 /*!< EPST11 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST12_Pos            (12UL)                    /*!< EPST12 (Bit 12)                                       */
#define USB_EPINTST_EPST12_Msk            (0x1000UL)                /*!< EPST12 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST13_Pos            (13UL)                    /*!< EPST13 (Bit 13)                                       */
#define USB_EPINTST_EPST13_Msk            (0x2000UL)                /*!< EPST13 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST14_Pos            (14UL)                    /*!< EPST14 (Bit 14)                                       */
#define USB_EPINTST_EPST14_Msk            (0x4000UL)                /*!< EPST14 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST15_Pos            (15UL)                    /*!< EPST15 (Bit 15)                                       */
#define USB_EPINTST_EPST15_Msk            (0x8000UL)                /*!< EPST15 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST16_Pos            (16UL)                    /*!< EPST16 (Bit 16)                                       */
#define USB_EPINTST_EPST16_Msk            (0x10000UL)               /*!< EPST16 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST17_Pos            (17UL)                    /*!< EPST17 (Bit 17)                                       */
#define USB_EPINTST_EPST17_Msk            (0x20000UL)               /*!< EPST17 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST18_Pos            (18UL)                    /*!< EPST18 (Bit 18)                                       */
#define USB_EPINTST_EPST18_Msk            (0x40000UL)               /*!< EPST18 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST19_Pos            (19UL)                    /*!< EPST19 (Bit 19)                                       */
#define USB_EPINTST_EPST19_Msk            (0x80000UL)               /*!< EPST19 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST20_Pos            (20UL)                    /*!< EPST20 (Bit 20)                                       */
#define USB_EPINTST_EPST20_Msk            (0x100000UL)              /*!< EPST20 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST21_Pos            (21UL)                    /*!< EPST21 (Bit 21)                                       */
#define USB_EPINTST_EPST21_Msk            (0x200000UL)              /*!< EPST21 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST22_Pos            (22UL)                    /*!< EPST22 (Bit 22)                                       */
#define USB_EPINTST_EPST22_Msk            (0x400000UL)              /*!< EPST22 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST23_Pos            (23UL)                    /*!< EPST23 (Bit 23)                                       */
#define USB_EPINTST_EPST23_Msk            (0x800000UL)              /*!< EPST23 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST24_Pos            (24UL)                    /*!< EPST24 (Bit 24)                                       */
#define USB_EPINTST_EPST24_Msk            (0x1000000UL)             /*!< EPST24 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST25_Pos            (25UL)                    /*!< EPST25 (Bit 25)                                       */
#define USB_EPINTST_EPST25_Msk            (0x2000000UL)             /*!< EPST25 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST26_Pos            (26UL)                    /*!< EPST26 (Bit 26)                                       */
#define USB_EPINTST_EPST26_Msk            (0x4000000UL)             /*!< EPST26 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST27_Pos            (27UL)                    /*!< EPST27 (Bit 27)                                       */
#define USB_EPINTST_EPST27_Msk            (0x8000000UL)             /*!< EPST27 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST28_Pos            (28UL)                    /*!< EPST28 (Bit 28)                                       */
#define USB_EPINTST_EPST28_Msk            (0x10000000UL)            /*!< EPST28 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST29_Pos            (29UL)                    /*!< EPST29 (Bit 29)                                       */
#define USB_EPINTST_EPST29_Msk            (0x20000000UL)            /*!< EPST29 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST30_Pos            (30UL)                    /*!< EPST30 (Bit 30)                                       */
#define USB_EPINTST_EPST30_Msk            (0x40000000UL)            /*!< EPST30 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTST_EPST31_Pos            (31UL)                    /*!< EPST31 (Bit 31)                                       */
#define USB_EPINTST_EPST31_Msk            (0x80000000UL)            /*!< EPST31 (Bitfield-Mask: 0x01)                          */
/* ========================================================  EPINTEN  ======================================================== */
#define USB_EPINTEN_EPEN0_Pos             (0UL)                     /*!< EPEN0 (Bit 0)                                         */
#define USB_EPINTEN_EPEN0_Msk             (0x1UL)                   /*!< EPEN0 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN1_Pos             (1UL)                     /*!< EPEN1 (Bit 1)                                         */
#define USB_EPINTEN_EPEN1_Msk             (0x2UL)                   /*!< EPEN1 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN2_Pos             (2UL)                     /*!< EPEN2 (Bit 2)                                         */
#define USB_EPINTEN_EPEN2_Msk             (0x4UL)                   /*!< EPEN2 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN3_Pos             (3UL)                     /*!< EPEN3 (Bit 3)                                         */
#define USB_EPINTEN_EPEN3_Msk             (0x8UL)                   /*!< EPEN3 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN4_Pos             (4UL)                     /*!< EPEN4 (Bit 4)                                         */
#define USB_EPINTEN_EPEN4_Msk             (0x10UL)                  /*!< EPEN4 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN5_Pos             (5UL)                     /*!< EPEN5 (Bit 5)                                         */
#define USB_EPINTEN_EPEN5_Msk             (0x20UL)                  /*!< EPEN5 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN6_Pos             (6UL)                     /*!< EPEN6 (Bit 6)                                         */
#define USB_EPINTEN_EPEN6_Msk             (0x40UL)                  /*!< EPEN6 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN7_Pos             (7UL)                     /*!< EPEN7 (Bit 7)                                         */
#define USB_EPINTEN_EPEN7_Msk             (0x80UL)                  /*!< EPEN7 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN8_Pos             (8UL)                     /*!< EPEN8 (Bit 8)                                         */
#define USB_EPINTEN_EPEN8_Msk             (0x100UL)                 /*!< EPEN8 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN9_Pos             (9UL)                     /*!< EPEN9 (Bit 9)                                         */
#define USB_EPINTEN_EPEN9_Msk             (0x200UL)                 /*!< EPEN9 (Bitfield-Mask: 0x01)                           */
#define USB_EPINTEN_EPEN10_Pos            (10UL)                    /*!< EPEN10 (Bit 10)                                       */
#define USB_EPINTEN_EPEN10_Msk            (0x400UL)                 /*!< EPEN10 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN11_Pos            (11UL)                    /*!< EPEN11 (Bit 11)                                       */
#define USB_EPINTEN_EPEN11_Msk            (0x800UL)                 /*!< EPEN11 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN12_Pos            (12UL)                    /*!< EPEN12 (Bit 12)                                       */
#define USB_EPINTEN_EPEN12_Msk            (0x1000UL)                /*!< EPEN12 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN13_Pos            (13UL)                    /*!< EPEN13 (Bit 13)                                       */
#define USB_EPINTEN_EPEN13_Msk            (0x2000UL)                /*!< EPEN13 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN14_Pos            (14UL)                    /*!< EPEN14 (Bit 14)                                       */
#define USB_EPINTEN_EPEN14_Msk            (0x4000UL)                /*!< EPEN14 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN15_Pos            (15UL)                    /*!< EPEN15 (Bit 15)                                       */
#define USB_EPINTEN_EPEN15_Msk            (0x8000UL)                /*!< EPEN15 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN16_Pos            (16UL)                    /*!< EPEN16 (Bit 16)                                       */
#define USB_EPINTEN_EPEN16_Msk            (0x10000UL)               /*!< EPEN16 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN17_Pos            (17UL)                    /*!< EPEN17 (Bit 17)                                       */
#define USB_EPINTEN_EPEN17_Msk            (0x20000UL)               /*!< EPEN17 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN18_Pos            (18UL)                    /*!< EPEN18 (Bit 18)                                       */
#define USB_EPINTEN_EPEN18_Msk            (0x40000UL)               /*!< EPEN18 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN19_Pos            (19UL)                    /*!< EPEN19 (Bit 19)                                       */
#define USB_EPINTEN_EPEN19_Msk            (0x80000UL)               /*!< EPEN19 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN20_Pos            (20UL)                    /*!< EPEN20 (Bit 20)                                       */
#define USB_EPINTEN_EPEN20_Msk            (0x100000UL)              /*!< EPEN20 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN21_Pos            (21UL)                    /*!< EPEN21 (Bit 21)                                       */
#define USB_EPINTEN_EPEN21_Msk            (0x200000UL)              /*!< EPEN21 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN22_Pos            (22UL)                    /*!< EPEN22 (Bit 22)                                       */
#define USB_EPINTEN_EPEN22_Msk            (0x400000UL)              /*!< EPEN22 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN23_Pos            (23UL)                    /*!< EPEN23 (Bit 23)                                       */
#define USB_EPINTEN_EPEN23_Msk            (0x800000UL)              /*!< EPEN23 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN24_Pos            (24UL)                    /*!< EPEN24 (Bit 24)                                       */
#define USB_EPINTEN_EPEN24_Msk            (0x1000000UL)             /*!< EPEN24 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN25_Pos            (25UL)                    /*!< EPEN25 (Bit 25)                                       */
#define USB_EPINTEN_EPEN25_Msk            (0x2000000UL)             /*!< EPEN25 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN26_Pos            (26UL)                    /*!< EPEN26 (Bit 26)                                       */
#define USB_EPINTEN_EPEN26_Msk            (0x4000000UL)             /*!< EPEN26 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN27_Pos            (27UL)                    /*!< EPEN27 (Bit 27)                                       */
#define USB_EPINTEN_EPEN27_Msk            (0x8000000UL)             /*!< EPEN27 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN28_Pos            (28UL)                    /*!< EPEN28 (Bit 28)                                       */
#define USB_EPINTEN_EPEN28_Msk            (0x10000000UL)            /*!< EPEN28 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN29_Pos            (29UL)                    /*!< EPEN29 (Bit 29)                                       */
#define USB_EPINTEN_EPEN29_Msk            (0x20000000UL)            /*!< EPEN29 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN30_Pos            (30UL)                    /*!< EPEN30 (Bit 30)                                       */
#define USB_EPINTEN_EPEN30_Msk            (0x40000000UL)            /*!< EPEN30 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTEN_EPEN31_Pos            (31UL)                    /*!< EPEN31 (Bit 31)                                       */
#define USB_EPINTEN_EPEN31_Msk            (0x80000000UL)            /*!< EPEN31 (Bitfield-Mask: 0x01)                          */
/* =======================================================  EPINTCLR  ======================================================== */
#define USB_EPINTCLR_EPCLR0_Pos           (0UL)                     /*!< EPCLR0 (Bit 0)                                        */
#define USB_EPINTCLR_EPCLR0_Msk           (0x1UL)                   /*!< EPCLR0 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR1_Pos           (1UL)                     /*!< EPCLR1 (Bit 1)                                        */
#define USB_EPINTCLR_EPCLR1_Msk           (0x2UL)                   /*!< EPCLR1 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR2_Pos           (2UL)                     /*!< EPCLR2 (Bit 2)                                        */
#define USB_EPINTCLR_EPCLR2_Msk           (0x4UL)                   /*!< EPCLR2 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR3_Pos           (3UL)                     /*!< EPCLR3 (Bit 3)                                        */
#define USB_EPINTCLR_EPCLR3_Msk           (0x8UL)                   /*!< EPCLR3 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR4_Pos           (4UL)                     /*!< EPCLR4 (Bit 4)                                        */
#define USB_EPINTCLR_EPCLR4_Msk           (0x10UL)                  /*!< EPCLR4 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR5_Pos           (5UL)                     /*!< EPCLR5 (Bit 5)                                        */
#define USB_EPINTCLR_EPCLR5_Msk           (0x20UL)                  /*!< EPCLR5 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR6_Pos           (6UL)                     /*!< EPCLR6 (Bit 6)                                        */
#define USB_EPINTCLR_EPCLR6_Msk           (0x40UL)                  /*!< EPCLR6 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR7_Pos           (7UL)                     /*!< EPCLR7 (Bit 7)                                        */
#define USB_EPINTCLR_EPCLR7_Msk           (0x80UL)                  /*!< EPCLR7 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR8_Pos           (8UL)                     /*!< EPCLR8 (Bit 8)                                        */
#define USB_EPINTCLR_EPCLR8_Msk           (0x100UL)                 /*!< EPCLR8 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR9_Pos           (9UL)                     /*!< EPCLR9 (Bit 9)                                        */
#define USB_EPINTCLR_EPCLR9_Msk           (0x200UL)                 /*!< EPCLR9 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTCLR_EPCLR10_Pos          (10UL)                    /*!< EPCLR10 (Bit 10)                                      */
#define USB_EPINTCLR_EPCLR10_Msk          (0x400UL)                 /*!< EPCLR10 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR11_Pos          (11UL)                    /*!< EPCLR11 (Bit 11)                                      */
#define USB_EPINTCLR_EPCLR11_Msk          (0x800UL)                 /*!< EPCLR11 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR12_Pos          (12UL)                    /*!< EPCLR12 (Bit 12)                                      */
#define USB_EPINTCLR_EPCLR12_Msk          (0x1000UL)                /*!< EPCLR12 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR13_Pos          (13UL)                    /*!< EPCLR13 (Bit 13)                                      */
#define USB_EPINTCLR_EPCLR13_Msk          (0x2000UL)                /*!< EPCLR13 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR14_Pos          (14UL)                    /*!< EPCLR14 (Bit 14)                                      */
#define USB_EPINTCLR_EPCLR14_Msk          (0x4000UL)                /*!< EPCLR14 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR15_Pos          (15UL)                    /*!< EPCLR15 (Bit 15)                                      */
#define USB_EPINTCLR_EPCLR15_Msk          (0x8000UL)                /*!< EPCLR15 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR16_Pos          (16UL)                    /*!< EPCLR16 (Bit 16)                                      */
#define USB_EPINTCLR_EPCLR16_Msk          (0x10000UL)               /*!< EPCLR16 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR17_Pos          (17UL)                    /*!< EPCLR17 (Bit 17)                                      */
#define USB_EPINTCLR_EPCLR17_Msk          (0x20000UL)               /*!< EPCLR17 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR18_Pos          (18UL)                    /*!< EPCLR18 (Bit 18)                                      */
