lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_EPINTCLR_EPCLR18_Msk          (0x40000UL)               /*!< EPCLR18 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR19_Pos          (19UL)                    /*!< EPCLR19 (Bit 19)                                      */
#define USB_EPINTCLR_EPCLR19_Msk          (0x80000UL)               /*!< EPCLR19 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR20_Pos          (20UL)                    /*!< EPCLR20 (Bit 20)                                      */
#define USB_EPINTCLR_EPCLR20_Msk          (0x100000UL)              /*!< EPCLR20 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR21_Pos          (21UL)                    /*!< EPCLR21 (Bit 21)                                      */
#define USB_EPINTCLR_EPCLR21_Msk          (0x200000UL)              /*!< EPCLR21 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR22_Pos          (22UL)                    /*!< EPCLR22 (Bit 22)                                      */
#define USB_EPINTCLR_EPCLR22_Msk          (0x400000UL)              /*!< EPCLR22 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR23_Pos          (23UL)                    /*!< EPCLR23 (Bit 23)                                      */
#define USB_EPINTCLR_EPCLR23_Msk          (0x800000UL)              /*!< EPCLR23 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR24_Pos          (24UL)                    /*!< EPCLR24 (Bit 24)                                      */
#define USB_EPINTCLR_EPCLR24_Msk          (0x1000000UL)             /*!< EPCLR24 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR25_Pos          (25UL)                    /*!< EPCLR25 (Bit 25)                                      */
#define USB_EPINTCLR_EPCLR25_Msk          (0x2000000UL)             /*!< EPCLR25 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR26_Pos          (26UL)                    /*!< EPCLR26 (Bit 26)                                      */
#define USB_EPINTCLR_EPCLR26_Msk          (0x4000000UL)             /*!< EPCLR26 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR27_Pos          (27UL)                    /*!< EPCLR27 (Bit 27)                                      */
#define USB_EPINTCLR_EPCLR27_Msk          (0x8000000UL)             /*!< EPCLR27 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR28_Pos          (28UL)                    /*!< EPCLR28 (Bit 28)                                      */
#define USB_EPINTCLR_EPCLR28_Msk          (0x10000000UL)            /*!< EPCLR28 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR29_Pos          (29UL)                    /*!< EPCLR29 (Bit 29)                                      */
#define USB_EPINTCLR_EPCLR29_Msk          (0x20000000UL)            /*!< EPCLR29 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR30_Pos          (30UL)                    /*!< EPCLR30 (Bit 30)                                      */
#define USB_EPINTCLR_EPCLR30_Msk          (0x40000000UL)            /*!< EPCLR30 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTCLR_EPCLR31_Pos          (31UL)                    /*!< EPCLR31 (Bit 31)                                      */
#define USB_EPINTCLR_EPCLR31_Msk          (0x80000000UL)            /*!< EPCLR31 (Bitfield-Mask: 0x01)                         */
/* =======================================================  EPINTSET  ======================================================== */
#define USB_EPINTSET_EPSET0_Pos           (0UL)                     /*!< EPSET0 (Bit 0)                                        */
#define USB_EPINTSET_EPSET0_Msk           (0x1UL)                   /*!< EPSET0 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET1_Pos           (1UL)                     /*!< EPSET1 (Bit 1)                                        */
#define USB_EPINTSET_EPSET1_Msk           (0x2UL)                   /*!< EPSET1 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET2_Pos           (2UL)                     /*!< EPSET2 (Bit 2)                                        */
#define USB_EPINTSET_EPSET2_Msk           (0x4UL)                   /*!< EPSET2 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET3_Pos           (3UL)                     /*!< EPSET3 (Bit 3)                                        */
#define USB_EPINTSET_EPSET3_Msk           (0x8UL)                   /*!< EPSET3 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET4_Pos           (4UL)                     /*!< EPSET4 (Bit 4)                                        */
#define USB_EPINTSET_EPSET4_Msk           (0x10UL)                  /*!< EPSET4 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET5_Pos           (5UL)                     /*!< EPSET5 (Bit 5)                                        */
#define USB_EPINTSET_EPSET5_Msk           (0x20UL)                  /*!< EPSET5 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET6_Pos           (6UL)                     /*!< EPSET6 (Bit 6)                                        */
#define USB_EPINTSET_EPSET6_Msk           (0x40UL)                  /*!< EPSET6 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET7_Pos           (7UL)                     /*!< EPSET7 (Bit 7)                                        */
#define USB_EPINTSET_EPSET7_Msk           (0x80UL)                  /*!< EPSET7 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET8_Pos           (8UL)                     /*!< EPSET8 (Bit 8)                                        */
#define USB_EPINTSET_EPSET8_Msk           (0x100UL)                 /*!< EPSET8 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET9_Pos           (9UL)                     /*!< EPSET9 (Bit 9)                                        */
#define USB_EPINTSET_EPSET9_Msk           (0x200UL)                 /*!< EPSET9 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTSET_EPSET10_Pos          (10UL)                    /*!< EPSET10 (Bit 10)                                      */
#define USB_EPINTSET_EPSET10_Msk          (0x400UL)                 /*!< EPSET10 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET11_Pos          (11UL)                    /*!< EPSET11 (Bit 11)                                      */
#define USB_EPINTSET_EPSET11_Msk          (0x800UL)                 /*!< EPSET11 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET12_Pos          (12UL)                    /*!< EPSET12 (Bit 12)                                      */
#define USB_EPINTSET_EPSET12_Msk          (0x1000UL)                /*!< EPSET12 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET13_Pos          (13UL)                    /*!< EPSET13 (Bit 13)                                      */
#define USB_EPINTSET_EPSET13_Msk          (0x2000UL)                /*!< EPSET13 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET14_Pos          (14UL)                    /*!< EPSET14 (Bit 14)                                      */
#define USB_EPINTSET_EPSET14_Msk          (0x4000UL)                /*!< EPSET14 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET15_Pos          (15UL)                    /*!< EPSET15 (Bit 15)                                      */
#define USB_EPINTSET_EPSET15_Msk          (0x8000UL)                /*!< EPSET15 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET16_Pos          (16UL)                    /*!< EPSET16 (Bit 16)                                      */
#define USB_EPINTSET_EPSET16_Msk          (0x10000UL)               /*!< EPSET16 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET17_Pos          (17UL)                    /*!< EPSET17 (Bit 17)                                      */
#define USB_EPINTSET_EPSET17_Msk          (0x20000UL)               /*!< EPSET17 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET18_Pos          (18UL)                    /*!< EPSET18 (Bit 18)                                      */
#define USB_EPINTSET_EPSET18_Msk          (0x40000UL)               /*!< EPSET18 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET19_Pos          (19UL)                    /*!< EPSET19 (Bit 19)                                      */
#define USB_EPINTSET_EPSET19_Msk          (0x80000UL)               /*!< EPSET19 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET20_Pos          (20UL)                    /*!< EPSET20 (Bit 20)                                      */
#define USB_EPINTSET_EPSET20_Msk          (0x100000UL)              /*!< EPSET20 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET21_Pos          (21UL)                    /*!< EPSET21 (Bit 21)                                      */
#define USB_EPINTSET_EPSET21_Msk          (0x200000UL)              /*!< EPSET21 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET22_Pos          (22UL)                    /*!< EPSET22 (Bit 22)                                      */
#define USB_EPINTSET_EPSET22_Msk          (0x400000UL)              /*!< EPSET22 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET23_Pos          (23UL)                    /*!< EPSET23 (Bit 23)                                      */
#define USB_EPINTSET_EPSET23_Msk          (0x800000UL)              /*!< EPSET23 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET24_Pos          (24UL)                    /*!< EPSET24 (Bit 24)                                      */
#define USB_EPINTSET_EPSET24_Msk          (0x1000000UL)             /*!< EPSET24 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET25_Pos          (25UL)                    /*!< EPSET25 (Bit 25)                                      */
#define USB_EPINTSET_EPSET25_Msk          (0x2000000UL)             /*!< EPSET25 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET26_Pos          (26UL)                    /*!< EPSET26 (Bit 26)                                      */
#define USB_EPINTSET_EPSET26_Msk          (0x4000000UL)             /*!< EPSET26 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET27_Pos          (27UL)                    /*!< EPSET27 (Bit 27)                                      */
#define USB_EPINTSET_EPSET27_Msk          (0x8000000UL)             /*!< EPSET27 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET28_Pos          (28UL)                    /*!< EPSET28 (Bit 28)                                      */
#define USB_EPINTSET_EPSET28_Msk          (0x10000000UL)            /*!< EPSET28 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET29_Pos          (29UL)                    /*!< EPSET29 (Bit 29)                                      */
#define USB_EPINTSET_EPSET29_Msk          (0x20000000UL)            /*!< EPSET29 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET30_Pos          (30UL)                    /*!< EPSET30 (Bit 30)                                      */
#define USB_EPINTSET_EPSET30_Msk          (0x40000000UL)            /*!< EPSET30 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTSET_EPSET31_Pos          (31UL)                    /*!< EPSET31 (Bit 31)                                      */
#define USB_EPINTSET_EPSET31_Msk          (0x80000000UL)            /*!< EPSET31 (Bitfield-Mask: 0x01)                         */
/* =======================================================  EPINTPRI  ======================================================== */
#define USB_EPINTPRI_EPPRI0_Pos           (0UL)                     /*!< EPPRI0 (Bit 0)                                        */
#define USB_EPINTPRI_EPPRI0_Msk           (0x1UL)                   /*!< EPPRI0 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI1_Pos           (1UL)                     /*!< EPPRI1 (Bit 1)                                        */
#define USB_EPINTPRI_EPPRI1_Msk           (0x2UL)                   /*!< EPPRI1 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI2_Pos           (2UL)                     /*!< EPPRI2 (Bit 2)                                        */
#define USB_EPINTPRI_EPPRI2_Msk           (0x4UL)                   /*!< EPPRI2 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI3_Pos           (3UL)                     /*!< EPPRI3 (Bit 3)                                        */
#define USB_EPINTPRI_EPPRI3_Msk           (0x8UL)                   /*!< EPPRI3 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI4_Pos           (4UL)                     /*!< EPPRI4 (Bit 4)                                        */
#define USB_EPINTPRI_EPPRI4_Msk           (0x10UL)                  /*!< EPPRI4 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI5_Pos           (5UL)                     /*!< EPPRI5 (Bit 5)                                        */
#define USB_EPINTPRI_EPPRI5_Msk           (0x20UL)                  /*!< EPPRI5 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI6_Pos           (6UL)                     /*!< EPPRI6 (Bit 6)                                        */
#define USB_EPINTPRI_EPPRI6_Msk           (0x40UL)                  /*!< EPPRI6 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI7_Pos           (7UL)                     /*!< EPPRI7 (Bit 7)                                        */
#define USB_EPINTPRI_EPPRI7_Msk           (0x80UL)                  /*!< EPPRI7 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI8_Pos           (8UL)                     /*!< EPPRI8 (Bit 8)                                        */
#define USB_EPINTPRI_EPPRI8_Msk           (0x100UL)                 /*!< EPPRI8 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI9_Pos           (9UL)                     /*!< EPPRI9 (Bit 9)                                        */
#define USB_EPINTPRI_EPPRI9_Msk           (0x200UL)                 /*!< EPPRI9 (Bitfield-Mask: 0x01)                          */
#define USB_EPINTPRI_EPPRI10_Pos          (10UL)                    /*!< EPPRI10 (Bit 10)                                      */
#define USB_EPINTPRI_EPPRI10_Msk          (0x400UL)                 /*!< EPPRI10 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI11_Pos          (11UL)                    /*!< EPPRI11 (Bit 11)                                      */
#define USB_EPINTPRI_EPPRI11_Msk          (0x800UL)                 /*!< EPPRI11 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI12_Pos          (12UL)                    /*!< EPPRI12 (Bit 12)                                      */
#define USB_EPINTPRI_EPPRI12_Msk          (0x1000UL)                /*!< EPPRI12 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI13_Pos          (13UL)                    /*!< EPPRI13 (Bit 13)                                      */
#define USB_EPINTPRI_EPPRI13_Msk          (0x2000UL)                /*!< EPPRI13 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI14_Pos          (14UL)                    /*!< EPPRI14 (Bit 14)                                      */
#define USB_EPINTPRI_EPPRI14_Msk          (0x4000UL)                /*!< EPPRI14 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI15_Pos          (15UL)                    /*!< EPPRI15 (Bit 15)                                      */
#define USB_EPINTPRI_EPPRI15_Msk          (0x8000UL)                /*!< EPPRI15 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI16_Pos          (16UL)                    /*!< EPPRI16 (Bit 16)                                      */
#define USB_EPINTPRI_EPPRI16_Msk          (0x10000UL)               /*!< EPPRI16 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI17_Pos          (17UL)                    /*!< EPPRI17 (Bit 17)                                      */
#define USB_EPINTPRI_EPPRI17_Msk          (0x20000UL)               /*!< EPPRI17 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI18_Pos          (18UL)                    /*!< EPPRI18 (Bit 18)                                      */
#define USB_EPINTPRI_EPPRI18_Msk          (0x40000UL)               /*!< EPPRI18 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI19_Pos          (19UL)                    /*!< EPPRI19 (Bit 19)                                      */
#define USB_EPINTPRI_EPPRI19_Msk          (0x80000UL)               /*!< EPPRI19 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI20_Pos          (20UL)                    /*!< EPPRI20 (Bit 20)                                      */
#define USB_EPINTPRI_EPPRI20_Msk          (0x100000UL)              /*!< EPPRI20 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI21_Pos          (21UL)                    /*!< EPPRI21 (Bit 21)                                      */
#define USB_EPINTPRI_EPPRI21_Msk          (0x200000UL)              /*!< EPPRI21 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI22_Pos          (22UL)                    /*!< EPPRI22 (Bit 22)                                      */
#define USB_EPINTPRI_EPPRI22_Msk          (0x400000UL)              /*!< EPPRI22 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI23_Pos          (23UL)                    /*!< EPPRI23 (Bit 23)                                      */
#define USB_EPINTPRI_EPPRI23_Msk          (0x800000UL)              /*!< EPPRI23 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI24_Pos          (24UL)                    /*!< EPPRI24 (Bit 24)                                      */
#define USB_EPINTPRI_EPPRI24_Msk          (0x1000000UL)             /*!< EPPRI24 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI25_Pos          (25UL)                    /*!< EPPRI25 (Bit 25)                                      */
#define USB_EPINTPRI_EPPRI25_Msk          (0x2000000UL)             /*!< EPPRI25 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI26_Pos          (26UL)                    /*!< EPPRI26 (Bit 26)                                      */
#define USB_EPINTPRI_EPPRI26_Msk          (0x4000000UL)             /*!< EPPRI26 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI27_Pos          (27UL)                    /*!< EPPRI27 (Bit 27)                                      */
#define USB_EPINTPRI_EPPRI27_Msk          (0x8000000UL)             /*!< EPPRI27 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI28_Pos          (28UL)                    /*!< EPPRI28 (Bit 28)                                      */
#define USB_EPINTPRI_EPPRI28_Msk          (0x10000000UL)            /*!< EPPRI28 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI29_Pos          (29UL)                    /*!< EPPRI29 (Bit 29)                                      */
#define USB_EPINTPRI_EPPRI29_Msk          (0x20000000UL)            /*!< EPPRI29 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI30_Pos          (30UL)                    /*!< EPPRI30 (Bit 30)                                      */
#define USB_EPINTPRI_EPPRI30_Msk          (0x40000000UL)            /*!< EPPRI30 (Bitfield-Mask: 0x01)                         */
#define USB_EPINTPRI_EPPRI31_Pos          (31UL)                    /*!< EPPRI31 (Bit 31)                                      */
#define USB_EPINTPRI_EPPRI31_Msk          (0x80000000UL)            /*!< EPPRI31 (Bitfield-Mask: 0x01)                         */
/* =========================================================  REEP  ========================================================== */
#define USB_REEP_EPR0_Pos                 (0UL)                     /*!< EPR0 (Bit 0)                                          */
#define USB_REEP_EPR0_Msk                 (0x1UL)                   /*!< EPR0 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR1_Pos                 (1UL)                     /*!< EPR1 (Bit 1)                                          */
#define USB_REEP_EPR1_Msk                 (0x2UL)                   /*!< EPR1 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR2_Pos                 (2UL)                     /*!< EPR2 (Bit 2)                                          */
#define USB_REEP_EPR2_Msk                 (0x4UL)                   /*!< EPR2 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR3_Pos                 (3UL)                     /*!< EPR3 (Bit 3)                                          */
#define USB_REEP_EPR3_Msk                 (0x8UL)                   /*!< EPR3 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR4_Pos                 (4UL)                     /*!< EPR4 (Bit 4)                                          */
#define USB_REEP_EPR4_Msk                 (0x10UL)                  /*!< EPR4 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR5_Pos                 (5UL)                     /*!< EPR5 (Bit 5)                                          */
#define USB_REEP_EPR5_Msk                 (0x20UL)                  /*!< EPR5 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR6_Pos                 (6UL)                     /*!< EPR6 (Bit 6)                                          */
#define USB_REEP_EPR6_Msk                 (0x40UL)                  /*!< EPR6 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR7_Pos                 (7UL)                     /*!< EPR7 (Bit 7)                                          */
#define USB_REEP_EPR7_Msk                 (0x80UL)                  /*!< EPR7 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR8_Pos                 (8UL)                     /*!< EPR8 (Bit 8)                                          */
#define USB_REEP_EPR8_Msk                 (0x100UL)                 /*!< EPR8 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR9_Pos                 (9UL)                     /*!< EPR9 (Bit 9)                                          */
#define USB_REEP_EPR9_Msk                 (0x200UL)                 /*!< EPR9 (Bitfield-Mask: 0x01)                            */
#define USB_REEP_EPR10_Pos                (10UL)                    /*!< EPR10 (Bit 10)                                        */
#define USB_REEP_EPR10_Msk                (0x400UL)                 /*!< EPR10 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR11_Pos                (11UL)                    /*!< EPR11 (Bit 11)                                        */
#define USB_REEP_EPR11_Msk                (0x800UL)                 /*!< EPR11 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR12_Pos                (12UL)                    /*!< EPR12 (Bit 12)                                        */
#define USB_REEP_EPR12_Msk                (0x1000UL)                /*!< EPR12 (Bitfield-Mask: 0x01)                           */
