lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_REEP_EPR13_Pos                (13UL)                    /*!< EPR13 (Bit 13)                                        */
#define USB_REEP_EPR13_Msk                (0x2000UL)                /*!< EPR13 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR14_Pos                (14UL)                    /*!< EPR14 (Bit 14)                                        */
#define USB_REEP_EPR14_Msk                (0x4000UL)                /*!< EPR14 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR15_Pos                (15UL)                    /*!< EPR15 (Bit 15)                                        */
#define USB_REEP_EPR15_Msk                (0x8000UL)                /*!< EPR15 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR16_Pos                (16UL)                    /*!< EPR16 (Bit 16)                                        */
#define USB_REEP_EPR16_Msk                (0x10000UL)               /*!< EPR16 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR17_Pos                (17UL)                    /*!< EPR17 (Bit 17)                                        */
#define USB_REEP_EPR17_Msk                (0x20000UL)               /*!< EPR17 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR18_Pos                (18UL)                    /*!< EPR18 (Bit 18)                                        */
#define USB_REEP_EPR18_Msk                (0x40000UL)               /*!< EPR18 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR19_Pos                (19UL)                    /*!< EPR19 (Bit 19)                                        */
#define USB_REEP_EPR19_Msk                (0x80000UL)               /*!< EPR19 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR20_Pos                (20UL)                    /*!< EPR20 (Bit 20)                                        */
#define USB_REEP_EPR20_Msk                (0x100000UL)              /*!< EPR20 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR21_Pos                (21UL)                    /*!< EPR21 (Bit 21)                                        */
#define USB_REEP_EPR21_Msk                (0x200000UL)              /*!< EPR21 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR22_Pos                (22UL)                    /*!< EPR22 (Bit 22)                                        */
#define USB_REEP_EPR22_Msk                (0x400000UL)              /*!< EPR22 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR23_Pos                (23UL)                    /*!< EPR23 (Bit 23)                                        */
#define USB_REEP_EPR23_Msk                (0x800000UL)              /*!< EPR23 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR24_Pos                (24UL)                    /*!< EPR24 (Bit 24)                                        */
#define USB_REEP_EPR24_Msk                (0x1000000UL)             /*!< EPR24 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR25_Pos                (25UL)                    /*!< EPR25 (Bit 25)                                        */
#define USB_REEP_EPR25_Msk                (0x2000000UL)             /*!< EPR25 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR26_Pos                (26UL)                    /*!< EPR26 (Bit 26)                                        */
#define USB_REEP_EPR26_Msk                (0x4000000UL)             /*!< EPR26 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR27_Pos                (27UL)                    /*!< EPR27 (Bit 27)                                        */
#define USB_REEP_EPR27_Msk                (0x8000000UL)             /*!< EPR27 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR28_Pos                (28UL)                    /*!< EPR28 (Bit 28)                                        */
#define USB_REEP_EPR28_Msk                (0x10000000UL)            /*!< EPR28 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR29_Pos                (29UL)                    /*!< EPR29 (Bit 29)                                        */
#define USB_REEP_EPR29_Msk                (0x20000000UL)            /*!< EPR29 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR30_Pos                (30UL)                    /*!< EPR30 (Bit 30)                                        */
#define USB_REEP_EPR30_Msk                (0x40000000UL)            /*!< EPR30 (Bitfield-Mask: 0x01)                           */
#define USB_REEP_EPR31_Pos                (31UL)                    /*!< EPR31 (Bit 31)                                        */
#define USB_REEP_EPR31_Msk                (0x80000000UL)            /*!< EPR31 (Bitfield-Mask: 0x01)                           */
/* =========================================================  EPIND  ========================================================= */
#define USB_EPIND_PHY_EP_Pos              (0UL)                     /*!< PHY_EP (Bit 0)                                        */
#define USB_EPIND_PHY_EP_Msk              (0x1fUL)                  /*!< PHY_EP (Bitfield-Mask: 0x1f)                          */
/* =======================================================  MAXPSIZE  ======================================================== */
#define USB_MAXPSIZE_MPS_Pos              (0UL)                     /*!< MPS (Bit 0)                                           */
#define USB_MAXPSIZE_MPS_Msk              (0x3ffUL)                 /*!< MPS (Bitfield-Mask: 0x3ff)                            */
/* ========================================================  DMARST  ========================================================= */
#define USB_DMARST_EPRST0_Pos             (0UL)                     /*!< EPRST0 (Bit 0)                                        */
#define USB_DMARST_EPRST0_Msk             (0x1UL)                   /*!< EPRST0 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST1_Pos             (1UL)                     /*!< EPRST1 (Bit 1)                                        */
#define USB_DMARST_EPRST1_Msk             (0x2UL)                   /*!< EPRST1 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST2_Pos             (2UL)                     /*!< EPRST2 (Bit 2)                                        */
#define USB_DMARST_EPRST2_Msk             (0x4UL)                   /*!< EPRST2 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST3_Pos             (3UL)                     /*!< EPRST3 (Bit 3)                                        */
#define USB_DMARST_EPRST3_Msk             (0x8UL)                   /*!< EPRST3 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST4_Pos             (4UL)                     /*!< EPRST4 (Bit 4)                                        */
#define USB_DMARST_EPRST4_Msk             (0x10UL)                  /*!< EPRST4 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST5_Pos             (5UL)                     /*!< EPRST5 (Bit 5)                                        */
#define USB_DMARST_EPRST5_Msk             (0x20UL)                  /*!< EPRST5 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST6_Pos             (6UL)                     /*!< EPRST6 (Bit 6)                                        */
#define USB_DMARST_EPRST6_Msk             (0x40UL)                  /*!< EPRST6 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST7_Pos             (7UL)                     /*!< EPRST7 (Bit 7)                                        */
#define USB_DMARST_EPRST7_Msk             (0x80UL)                  /*!< EPRST7 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST8_Pos             (8UL)                     /*!< EPRST8 (Bit 8)                                        */
#define USB_DMARST_EPRST8_Msk             (0x100UL)                 /*!< EPRST8 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST9_Pos             (9UL)                     /*!< EPRST9 (Bit 9)                                        */
#define USB_DMARST_EPRST9_Msk             (0x200UL)                 /*!< EPRST9 (Bitfield-Mask: 0x01)                          */
#define USB_DMARST_EPRST10_Pos            (10UL)                    /*!< EPRST10 (Bit 10)                                      */
#define USB_DMARST_EPRST10_Msk            (0x400UL)                 /*!< EPRST10 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST11_Pos            (11UL)                    /*!< EPRST11 (Bit 11)                                      */
#define USB_DMARST_EPRST11_Msk            (0x800UL)                 /*!< EPRST11 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST12_Pos            (12UL)                    /*!< EPRST12 (Bit 12)                                      */
#define USB_DMARST_EPRST12_Msk            (0x1000UL)                /*!< EPRST12 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST13_Pos            (13UL)                    /*!< EPRST13 (Bit 13)                                      */
#define USB_DMARST_EPRST13_Msk            (0x2000UL)                /*!< EPRST13 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST14_Pos            (14UL)                    /*!< EPRST14 (Bit 14)                                      */
#define USB_DMARST_EPRST14_Msk            (0x4000UL)                /*!< EPRST14 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST15_Pos            (15UL)                    /*!< EPRST15 (Bit 15)                                      */
#define USB_DMARST_EPRST15_Msk            (0x8000UL)                /*!< EPRST15 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST16_Pos            (16UL)                    /*!< EPRST16 (Bit 16)                                      */
#define USB_DMARST_EPRST16_Msk            (0x10000UL)               /*!< EPRST16 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST17_Pos            (17UL)                    /*!< EPRST17 (Bit 17)                                      */
#define USB_DMARST_EPRST17_Msk            (0x20000UL)               /*!< EPRST17 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST18_Pos            (18UL)                    /*!< EPRST18 (Bit 18)                                      */
#define USB_DMARST_EPRST18_Msk            (0x40000UL)               /*!< EPRST18 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST19_Pos            (19UL)                    /*!< EPRST19 (Bit 19)                                      */
#define USB_DMARST_EPRST19_Msk            (0x80000UL)               /*!< EPRST19 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST20_Pos            (20UL)                    /*!< EPRST20 (Bit 20)                                      */
#define USB_DMARST_EPRST20_Msk            (0x100000UL)              /*!< EPRST20 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST21_Pos            (21UL)                    /*!< EPRST21 (Bit 21)                                      */
#define USB_DMARST_EPRST21_Msk            (0x200000UL)              /*!< EPRST21 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST22_Pos            (22UL)                    /*!< EPRST22 (Bit 22)                                      */
#define USB_DMARST_EPRST22_Msk            (0x400000UL)              /*!< EPRST22 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST23_Pos            (23UL)                    /*!< EPRST23 (Bit 23)                                      */
#define USB_DMARST_EPRST23_Msk            (0x800000UL)              /*!< EPRST23 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST24_Pos            (24UL)                    /*!< EPRST24 (Bit 24)                                      */
#define USB_DMARST_EPRST24_Msk            (0x1000000UL)             /*!< EPRST24 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST25_Pos            (25UL)                    /*!< EPRST25 (Bit 25)                                      */
#define USB_DMARST_EPRST25_Msk            (0x2000000UL)             /*!< EPRST25 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST26_Pos            (26UL)                    /*!< EPRST26 (Bit 26)                                      */
#define USB_DMARST_EPRST26_Msk            (0x4000000UL)             /*!< EPRST26 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST27_Pos            (27UL)                    /*!< EPRST27 (Bit 27)                                      */
#define USB_DMARST_EPRST27_Msk            (0x8000000UL)             /*!< EPRST27 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST28_Pos            (28UL)                    /*!< EPRST28 (Bit 28)                                      */
#define USB_DMARST_EPRST28_Msk            (0x10000000UL)            /*!< EPRST28 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST29_Pos            (29UL)                    /*!< EPRST29 (Bit 29)                                      */
#define USB_DMARST_EPRST29_Msk            (0x20000000UL)            /*!< EPRST29 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST30_Pos            (30UL)                    /*!< EPRST30 (Bit 30)                                      */
#define USB_DMARST_EPRST30_Msk            (0x40000000UL)            /*!< EPRST30 (Bitfield-Mask: 0x01)                         */
#define USB_DMARST_EPRST31_Pos            (31UL)                    /*!< EPRST31 (Bit 31)                                      */
#define USB_DMARST_EPRST31_Msk            (0x80000000UL)            /*!< EPRST31 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DMARCLR  ======================================================== */
#define USB_DMARCLR_EPRCLR0_Pos           (0UL)                     /*!< EPRCLR0 (Bit 0)                                       */
#define USB_DMARCLR_EPRCLR0_Msk           (0x1UL)                   /*!< EPRCLR0 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR1_Pos           (1UL)                     /*!< EPRCLR1 (Bit 1)                                       */
#define USB_DMARCLR_EPRCLR1_Msk           (0x2UL)                   /*!< EPRCLR1 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR2_Pos           (2UL)                     /*!< EPRCLR2 (Bit 2)                                       */
#define USB_DMARCLR_EPRCLR2_Msk           (0x4UL)                   /*!< EPRCLR2 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR3_Pos           (3UL)                     /*!< EPRCLR3 (Bit 3)                                       */
#define USB_DMARCLR_EPRCLR3_Msk           (0x8UL)                   /*!< EPRCLR3 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR4_Pos           (4UL)                     /*!< EPRCLR4 (Bit 4)                                       */
#define USB_DMARCLR_EPRCLR4_Msk           (0x10UL)                  /*!< EPRCLR4 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR5_Pos           (5UL)                     /*!< EPRCLR5 (Bit 5)                                       */
#define USB_DMARCLR_EPRCLR5_Msk           (0x20UL)                  /*!< EPRCLR5 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR6_Pos           (6UL)                     /*!< EPRCLR6 (Bit 6)                                       */
#define USB_DMARCLR_EPRCLR6_Msk           (0x40UL)                  /*!< EPRCLR6 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR7_Pos           (7UL)                     /*!< EPRCLR7 (Bit 7)                                       */
#define USB_DMARCLR_EPRCLR7_Msk           (0x80UL)                  /*!< EPRCLR7 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR8_Pos           (8UL)                     /*!< EPRCLR8 (Bit 8)                                       */
#define USB_DMARCLR_EPRCLR8_Msk           (0x100UL)                 /*!< EPRCLR8 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR9_Pos           (9UL)                     /*!< EPRCLR9 (Bit 9)                                       */
#define USB_DMARCLR_EPRCLR9_Msk           (0x200UL)                 /*!< EPRCLR9 (Bitfield-Mask: 0x01)                         */
#define USB_DMARCLR_EPRCLR10_Pos          (10UL)                    /*!< EPRCLR10 (Bit 10)                                     */
#define USB_DMARCLR_EPRCLR10_Msk          (0x400UL)                 /*!< EPRCLR10 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR11_Pos          (11UL)                    /*!< EPRCLR11 (Bit 11)                                     */
#define USB_DMARCLR_EPRCLR11_Msk          (0x800UL)                 /*!< EPRCLR11 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR12_Pos          (12UL)                    /*!< EPRCLR12 (Bit 12)                                     */
#define USB_DMARCLR_EPRCLR12_Msk          (0x1000UL)                /*!< EPRCLR12 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR13_Pos          (13UL)                    /*!< EPRCLR13 (Bit 13)                                     */
#define USB_DMARCLR_EPRCLR13_Msk          (0x2000UL)                /*!< EPRCLR13 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR14_Pos          (14UL)                    /*!< EPRCLR14 (Bit 14)                                     */
#define USB_DMARCLR_EPRCLR14_Msk          (0x4000UL)                /*!< EPRCLR14 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR15_Pos          (15UL)                    /*!< EPRCLR15 (Bit 15)                                     */
#define USB_DMARCLR_EPRCLR15_Msk          (0x8000UL)                /*!< EPRCLR15 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR16_Pos          (16UL)                    /*!< EPRCLR16 (Bit 16)                                     */
#define USB_DMARCLR_EPRCLR16_Msk          (0x10000UL)               /*!< EPRCLR16 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR17_Pos          (17UL)                    /*!< EPRCLR17 (Bit 17)                                     */
#define USB_DMARCLR_EPRCLR17_Msk          (0x20000UL)               /*!< EPRCLR17 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR18_Pos          (18UL)                    /*!< EPRCLR18 (Bit 18)                                     */
#define USB_DMARCLR_EPRCLR18_Msk          (0x40000UL)               /*!< EPRCLR18 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR19_Pos          (19UL)                    /*!< EPRCLR19 (Bit 19)                                     */
#define USB_DMARCLR_EPRCLR19_Msk          (0x80000UL)               /*!< EPRCLR19 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR20_Pos          (20UL)                    /*!< EPRCLR20 (Bit 20)                                     */
#define USB_DMARCLR_EPRCLR20_Msk          (0x100000UL)              /*!< EPRCLR20 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR21_Pos          (21UL)                    /*!< EPRCLR21 (Bit 21)                                     */
#define USB_DMARCLR_EPRCLR21_Msk          (0x200000UL)              /*!< EPRCLR21 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR22_Pos          (22UL)                    /*!< EPRCLR22 (Bit 22)                                     */
#define USB_DMARCLR_EPRCLR22_Msk          (0x400000UL)              /*!< EPRCLR22 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR23_Pos          (23UL)                    /*!< EPRCLR23 (Bit 23)                                     */
#define USB_DMARCLR_EPRCLR23_Msk          (0x800000UL)              /*!< EPRCLR23 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR24_Pos          (24UL)                    /*!< EPRCLR24 (Bit 24)                                     */
#define USB_DMARCLR_EPRCLR24_Msk          (0x1000000UL)             /*!< EPRCLR24 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR25_Pos          (25UL)                    /*!< EPRCLR25 (Bit 25)                                     */
#define USB_DMARCLR_EPRCLR25_Msk          (0x2000000UL)             /*!< EPRCLR25 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR26_Pos          (26UL)                    /*!< EPRCLR26 (Bit 26)                                     */
#define USB_DMARCLR_EPRCLR26_Msk          (0x4000000UL)             /*!< EPRCLR26 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR27_Pos          (27UL)                    /*!< EPRCLR27 (Bit 27)                                     */
#define USB_DMARCLR_EPRCLR27_Msk          (0x8000000UL)             /*!< EPRCLR27 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR28_Pos          (28UL)                    /*!< EPRCLR28 (Bit 28)                                     */
#define USB_DMARCLR_EPRCLR28_Msk          (0x10000000UL)            /*!< EPRCLR28 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR29_Pos          (29UL)                    /*!< EPRCLR29 (Bit 29)                                     */
#define USB_DMARCLR_EPRCLR29_Msk          (0x20000000UL)            /*!< EPRCLR29 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR30_Pos          (30UL)                    /*!< EPRCLR30 (Bit 30)                                     */
#define USB_DMARCLR_EPRCLR30_Msk          (0x40000000UL)            /*!< EPRCLR30 (Bitfield-Mask: 0x01)                        */
#define USB_DMARCLR_EPRCLR31_Pos          (31UL)                    /*!< EPRCLR31 (Bit 31)                                     */
#define USB_DMARCLR_EPRCLR31_Msk          (0x80000000UL)            /*!< EPRCLR31 (Bitfield-Mask: 0x01)                        */
/* ========================================================  DMARSET  ======================================================== */
#define USB_DMARSET_EPRSET0_Pos           (0UL)                     /*!< EPRSET0 (Bit 0)                                       */
#define USB_DMARSET_EPRSET0_Msk           (0x1UL)                   /*!< EPRSET0 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET1_Pos           (1UL)                     /*!< EPRSET1 (Bit 1)                                       */
#define USB_DMARSET_EPRSET1_Msk           (0x2UL)                   /*!< EPRSET1 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET2_Pos           (2UL)                     /*!< EPRSET2 (Bit 2)                                       */
#define USB_DMARSET_EPRSET2_Msk           (0x4UL)                   /*!< EPRSET2 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET3_Pos           (3UL)                     /*!< EPRSET3 (Bit 3)                                       */
#define USB_DMARSET_EPRSET3_Msk           (0x8UL)                   /*!< EPRSET3 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET4_Pos           (4UL)                     /*!< EPRSET4 (Bit 4)                                       */
