lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_DMARSET_EPRSET4_Msk           (0x10UL)                  /*!< EPRSET4 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET5_Pos           (5UL)                     /*!< EPRSET5 (Bit 5)                                       */
#define USB_DMARSET_EPRSET5_Msk           (0x20UL)                  /*!< EPRSET5 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET6_Pos           (6UL)                     /*!< EPRSET6 (Bit 6)                                       */
#define USB_DMARSET_EPRSET6_Msk           (0x40UL)                  /*!< EPRSET6 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET7_Pos           (7UL)                     /*!< EPRSET7 (Bit 7)                                       */
#define USB_DMARSET_EPRSET7_Msk           (0x80UL)                  /*!< EPRSET7 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET8_Pos           (8UL)                     /*!< EPRSET8 (Bit 8)                                       */
#define USB_DMARSET_EPRSET8_Msk           (0x100UL)                 /*!< EPRSET8 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET9_Pos           (9UL)                     /*!< EPRSET9 (Bit 9)                                       */
#define USB_DMARSET_EPRSET9_Msk           (0x200UL)                 /*!< EPRSET9 (Bitfield-Mask: 0x01)                         */
#define USB_DMARSET_EPRSET10_Pos          (10UL)                    /*!< EPRSET10 (Bit 10)                                     */
#define USB_DMARSET_EPRSET10_Msk          (0x400UL)                 /*!< EPRSET10 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET11_Pos          (11UL)                    /*!< EPRSET11 (Bit 11)                                     */
#define USB_DMARSET_EPRSET11_Msk          (0x800UL)                 /*!< EPRSET11 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET12_Pos          (12UL)                    /*!< EPRSET12 (Bit 12)                                     */
#define USB_DMARSET_EPRSET12_Msk          (0x1000UL)                /*!< EPRSET12 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET13_Pos          (13UL)                    /*!< EPRSET13 (Bit 13)                                     */
#define USB_DMARSET_EPRSET13_Msk          (0x2000UL)                /*!< EPRSET13 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET14_Pos          (14UL)                    /*!< EPRSET14 (Bit 14)                                     */
#define USB_DMARSET_EPRSET14_Msk          (0x4000UL)                /*!< EPRSET14 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET15_Pos          (15UL)                    /*!< EPRSET15 (Bit 15)                                     */
#define USB_DMARSET_EPRSET15_Msk          (0x8000UL)                /*!< EPRSET15 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET16_Pos          (16UL)                    /*!< EPRSET16 (Bit 16)                                     */
#define USB_DMARSET_EPRSET16_Msk          (0x10000UL)               /*!< EPRSET16 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET17_Pos          (17UL)                    /*!< EPRSET17 (Bit 17)                                     */
#define USB_DMARSET_EPRSET17_Msk          (0x20000UL)               /*!< EPRSET17 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET18_Pos          (18UL)                    /*!< EPRSET18 (Bit 18)                                     */
#define USB_DMARSET_EPRSET18_Msk          (0x40000UL)               /*!< EPRSET18 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET19_Pos          (19UL)                    /*!< EPRSET19 (Bit 19)                                     */
#define USB_DMARSET_EPRSET19_Msk          (0x80000UL)               /*!< EPRSET19 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET20_Pos          (20UL)                    /*!< EPRSET20 (Bit 20)                                     */
#define USB_DMARSET_EPRSET20_Msk          (0x100000UL)              /*!< EPRSET20 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET21_Pos          (21UL)                    /*!< EPRSET21 (Bit 21)                                     */
#define USB_DMARSET_EPRSET21_Msk          (0x200000UL)              /*!< EPRSET21 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET22_Pos          (22UL)                    /*!< EPRSET22 (Bit 22)                                     */
#define USB_DMARSET_EPRSET22_Msk          (0x400000UL)              /*!< EPRSET22 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET23_Pos          (23UL)                    /*!< EPRSET23 (Bit 23)                                     */
#define USB_DMARSET_EPRSET23_Msk          (0x800000UL)              /*!< EPRSET23 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET24_Pos          (24UL)                    /*!< EPRSET24 (Bit 24)                                     */
#define USB_DMARSET_EPRSET24_Msk          (0x1000000UL)             /*!< EPRSET24 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET25_Pos          (25UL)                    /*!< EPRSET25 (Bit 25)                                     */
#define USB_DMARSET_EPRSET25_Msk          (0x2000000UL)             /*!< EPRSET25 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET26_Pos          (26UL)                    /*!< EPRSET26 (Bit 26)                                     */
#define USB_DMARSET_EPRSET26_Msk          (0x4000000UL)             /*!< EPRSET26 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET27_Pos          (27UL)                    /*!< EPRSET27 (Bit 27)                                     */
#define USB_DMARSET_EPRSET27_Msk          (0x8000000UL)             /*!< EPRSET27 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET28_Pos          (28UL)                    /*!< EPRSET28 (Bit 28)                                     */
#define USB_DMARSET_EPRSET28_Msk          (0x10000000UL)            /*!< EPRSET28 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET29_Pos          (29UL)                    /*!< EPRSET29 (Bit 29)                                     */
#define USB_DMARSET_EPRSET29_Msk          (0x20000000UL)            /*!< EPRSET29 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET30_Pos          (30UL)                    /*!< EPRSET30 (Bit 30)                                     */
#define USB_DMARSET_EPRSET30_Msk          (0x40000000UL)            /*!< EPRSET30 (Bitfield-Mask: 0x01)                        */
#define USB_DMARSET_EPRSET31_Pos          (31UL)                    /*!< EPRSET31 (Bit 31)                                     */
#define USB_DMARSET_EPRSET31_Msk          (0x80000000UL)            /*!< EPRSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  UDCAH  ========================================================= */
#define USB_UDCAH_UDCA_ADDR_Pos           (7UL)                     /*!< UDCA_ADDR (Bit 7)                                     */
#define USB_UDCAH_UDCA_ADDR_Msk           (0xffffff80UL)            /*!< UDCA_ADDR (Bitfield-Mask: 0x1ffffff)                  */
/* ========================================================  EPDMAST  ======================================================== */
#define USB_EPDMAST_EP_DMA_ST0_Pos        (0UL)                     /*!< EP_DMA_ST0 (Bit 0)                                    */
#define USB_EPDMAST_EP_DMA_ST0_Msk        (0x1UL)                   /*!< EP_DMA_ST0 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST1_Pos        (1UL)                     /*!< EP_DMA_ST1 (Bit 1)                                    */
#define USB_EPDMAST_EP_DMA_ST1_Msk        (0x2UL)                   /*!< EP_DMA_ST1 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST2_Pos        (2UL)                     /*!< EP_DMA_ST2 (Bit 2)                                    */
#define USB_EPDMAST_EP_DMA_ST2_Msk        (0x4UL)                   /*!< EP_DMA_ST2 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST3_Pos        (3UL)                     /*!< EP_DMA_ST3 (Bit 3)                                    */
#define USB_EPDMAST_EP_DMA_ST3_Msk        (0x8UL)                   /*!< EP_DMA_ST3 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST4_Pos        (4UL)                     /*!< EP_DMA_ST4 (Bit 4)                                    */
#define USB_EPDMAST_EP_DMA_ST4_Msk        (0x10UL)                  /*!< EP_DMA_ST4 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST5_Pos        (5UL)                     /*!< EP_DMA_ST5 (Bit 5)                                    */
#define USB_EPDMAST_EP_DMA_ST5_Msk        (0x20UL)                  /*!< EP_DMA_ST5 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST6_Pos        (6UL)                     /*!< EP_DMA_ST6 (Bit 6)                                    */
#define USB_EPDMAST_EP_DMA_ST6_Msk        (0x40UL)                  /*!< EP_DMA_ST6 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST7_Pos        (7UL)                     /*!< EP_DMA_ST7 (Bit 7)                                    */
#define USB_EPDMAST_EP_DMA_ST7_Msk        (0x80UL)                  /*!< EP_DMA_ST7 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST8_Pos        (8UL)                     /*!< EP_DMA_ST8 (Bit 8)                                    */
#define USB_EPDMAST_EP_DMA_ST8_Msk        (0x100UL)                 /*!< EP_DMA_ST8 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST9_Pos        (9UL)                     /*!< EP_DMA_ST9 (Bit 9)                                    */
#define USB_EPDMAST_EP_DMA_ST9_Msk        (0x200UL)                 /*!< EP_DMA_ST9 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAST_EP_DMA_ST10_Pos       (10UL)                    /*!< EP_DMA_ST10 (Bit 10)                                  */
#define USB_EPDMAST_EP_DMA_ST10_Msk       (0x400UL)                 /*!< EP_DMA_ST10 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST11_Pos       (11UL)                    /*!< EP_DMA_ST11 (Bit 11)                                  */
#define USB_EPDMAST_EP_DMA_ST11_Msk       (0x800UL)                 /*!< EP_DMA_ST11 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST12_Pos       (12UL)                    /*!< EP_DMA_ST12 (Bit 12)                                  */
#define USB_EPDMAST_EP_DMA_ST12_Msk       (0x1000UL)                /*!< EP_DMA_ST12 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST13_Pos       (13UL)                    /*!< EP_DMA_ST13 (Bit 13)                                  */
#define USB_EPDMAST_EP_DMA_ST13_Msk       (0x2000UL)                /*!< EP_DMA_ST13 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST14_Pos       (14UL)                    /*!< EP_DMA_ST14 (Bit 14)                                  */
#define USB_EPDMAST_EP_DMA_ST14_Msk       (0x4000UL)                /*!< EP_DMA_ST14 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST15_Pos       (15UL)                    /*!< EP_DMA_ST15 (Bit 15)                                  */
#define USB_EPDMAST_EP_DMA_ST15_Msk       (0x8000UL)                /*!< EP_DMA_ST15 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST16_Pos       (16UL)                    /*!< EP_DMA_ST16 (Bit 16)                                  */
#define USB_EPDMAST_EP_DMA_ST16_Msk       (0x10000UL)               /*!< EP_DMA_ST16 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST17_Pos       (17UL)                    /*!< EP_DMA_ST17 (Bit 17)                                  */
#define USB_EPDMAST_EP_DMA_ST17_Msk       (0x20000UL)               /*!< EP_DMA_ST17 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST18_Pos       (18UL)                    /*!< EP_DMA_ST18 (Bit 18)                                  */
#define USB_EPDMAST_EP_DMA_ST18_Msk       (0x40000UL)               /*!< EP_DMA_ST18 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST19_Pos       (19UL)                    /*!< EP_DMA_ST19 (Bit 19)                                  */
#define USB_EPDMAST_EP_DMA_ST19_Msk       (0x80000UL)               /*!< EP_DMA_ST19 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST20_Pos       (20UL)                    /*!< EP_DMA_ST20 (Bit 20)                                  */
#define USB_EPDMAST_EP_DMA_ST20_Msk       (0x100000UL)              /*!< EP_DMA_ST20 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST21_Pos       (21UL)                    /*!< EP_DMA_ST21 (Bit 21)                                  */
#define USB_EPDMAST_EP_DMA_ST21_Msk       (0x200000UL)              /*!< EP_DMA_ST21 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST22_Pos       (22UL)                    /*!< EP_DMA_ST22 (Bit 22)                                  */
#define USB_EPDMAST_EP_DMA_ST22_Msk       (0x400000UL)              /*!< EP_DMA_ST22 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST23_Pos       (23UL)                    /*!< EP_DMA_ST23 (Bit 23)                                  */
#define USB_EPDMAST_EP_DMA_ST23_Msk       (0x800000UL)              /*!< EP_DMA_ST23 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST24_Pos       (24UL)                    /*!< EP_DMA_ST24 (Bit 24)                                  */
#define USB_EPDMAST_EP_DMA_ST24_Msk       (0x1000000UL)             /*!< EP_DMA_ST24 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST25_Pos       (25UL)                    /*!< EP_DMA_ST25 (Bit 25)                                  */
#define USB_EPDMAST_EP_DMA_ST25_Msk       (0x2000000UL)             /*!< EP_DMA_ST25 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST26_Pos       (26UL)                    /*!< EP_DMA_ST26 (Bit 26)                                  */
#define USB_EPDMAST_EP_DMA_ST26_Msk       (0x4000000UL)             /*!< EP_DMA_ST26 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST27_Pos       (27UL)                    /*!< EP_DMA_ST27 (Bit 27)                                  */
#define USB_EPDMAST_EP_DMA_ST27_Msk       (0x8000000UL)             /*!< EP_DMA_ST27 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST28_Pos       (28UL)                    /*!< EP_DMA_ST28 (Bit 28)                                  */
#define USB_EPDMAST_EP_DMA_ST28_Msk       (0x10000000UL)            /*!< EP_DMA_ST28 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST29_Pos       (29UL)                    /*!< EP_DMA_ST29 (Bit 29)                                  */
#define USB_EPDMAST_EP_DMA_ST29_Msk       (0x20000000UL)            /*!< EP_DMA_ST29 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST30_Pos       (30UL)                    /*!< EP_DMA_ST30 (Bit 30)                                  */
#define USB_EPDMAST_EP_DMA_ST30_Msk       (0x40000000UL)            /*!< EP_DMA_ST30 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMAST_EP_DMA_ST31_Pos       (31UL)                    /*!< EP_DMA_ST31 (Bit 31)                                  */
#define USB_EPDMAST_EP_DMA_ST31_Msk       (0x80000000UL)            /*!< EP_DMA_ST31 (Bitfield-Mask: 0x01)                     */
/* ========================================================  EPDMAEN  ======================================================== */
#define USB_EPDMAEN_EP_DMA_EN0_Pos        (0UL)                     /*!< EP_DMA_EN0 (Bit 0)                                    */
#define USB_EPDMAEN_EP_DMA_EN0_Msk        (0x1UL)                   /*!< EP_DMA_EN0 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAEN_EP_DMA_EN1_Pos        (1UL)                     /*!< EP_DMA_EN1 (Bit 1)                                    */
#define USB_EPDMAEN_EP_DMA_EN1_Msk        (0x2UL)                   /*!< EP_DMA_EN1 (Bitfield-Mask: 0x01)                      */
#define USB_EPDMAEN_EP_DMA_EN_Pos         (2UL)                     /*!< EP_DMA_EN (Bit 2)                                     */
#define USB_EPDMAEN_EP_DMA_EN_Msk         (0xfffffffcUL)            /*!< EP_DMA_EN (Bitfield-Mask: 0x3fffffff)                 */
/* =======================================================  EPDMADIS  ======================================================== */
#define USB_EPDMADIS_EP_DMA_DIS0_Pos      (0UL)                     /*!< EP_DMA_DIS0 (Bit 0)                                   */
#define USB_EPDMADIS_EP_DMA_DIS0_Msk      (0x1UL)                   /*!< EP_DMA_DIS0 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS1_Pos      (1UL)                     /*!< EP_DMA_DIS1 (Bit 1)                                   */
#define USB_EPDMADIS_EP_DMA_DIS1_Msk      (0x2UL)                   /*!< EP_DMA_DIS1 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS2_Pos      (2UL)                     /*!< EP_DMA_DIS2 (Bit 2)                                   */
#define USB_EPDMADIS_EP_DMA_DIS2_Msk      (0x4UL)                   /*!< EP_DMA_DIS2 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS3_Pos      (3UL)                     /*!< EP_DMA_DIS3 (Bit 3)                                   */
#define USB_EPDMADIS_EP_DMA_DIS3_Msk      (0x8UL)                   /*!< EP_DMA_DIS3 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS4_Pos      (4UL)                     /*!< EP_DMA_DIS4 (Bit 4)                                   */
#define USB_EPDMADIS_EP_DMA_DIS4_Msk      (0x10UL)                  /*!< EP_DMA_DIS4 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS5_Pos      (5UL)                     /*!< EP_DMA_DIS5 (Bit 5)                                   */
#define USB_EPDMADIS_EP_DMA_DIS5_Msk      (0x20UL)                  /*!< EP_DMA_DIS5 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS6_Pos      (6UL)                     /*!< EP_DMA_DIS6 (Bit 6)                                   */
#define USB_EPDMADIS_EP_DMA_DIS6_Msk      (0x40UL)                  /*!< EP_DMA_DIS6 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS7_Pos      (7UL)                     /*!< EP_DMA_DIS7 (Bit 7)                                   */
#define USB_EPDMADIS_EP_DMA_DIS7_Msk      (0x80UL)                  /*!< EP_DMA_DIS7 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS8_Pos      (8UL)                     /*!< EP_DMA_DIS8 (Bit 8)                                   */
#define USB_EPDMADIS_EP_DMA_DIS8_Msk      (0x100UL)                 /*!< EP_DMA_DIS8 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS9_Pos      (9UL)                     /*!< EP_DMA_DIS9 (Bit 9)                                   */
#define USB_EPDMADIS_EP_DMA_DIS9_Msk      (0x200UL)                 /*!< EP_DMA_DIS9 (Bitfield-Mask: 0x01)                     */
#define USB_EPDMADIS_EP_DMA_DIS10_Pos     (10UL)                    /*!< EP_DMA_DIS10 (Bit 10)                                 */
#define USB_EPDMADIS_EP_DMA_DIS10_Msk     (0x400UL)                 /*!< EP_DMA_DIS10 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS11_Pos     (11UL)                    /*!< EP_DMA_DIS11 (Bit 11)                                 */
#define USB_EPDMADIS_EP_DMA_DIS11_Msk     (0x800UL)                 /*!< EP_DMA_DIS11 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS12_Pos     (12UL)                    /*!< EP_DMA_DIS12 (Bit 12)                                 */
#define USB_EPDMADIS_EP_DMA_DIS12_Msk     (0x1000UL)                /*!< EP_DMA_DIS12 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS13_Pos     (13UL)                    /*!< EP_DMA_DIS13 (Bit 13)                                 */
#define USB_EPDMADIS_EP_DMA_DIS13_Msk     (0x2000UL)                /*!< EP_DMA_DIS13 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS14_Pos     (14UL)                    /*!< EP_DMA_DIS14 (Bit 14)                                 */
#define USB_EPDMADIS_EP_DMA_DIS14_Msk     (0x4000UL)                /*!< EP_DMA_DIS14 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS15_Pos     (15UL)                    /*!< EP_DMA_DIS15 (Bit 15)                                 */
#define USB_EPDMADIS_EP_DMA_DIS15_Msk     (0x8000UL)                /*!< EP_DMA_DIS15 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS16_Pos     (16UL)                    /*!< EP_DMA_DIS16 (Bit 16)                                 */
#define USB_EPDMADIS_EP_DMA_DIS16_Msk     (0x10000UL)               /*!< EP_DMA_DIS16 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS17_Pos     (17UL)                    /*!< EP_DMA_DIS17 (Bit 17)                                 */
#define USB_EPDMADIS_EP_DMA_DIS17_Msk     (0x20000UL)               /*!< EP_DMA_DIS17 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS18_Pos     (18UL)                    /*!< EP_DMA_DIS18 (Bit 18)                                 */
#define USB_EPDMADIS_EP_DMA_DIS18_Msk     (0x40000UL)               /*!< EP_DMA_DIS18 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS19_Pos     (19UL)                    /*!< EP_DMA_DIS19 (Bit 19)                                 */
#define USB_EPDMADIS_EP_DMA_DIS19_Msk     (0x80000UL)               /*!< EP_DMA_DIS19 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS20_Pos     (20UL)                    /*!< EP_DMA_DIS20 (Bit 20)                                 */
#define USB_EPDMADIS_EP_DMA_DIS20_Msk     (0x100000UL)              /*!< EP_DMA_DIS20 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS21_Pos     (21UL)                    /*!< EP_DMA_DIS21 (Bit 21)                                 */
#define USB_EPDMADIS_EP_DMA_DIS21_Msk     (0x200000UL)              /*!< EP_DMA_DIS21 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS22_Pos     (22UL)                    /*!< EP_DMA_DIS22 (Bit 22)                                 */
#define USB_EPDMADIS_EP_DMA_DIS22_Msk     (0x400000UL)              /*!< EP_DMA_DIS22 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS23_Pos     (23UL)                    /*!< EP_DMA_DIS23 (Bit 23)                                 */
#define USB_EPDMADIS_EP_DMA_DIS23_Msk     (0x800000UL)              /*!< EP_DMA_DIS23 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS24_Pos     (24UL)                    /*!< EP_DMA_DIS24 (Bit 24)                                 */
#define USB_EPDMADIS_EP_DMA_DIS24_Msk     (0x1000000UL)             /*!< EP_DMA_DIS24 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS25_Pos     (25UL)                    /*!< EP_DMA_DIS25 (Bit 25)                                 */
#define USB_EPDMADIS_EP_DMA_DIS25_Msk     (0x2000000UL)             /*!< EP_DMA_DIS25 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS26_Pos     (26UL)                    /*!< EP_DMA_DIS26 (Bit 26)                                 */
