lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_EPDMADIS_EP_DMA_DIS26_Msk     (0x4000000UL)             /*!< EP_DMA_DIS26 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS27_Pos     (27UL)                    /*!< EP_DMA_DIS27 (Bit 27)                                 */
#define USB_EPDMADIS_EP_DMA_DIS27_Msk     (0x8000000UL)             /*!< EP_DMA_DIS27 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS28_Pos     (28UL)                    /*!< EP_DMA_DIS28 (Bit 28)                                 */
#define USB_EPDMADIS_EP_DMA_DIS28_Msk     (0x10000000UL)            /*!< EP_DMA_DIS28 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS29_Pos     (29UL)                    /*!< EP_DMA_DIS29 (Bit 29)                                 */
#define USB_EPDMADIS_EP_DMA_DIS29_Msk     (0x20000000UL)            /*!< EP_DMA_DIS29 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS30_Pos     (30UL)                    /*!< EP_DMA_DIS30 (Bit 30)                                 */
#define USB_EPDMADIS_EP_DMA_DIS30_Msk     (0x40000000UL)            /*!< EP_DMA_DIS30 (Bitfield-Mask: 0x01)                    */
#define USB_EPDMADIS_EP_DMA_DIS31_Pos     (31UL)                    /*!< EP_DMA_DIS31 (Bit 31)                                 */
#define USB_EPDMADIS_EP_DMA_DIS31_Msk     (0x80000000UL)            /*!< EP_DMA_DIS31 (Bitfield-Mask: 0x01)                    */
/* =======================================================  DMAINTST  ======================================================== */
#define USB_DMAINTST_EOT_Pos              (0UL)                     /*!< EOT (Bit 0)                                           */
#define USB_DMAINTST_EOT_Msk              (0x1UL)                   /*!< EOT (Bitfield-Mask: 0x01)                             */
#define USB_DMAINTST_NDDR_Pos             (1UL)                     /*!< NDDR (Bit 1)                                          */
#define USB_DMAINTST_NDDR_Msk             (0x2UL)                   /*!< NDDR (Bitfield-Mask: 0x01)                            */
#define USB_DMAINTST_ERR_Pos              (2UL)                     /*!< ERR (Bit 2)                                           */
#define USB_DMAINTST_ERR_Msk              (0x4UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define USB_DMAINTEN_EOT_Pos              (0UL)                     /*!< EOT (Bit 0)                                           */
#define USB_DMAINTEN_EOT_Msk              (0x1UL)                   /*!< EOT (Bitfield-Mask: 0x01)                             */
#define USB_DMAINTEN_NDDR_Pos             (1UL)                     /*!< NDDR (Bit 1)                                          */
#define USB_DMAINTEN_NDDR_Msk             (0x2UL)                   /*!< NDDR (Bitfield-Mask: 0x01)                            */
#define USB_DMAINTEN_ERR_Pos              (2UL)                     /*!< ERR (Bit 2)                                           */
#define USB_DMAINTEN_ERR_Msk              (0x4UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
/* =======================================================  EOTINTST  ======================================================== */
#define USB_EOTINTST_EPTXINTST0_Pos       (0UL)                     /*!< EPTXINTST0 (Bit 0)                                    */
#define USB_EOTINTST_EPTXINTST0_Msk       (0x1UL)                   /*!< EPTXINTST0 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST1_Pos       (1UL)                     /*!< EPTXINTST1 (Bit 1)                                    */
#define USB_EOTINTST_EPTXINTST1_Msk       (0x2UL)                   /*!< EPTXINTST1 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST2_Pos       (2UL)                     /*!< EPTXINTST2 (Bit 2)                                    */
#define USB_EOTINTST_EPTXINTST2_Msk       (0x4UL)                   /*!< EPTXINTST2 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST3_Pos       (3UL)                     /*!< EPTXINTST3 (Bit 3)                                    */
#define USB_EOTINTST_EPTXINTST3_Msk       (0x8UL)                   /*!< EPTXINTST3 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST4_Pos       (4UL)                     /*!< EPTXINTST4 (Bit 4)                                    */
#define USB_EOTINTST_EPTXINTST4_Msk       (0x10UL)                  /*!< EPTXINTST4 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST5_Pos       (5UL)                     /*!< EPTXINTST5 (Bit 5)                                    */
#define USB_EOTINTST_EPTXINTST5_Msk       (0x20UL)                  /*!< EPTXINTST5 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST6_Pos       (6UL)                     /*!< EPTXINTST6 (Bit 6)                                    */
#define USB_EOTINTST_EPTXINTST6_Msk       (0x40UL)                  /*!< EPTXINTST6 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST7_Pos       (7UL)                     /*!< EPTXINTST7 (Bit 7)                                    */
#define USB_EOTINTST_EPTXINTST7_Msk       (0x80UL)                  /*!< EPTXINTST7 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST8_Pos       (8UL)                     /*!< EPTXINTST8 (Bit 8)                                    */
#define USB_EOTINTST_EPTXINTST8_Msk       (0x100UL)                 /*!< EPTXINTST8 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST9_Pos       (9UL)                     /*!< EPTXINTST9 (Bit 9)                                    */
#define USB_EOTINTST_EPTXINTST9_Msk       (0x200UL)                 /*!< EPTXINTST9 (Bitfield-Mask: 0x01)                      */
#define USB_EOTINTST_EPTXINTST10_Pos      (10UL)                    /*!< EPTXINTST10 (Bit 10)                                  */
#define USB_EOTINTST_EPTXINTST10_Msk      (0x400UL)                 /*!< EPTXINTST10 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST11_Pos      (11UL)                    /*!< EPTXINTST11 (Bit 11)                                  */
#define USB_EOTINTST_EPTXINTST11_Msk      (0x800UL)                 /*!< EPTXINTST11 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST12_Pos      (12UL)                    /*!< EPTXINTST12 (Bit 12)                                  */
#define USB_EOTINTST_EPTXINTST12_Msk      (0x1000UL)                /*!< EPTXINTST12 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST13_Pos      (13UL)                    /*!< EPTXINTST13 (Bit 13)                                  */
#define USB_EOTINTST_EPTXINTST13_Msk      (0x2000UL)                /*!< EPTXINTST13 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST14_Pos      (14UL)                    /*!< EPTXINTST14 (Bit 14)                                  */
#define USB_EOTINTST_EPTXINTST14_Msk      (0x4000UL)                /*!< EPTXINTST14 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST15_Pos      (15UL)                    /*!< EPTXINTST15 (Bit 15)                                  */
#define USB_EOTINTST_EPTXINTST15_Msk      (0x8000UL)                /*!< EPTXINTST15 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST16_Pos      (16UL)                    /*!< EPTXINTST16 (Bit 16)                                  */
#define USB_EOTINTST_EPTXINTST16_Msk      (0x10000UL)               /*!< EPTXINTST16 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST17_Pos      (17UL)                    /*!< EPTXINTST17 (Bit 17)                                  */
#define USB_EOTINTST_EPTXINTST17_Msk      (0x20000UL)               /*!< EPTXINTST17 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST18_Pos      (18UL)                    /*!< EPTXINTST18 (Bit 18)                                  */
#define USB_EOTINTST_EPTXINTST18_Msk      (0x40000UL)               /*!< EPTXINTST18 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST19_Pos      (19UL)                    /*!< EPTXINTST19 (Bit 19)                                  */
#define USB_EOTINTST_EPTXINTST19_Msk      (0x80000UL)               /*!< EPTXINTST19 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST20_Pos      (20UL)                    /*!< EPTXINTST20 (Bit 20)                                  */
#define USB_EOTINTST_EPTXINTST20_Msk      (0x100000UL)              /*!< EPTXINTST20 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST21_Pos      (21UL)                    /*!< EPTXINTST21 (Bit 21)                                  */
#define USB_EOTINTST_EPTXINTST21_Msk      (0x200000UL)              /*!< EPTXINTST21 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST22_Pos      (22UL)                    /*!< EPTXINTST22 (Bit 22)                                  */
#define USB_EOTINTST_EPTXINTST22_Msk      (0x400000UL)              /*!< EPTXINTST22 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST23_Pos      (23UL)                    /*!< EPTXINTST23 (Bit 23)                                  */
#define USB_EOTINTST_EPTXINTST23_Msk      (0x800000UL)              /*!< EPTXINTST23 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST24_Pos      (24UL)                    /*!< EPTXINTST24 (Bit 24)                                  */
#define USB_EOTINTST_EPTXINTST24_Msk      (0x1000000UL)             /*!< EPTXINTST24 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST25_Pos      (25UL)                    /*!< EPTXINTST25 (Bit 25)                                  */
#define USB_EOTINTST_EPTXINTST25_Msk      (0x2000000UL)             /*!< EPTXINTST25 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST26_Pos      (26UL)                    /*!< EPTXINTST26 (Bit 26)                                  */
#define USB_EOTINTST_EPTXINTST26_Msk      (0x4000000UL)             /*!< EPTXINTST26 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST27_Pos      (27UL)                    /*!< EPTXINTST27 (Bit 27)                                  */
#define USB_EOTINTST_EPTXINTST27_Msk      (0x8000000UL)             /*!< EPTXINTST27 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST28_Pos      (28UL)                    /*!< EPTXINTST28 (Bit 28)                                  */
#define USB_EOTINTST_EPTXINTST28_Msk      (0x10000000UL)            /*!< EPTXINTST28 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST29_Pos      (29UL)                    /*!< EPTXINTST29 (Bit 29)                                  */
#define USB_EOTINTST_EPTXINTST29_Msk      (0x20000000UL)            /*!< EPTXINTST29 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST30_Pos      (30UL)                    /*!< EPTXINTST30 (Bit 30)                                  */
#define USB_EOTINTST_EPTXINTST30_Msk      (0x40000000UL)            /*!< EPTXINTST30 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTST_EPTXINTST31_Pos      (31UL)                    /*!< EPTXINTST31 (Bit 31)                                  */
#define USB_EOTINTST_EPTXINTST31_Msk      (0x80000000UL)            /*!< EPTXINTST31 (Bitfield-Mask: 0x01)                     */
/* =======================================================  EOTINTCLR  ======================================================= */
#define USB_EOTINTCLR_EPTXINTCLR0_Pos     (0UL)                     /*!< EPTXINTCLR0 (Bit 0)                                   */
#define USB_EOTINTCLR_EPTXINTCLR0_Msk     (0x1UL)                   /*!< EPTXINTCLR0 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR1_Pos     (1UL)                     /*!< EPTXINTCLR1 (Bit 1)                                   */
#define USB_EOTINTCLR_EPTXINTCLR1_Msk     (0x2UL)                   /*!< EPTXINTCLR1 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR2_Pos     (2UL)                     /*!< EPTXINTCLR2 (Bit 2)                                   */
#define USB_EOTINTCLR_EPTXINTCLR2_Msk     (0x4UL)                   /*!< EPTXINTCLR2 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR3_Pos     (3UL)                     /*!< EPTXINTCLR3 (Bit 3)                                   */
#define USB_EOTINTCLR_EPTXINTCLR3_Msk     (0x8UL)                   /*!< EPTXINTCLR3 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR4_Pos     (4UL)                     /*!< EPTXINTCLR4 (Bit 4)                                   */
#define USB_EOTINTCLR_EPTXINTCLR4_Msk     (0x10UL)                  /*!< EPTXINTCLR4 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR5_Pos     (5UL)                     /*!< EPTXINTCLR5 (Bit 5)                                   */
#define USB_EOTINTCLR_EPTXINTCLR5_Msk     (0x20UL)                  /*!< EPTXINTCLR5 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR6_Pos     (6UL)                     /*!< EPTXINTCLR6 (Bit 6)                                   */
#define USB_EOTINTCLR_EPTXINTCLR6_Msk     (0x40UL)                  /*!< EPTXINTCLR6 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR7_Pos     (7UL)                     /*!< EPTXINTCLR7 (Bit 7)                                   */
#define USB_EOTINTCLR_EPTXINTCLR7_Msk     (0x80UL)                  /*!< EPTXINTCLR7 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR8_Pos     (8UL)                     /*!< EPTXINTCLR8 (Bit 8)                                   */
#define USB_EOTINTCLR_EPTXINTCLR8_Msk     (0x100UL)                 /*!< EPTXINTCLR8 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR9_Pos     (9UL)                     /*!< EPTXINTCLR9 (Bit 9)                                   */
#define USB_EOTINTCLR_EPTXINTCLR9_Msk     (0x200UL)                 /*!< EPTXINTCLR9 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTCLR_EPTXINTCLR10_Pos    (10UL)                    /*!< EPTXINTCLR10 (Bit 10)                                 */
#define USB_EOTINTCLR_EPTXINTCLR10_Msk    (0x400UL)                 /*!< EPTXINTCLR10 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR11_Pos    (11UL)                    /*!< EPTXINTCLR11 (Bit 11)                                 */
#define USB_EOTINTCLR_EPTXINTCLR11_Msk    (0x800UL)                 /*!< EPTXINTCLR11 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR12_Pos    (12UL)                    /*!< EPTXINTCLR12 (Bit 12)                                 */
#define USB_EOTINTCLR_EPTXINTCLR12_Msk    (0x1000UL)                /*!< EPTXINTCLR12 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR13_Pos    (13UL)                    /*!< EPTXINTCLR13 (Bit 13)                                 */
#define USB_EOTINTCLR_EPTXINTCLR13_Msk    (0x2000UL)                /*!< EPTXINTCLR13 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR14_Pos    (14UL)                    /*!< EPTXINTCLR14 (Bit 14)                                 */
#define USB_EOTINTCLR_EPTXINTCLR14_Msk    (0x4000UL)                /*!< EPTXINTCLR14 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR15_Pos    (15UL)                    /*!< EPTXINTCLR15 (Bit 15)                                 */
#define USB_EOTINTCLR_EPTXINTCLR15_Msk    (0x8000UL)                /*!< EPTXINTCLR15 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR16_Pos    (16UL)                    /*!< EPTXINTCLR16 (Bit 16)                                 */
#define USB_EOTINTCLR_EPTXINTCLR16_Msk    (0x10000UL)               /*!< EPTXINTCLR16 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR17_Pos    (17UL)                    /*!< EPTXINTCLR17 (Bit 17)                                 */
#define USB_EOTINTCLR_EPTXINTCLR17_Msk    (0x20000UL)               /*!< EPTXINTCLR17 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR18_Pos    (18UL)                    /*!< EPTXINTCLR18 (Bit 18)                                 */
#define USB_EOTINTCLR_EPTXINTCLR18_Msk    (0x40000UL)               /*!< EPTXINTCLR18 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR19_Pos    (19UL)                    /*!< EPTXINTCLR19 (Bit 19)                                 */
#define USB_EOTINTCLR_EPTXINTCLR19_Msk    (0x80000UL)               /*!< EPTXINTCLR19 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR20_Pos    (20UL)                    /*!< EPTXINTCLR20 (Bit 20)                                 */
#define USB_EOTINTCLR_EPTXINTCLR20_Msk    (0x100000UL)              /*!< EPTXINTCLR20 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR21_Pos    (21UL)                    /*!< EPTXINTCLR21 (Bit 21)                                 */
#define USB_EOTINTCLR_EPTXINTCLR21_Msk    (0x200000UL)              /*!< EPTXINTCLR21 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR22_Pos    (22UL)                    /*!< EPTXINTCLR22 (Bit 22)                                 */
#define USB_EOTINTCLR_EPTXINTCLR22_Msk    (0x400000UL)              /*!< EPTXINTCLR22 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR23_Pos    (23UL)                    /*!< EPTXINTCLR23 (Bit 23)                                 */
#define USB_EOTINTCLR_EPTXINTCLR23_Msk    (0x800000UL)              /*!< EPTXINTCLR23 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR24_Pos    (24UL)                    /*!< EPTXINTCLR24 (Bit 24)                                 */
#define USB_EOTINTCLR_EPTXINTCLR24_Msk    (0x1000000UL)             /*!< EPTXINTCLR24 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR25_Pos    (25UL)                    /*!< EPTXINTCLR25 (Bit 25)                                 */
#define USB_EOTINTCLR_EPTXINTCLR25_Msk    (0x2000000UL)             /*!< EPTXINTCLR25 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR26_Pos    (26UL)                    /*!< EPTXINTCLR26 (Bit 26)                                 */
#define USB_EOTINTCLR_EPTXINTCLR26_Msk    (0x4000000UL)             /*!< EPTXINTCLR26 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR27_Pos    (27UL)                    /*!< EPTXINTCLR27 (Bit 27)                                 */
#define USB_EOTINTCLR_EPTXINTCLR27_Msk    (0x8000000UL)             /*!< EPTXINTCLR27 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR28_Pos    (28UL)                    /*!< EPTXINTCLR28 (Bit 28)                                 */
#define USB_EOTINTCLR_EPTXINTCLR28_Msk    (0x10000000UL)            /*!< EPTXINTCLR28 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR29_Pos    (29UL)                    /*!< EPTXINTCLR29 (Bit 29)                                 */
#define USB_EOTINTCLR_EPTXINTCLR29_Msk    (0x20000000UL)            /*!< EPTXINTCLR29 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR30_Pos    (30UL)                    /*!< EPTXINTCLR30 (Bit 30)                                 */
#define USB_EOTINTCLR_EPTXINTCLR30_Msk    (0x40000000UL)            /*!< EPTXINTCLR30 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTCLR_EPTXINTCLR31_Pos    (31UL)                    /*!< EPTXINTCLR31 (Bit 31)                                 */
#define USB_EOTINTCLR_EPTXINTCLR31_Msk    (0x80000000UL)            /*!< EPTXINTCLR31 (Bitfield-Mask: 0x01)                    */
/* =======================================================  EOTINTSET  ======================================================= */
#define USB_EOTINTSET_EPTXINTSET0_Pos     (0UL)                     /*!< EPTXINTSET0 (Bit 0)                                   */
#define USB_EOTINTSET_EPTXINTSET0_Msk     (0x1UL)                   /*!< EPTXINTSET0 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET1_Pos     (1UL)                     /*!< EPTXINTSET1 (Bit 1)                                   */
#define USB_EOTINTSET_EPTXINTSET1_Msk     (0x2UL)                   /*!< EPTXINTSET1 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET2_Pos     (2UL)                     /*!< EPTXINTSET2 (Bit 2)                                   */
#define USB_EOTINTSET_EPTXINTSET2_Msk     (0x4UL)                   /*!< EPTXINTSET2 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET3_Pos     (3UL)                     /*!< EPTXINTSET3 (Bit 3)                                   */
#define USB_EOTINTSET_EPTXINTSET3_Msk     (0x8UL)                   /*!< EPTXINTSET3 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET4_Pos     (4UL)                     /*!< EPTXINTSET4 (Bit 4)                                   */
#define USB_EOTINTSET_EPTXINTSET4_Msk     (0x10UL)                  /*!< EPTXINTSET4 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET5_Pos     (5UL)                     /*!< EPTXINTSET5 (Bit 5)                                   */
#define USB_EOTINTSET_EPTXINTSET5_Msk     (0x20UL)                  /*!< EPTXINTSET5 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET6_Pos     (6UL)                     /*!< EPTXINTSET6 (Bit 6)                                   */
#define USB_EOTINTSET_EPTXINTSET6_Msk     (0x40UL)                  /*!< EPTXINTSET6 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET7_Pos     (7UL)                     /*!< EPTXINTSET7 (Bit 7)                                   */
#define USB_EOTINTSET_EPTXINTSET7_Msk     (0x80UL)                  /*!< EPTXINTSET7 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET8_Pos     (8UL)                     /*!< EPTXINTSET8 (Bit 8)                                   */
#define USB_EOTINTSET_EPTXINTSET8_Msk     (0x100UL)                 /*!< EPTXINTSET8 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET9_Pos     (9UL)                     /*!< EPTXINTSET9 (Bit 9)                                   */
#define USB_EOTINTSET_EPTXINTSET9_Msk     (0x200UL)                 /*!< EPTXINTSET9 (Bitfield-Mask: 0x01)                     */
#define USB_EOTINTSET_EPTXINTSET10_Pos    (10UL)                    /*!< EPTXINTSET10 (Bit 10)                                 */
#define USB_EOTINTSET_EPTXINTSET10_Msk    (0x400UL)                 /*!< EPTXINTSET10 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET11_Pos    (11UL)                    /*!< EPTXINTSET11 (Bit 11)                                 */
#define USB_EOTINTSET_EPTXINTSET11_Msk    (0x800UL)                 /*!< EPTXINTSET11 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET12_Pos    (12UL)                    /*!< EPTXINTSET12 (Bit 12)                                 */
#define USB_EOTINTSET_EPTXINTSET12_Msk    (0x1000UL)                /*!< EPTXINTSET12 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET13_Pos    (13UL)                    /*!< EPTXINTSET13 (Bit 13)                                 */
#define USB_EOTINTSET_EPTXINTSET13_Msk    (0x2000UL)                /*!< EPTXINTSET13 (Bitfield-Mask: 0x01)                    */
