lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_EOTINTSET_EPTXINTSET14_Pos    (14UL)                    /*!< EPTXINTSET14 (Bit 14)                                 */
#define USB_EOTINTSET_EPTXINTSET14_Msk    (0x4000UL)                /*!< EPTXINTSET14 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET15_Pos    (15UL)                    /*!< EPTXINTSET15 (Bit 15)                                 */
#define USB_EOTINTSET_EPTXINTSET15_Msk    (0x8000UL)                /*!< EPTXINTSET15 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET16_Pos    (16UL)                    /*!< EPTXINTSET16 (Bit 16)                                 */
#define USB_EOTINTSET_EPTXINTSET16_Msk    (0x10000UL)               /*!< EPTXINTSET16 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET17_Pos    (17UL)                    /*!< EPTXINTSET17 (Bit 17)                                 */
#define USB_EOTINTSET_EPTXINTSET17_Msk    (0x20000UL)               /*!< EPTXINTSET17 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET18_Pos    (18UL)                    /*!< EPTXINTSET18 (Bit 18)                                 */
#define USB_EOTINTSET_EPTXINTSET18_Msk    (0x40000UL)               /*!< EPTXINTSET18 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET19_Pos    (19UL)                    /*!< EPTXINTSET19 (Bit 19)                                 */
#define USB_EOTINTSET_EPTXINTSET19_Msk    (0x80000UL)               /*!< EPTXINTSET19 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET20_Pos    (20UL)                    /*!< EPTXINTSET20 (Bit 20)                                 */
#define USB_EOTINTSET_EPTXINTSET20_Msk    (0x100000UL)              /*!< EPTXINTSET20 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET21_Pos    (21UL)                    /*!< EPTXINTSET21 (Bit 21)                                 */
#define USB_EOTINTSET_EPTXINTSET21_Msk    (0x200000UL)              /*!< EPTXINTSET21 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET22_Pos    (22UL)                    /*!< EPTXINTSET22 (Bit 22)                                 */
#define USB_EOTINTSET_EPTXINTSET22_Msk    (0x400000UL)              /*!< EPTXINTSET22 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET23_Pos    (23UL)                    /*!< EPTXINTSET23 (Bit 23)                                 */
#define USB_EOTINTSET_EPTXINTSET23_Msk    (0x800000UL)              /*!< EPTXINTSET23 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET24_Pos    (24UL)                    /*!< EPTXINTSET24 (Bit 24)                                 */
#define USB_EOTINTSET_EPTXINTSET24_Msk    (0x1000000UL)             /*!< EPTXINTSET24 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET25_Pos    (25UL)                    /*!< EPTXINTSET25 (Bit 25)                                 */
#define USB_EOTINTSET_EPTXINTSET25_Msk    (0x2000000UL)             /*!< EPTXINTSET25 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET26_Pos    (26UL)                    /*!< EPTXINTSET26 (Bit 26)                                 */
#define USB_EOTINTSET_EPTXINTSET26_Msk    (0x4000000UL)             /*!< EPTXINTSET26 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET27_Pos    (27UL)                    /*!< EPTXINTSET27 (Bit 27)                                 */
#define USB_EOTINTSET_EPTXINTSET27_Msk    (0x8000000UL)             /*!< EPTXINTSET27 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET28_Pos    (28UL)                    /*!< EPTXINTSET28 (Bit 28)                                 */
#define USB_EOTINTSET_EPTXINTSET28_Msk    (0x10000000UL)            /*!< EPTXINTSET28 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET29_Pos    (29UL)                    /*!< EPTXINTSET29 (Bit 29)                                 */
#define USB_EOTINTSET_EPTXINTSET29_Msk    (0x20000000UL)            /*!< EPTXINTSET29 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET30_Pos    (30UL)                    /*!< EPTXINTSET30 (Bit 30)                                 */
#define USB_EOTINTSET_EPTXINTSET30_Msk    (0x40000000UL)            /*!< EPTXINTSET30 (Bitfield-Mask: 0x01)                    */
#define USB_EOTINTSET_EPTXINTSET31_Pos    (31UL)                    /*!< EPTXINTSET31 (Bit 31)                                 */
#define USB_EOTINTSET_EPTXINTSET31_Msk    (0x80000000UL)            /*!< EPTXINTSET31 (Bitfield-Mask: 0x01)                    */
/* =======================================================  NDDRINTST  ======================================================= */
#define USB_NDDRINTST_EPNDDINTST0_Pos     (0UL)                     /*!< EPNDDINTST0 (Bit 0)                                   */
#define USB_NDDRINTST_EPNDDINTST0_Msk     (0x1UL)                   /*!< EPNDDINTST0 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST1_Pos     (1UL)                     /*!< EPNDDINTST1 (Bit 1)                                   */
#define USB_NDDRINTST_EPNDDINTST1_Msk     (0x2UL)                   /*!< EPNDDINTST1 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST2_Pos     (2UL)                     /*!< EPNDDINTST2 (Bit 2)                                   */
#define USB_NDDRINTST_EPNDDINTST2_Msk     (0x4UL)                   /*!< EPNDDINTST2 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST3_Pos     (3UL)                     /*!< EPNDDINTST3 (Bit 3)                                   */
#define USB_NDDRINTST_EPNDDINTST3_Msk     (0x8UL)                   /*!< EPNDDINTST3 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST4_Pos     (4UL)                     /*!< EPNDDINTST4 (Bit 4)                                   */
#define USB_NDDRINTST_EPNDDINTST4_Msk     (0x10UL)                  /*!< EPNDDINTST4 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST5_Pos     (5UL)                     /*!< EPNDDINTST5 (Bit 5)                                   */
#define USB_NDDRINTST_EPNDDINTST5_Msk     (0x20UL)                  /*!< EPNDDINTST5 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST6_Pos     (6UL)                     /*!< EPNDDINTST6 (Bit 6)                                   */
#define USB_NDDRINTST_EPNDDINTST6_Msk     (0x40UL)                  /*!< EPNDDINTST6 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST7_Pos     (7UL)                     /*!< EPNDDINTST7 (Bit 7)                                   */
#define USB_NDDRINTST_EPNDDINTST7_Msk     (0x80UL)                  /*!< EPNDDINTST7 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST8_Pos     (8UL)                     /*!< EPNDDINTST8 (Bit 8)                                   */
#define USB_NDDRINTST_EPNDDINTST8_Msk     (0x100UL)                 /*!< EPNDDINTST8 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST9_Pos     (9UL)                     /*!< EPNDDINTST9 (Bit 9)                                   */
#define USB_NDDRINTST_EPNDDINTST9_Msk     (0x200UL)                 /*!< EPNDDINTST9 (Bitfield-Mask: 0x01)                     */
#define USB_NDDRINTST_EPNDDINTST10_Pos    (10UL)                    /*!< EPNDDINTST10 (Bit 10)                                 */
#define USB_NDDRINTST_EPNDDINTST10_Msk    (0x400UL)                 /*!< EPNDDINTST10 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST11_Pos    (11UL)                    /*!< EPNDDINTST11 (Bit 11)                                 */
#define USB_NDDRINTST_EPNDDINTST11_Msk    (0x800UL)                 /*!< EPNDDINTST11 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST12_Pos    (12UL)                    /*!< EPNDDINTST12 (Bit 12)                                 */
#define USB_NDDRINTST_EPNDDINTST12_Msk    (0x1000UL)                /*!< EPNDDINTST12 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST13_Pos    (13UL)                    /*!< EPNDDINTST13 (Bit 13)                                 */
#define USB_NDDRINTST_EPNDDINTST13_Msk    (0x2000UL)                /*!< EPNDDINTST13 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST14_Pos    (14UL)                    /*!< EPNDDINTST14 (Bit 14)                                 */
#define USB_NDDRINTST_EPNDDINTST14_Msk    (0x4000UL)                /*!< EPNDDINTST14 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST15_Pos    (15UL)                    /*!< EPNDDINTST15 (Bit 15)                                 */
#define USB_NDDRINTST_EPNDDINTST15_Msk    (0x8000UL)                /*!< EPNDDINTST15 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST16_Pos    (16UL)                    /*!< EPNDDINTST16 (Bit 16)                                 */
#define USB_NDDRINTST_EPNDDINTST16_Msk    (0x10000UL)               /*!< EPNDDINTST16 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST17_Pos    (17UL)                    /*!< EPNDDINTST17 (Bit 17)                                 */
#define USB_NDDRINTST_EPNDDINTST17_Msk    (0x20000UL)               /*!< EPNDDINTST17 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST18_Pos    (18UL)                    /*!< EPNDDINTST18 (Bit 18)                                 */
#define USB_NDDRINTST_EPNDDINTST18_Msk    (0x40000UL)               /*!< EPNDDINTST18 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST19_Pos    (19UL)                    /*!< EPNDDINTST19 (Bit 19)                                 */
#define USB_NDDRINTST_EPNDDINTST19_Msk    (0x80000UL)               /*!< EPNDDINTST19 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST20_Pos    (20UL)                    /*!< EPNDDINTST20 (Bit 20)                                 */
#define USB_NDDRINTST_EPNDDINTST20_Msk    (0x100000UL)              /*!< EPNDDINTST20 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST21_Pos    (21UL)                    /*!< EPNDDINTST21 (Bit 21)                                 */
#define USB_NDDRINTST_EPNDDINTST21_Msk    (0x200000UL)              /*!< EPNDDINTST21 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST22_Pos    (22UL)                    /*!< EPNDDINTST22 (Bit 22)                                 */
#define USB_NDDRINTST_EPNDDINTST22_Msk    (0x400000UL)              /*!< EPNDDINTST22 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST23_Pos    (23UL)                    /*!< EPNDDINTST23 (Bit 23)                                 */
#define USB_NDDRINTST_EPNDDINTST23_Msk    (0x800000UL)              /*!< EPNDDINTST23 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST24_Pos    (24UL)                    /*!< EPNDDINTST24 (Bit 24)                                 */
#define USB_NDDRINTST_EPNDDINTST24_Msk    (0x1000000UL)             /*!< EPNDDINTST24 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST25_Pos    (25UL)                    /*!< EPNDDINTST25 (Bit 25)                                 */
#define USB_NDDRINTST_EPNDDINTST25_Msk    (0x2000000UL)             /*!< EPNDDINTST25 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST26_Pos    (26UL)                    /*!< EPNDDINTST26 (Bit 26)                                 */
#define USB_NDDRINTST_EPNDDINTST26_Msk    (0x4000000UL)             /*!< EPNDDINTST26 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST27_Pos    (27UL)                    /*!< EPNDDINTST27 (Bit 27)                                 */
#define USB_NDDRINTST_EPNDDINTST27_Msk    (0x8000000UL)             /*!< EPNDDINTST27 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST28_Pos    (28UL)                    /*!< EPNDDINTST28 (Bit 28)                                 */
#define USB_NDDRINTST_EPNDDINTST28_Msk    (0x10000000UL)            /*!< EPNDDINTST28 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST29_Pos    (29UL)                    /*!< EPNDDINTST29 (Bit 29)                                 */
#define USB_NDDRINTST_EPNDDINTST29_Msk    (0x20000000UL)            /*!< EPNDDINTST29 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST30_Pos    (30UL)                    /*!< EPNDDINTST30 (Bit 30)                                 */
#define USB_NDDRINTST_EPNDDINTST30_Msk    (0x40000000UL)            /*!< EPNDDINTST30 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTST_EPNDDINTST31_Pos    (31UL)                    /*!< EPNDDINTST31 (Bit 31)                                 */
#define USB_NDDRINTST_EPNDDINTST31_Msk    (0x80000000UL)            /*!< EPNDDINTST31 (Bitfield-Mask: 0x01)                    */
/* ======================================================  NDDRINTCLR  ======================================================= */
#define USB_NDDRINTCLR_EPNDDINTCLR0_Pos   (0UL)                     /*!< EPNDDINTCLR0 (Bit 0)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR0_Msk   (0x1UL)                   /*!< EPNDDINTCLR0 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR1_Pos   (1UL)                     /*!< EPNDDINTCLR1 (Bit 1)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR1_Msk   (0x2UL)                   /*!< EPNDDINTCLR1 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR2_Pos   (2UL)                     /*!< EPNDDINTCLR2 (Bit 2)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR2_Msk   (0x4UL)                   /*!< EPNDDINTCLR2 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR3_Pos   (3UL)                     /*!< EPNDDINTCLR3 (Bit 3)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR3_Msk   (0x8UL)                   /*!< EPNDDINTCLR3 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR4_Pos   (4UL)                     /*!< EPNDDINTCLR4 (Bit 4)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR4_Msk   (0x10UL)                  /*!< EPNDDINTCLR4 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR5_Pos   (5UL)                     /*!< EPNDDINTCLR5 (Bit 5)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR5_Msk   (0x20UL)                  /*!< EPNDDINTCLR5 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR6_Pos   (6UL)                     /*!< EPNDDINTCLR6 (Bit 6)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR6_Msk   (0x40UL)                  /*!< EPNDDINTCLR6 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR7_Pos   (7UL)                     /*!< EPNDDINTCLR7 (Bit 7)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR7_Msk   (0x80UL)                  /*!< EPNDDINTCLR7 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR8_Pos   (8UL)                     /*!< EPNDDINTCLR8 (Bit 8)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR8_Msk   (0x100UL)                 /*!< EPNDDINTCLR8 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR9_Pos   (9UL)                     /*!< EPNDDINTCLR9 (Bit 9)                                  */
#define USB_NDDRINTCLR_EPNDDINTCLR9_Msk   (0x200UL)                 /*!< EPNDDINTCLR9 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTCLR_EPNDDINTCLR10_Pos  (10UL)                    /*!< EPNDDINTCLR10 (Bit 10)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR10_Msk  (0x400UL)                 /*!< EPNDDINTCLR10 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR11_Pos  (11UL)                    /*!< EPNDDINTCLR11 (Bit 11)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR11_Msk  (0x800UL)                 /*!< EPNDDINTCLR11 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR12_Pos  (12UL)                    /*!< EPNDDINTCLR12 (Bit 12)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR12_Msk  (0x1000UL)                /*!< EPNDDINTCLR12 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR13_Pos  (13UL)                    /*!< EPNDDINTCLR13 (Bit 13)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR13_Msk  (0x2000UL)                /*!< EPNDDINTCLR13 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR14_Pos  (14UL)                    /*!< EPNDDINTCLR14 (Bit 14)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR14_Msk  (0x4000UL)                /*!< EPNDDINTCLR14 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR15_Pos  (15UL)                    /*!< EPNDDINTCLR15 (Bit 15)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR15_Msk  (0x8000UL)                /*!< EPNDDINTCLR15 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR16_Pos  (16UL)                    /*!< EPNDDINTCLR16 (Bit 16)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR16_Msk  (0x10000UL)               /*!< EPNDDINTCLR16 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR17_Pos  (17UL)                    /*!< EPNDDINTCLR17 (Bit 17)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR17_Msk  (0x20000UL)               /*!< EPNDDINTCLR17 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR18_Pos  (18UL)                    /*!< EPNDDINTCLR18 (Bit 18)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR18_Msk  (0x40000UL)               /*!< EPNDDINTCLR18 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR19_Pos  (19UL)                    /*!< EPNDDINTCLR19 (Bit 19)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR19_Msk  (0x80000UL)               /*!< EPNDDINTCLR19 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR20_Pos  (20UL)                    /*!< EPNDDINTCLR20 (Bit 20)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR20_Msk  (0x100000UL)              /*!< EPNDDINTCLR20 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR21_Pos  (21UL)                    /*!< EPNDDINTCLR21 (Bit 21)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR21_Msk  (0x200000UL)              /*!< EPNDDINTCLR21 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR22_Pos  (22UL)                    /*!< EPNDDINTCLR22 (Bit 22)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR22_Msk  (0x400000UL)              /*!< EPNDDINTCLR22 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR23_Pos  (23UL)                    /*!< EPNDDINTCLR23 (Bit 23)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR23_Msk  (0x800000UL)              /*!< EPNDDINTCLR23 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR24_Pos  (24UL)                    /*!< EPNDDINTCLR24 (Bit 24)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR24_Msk  (0x1000000UL)             /*!< EPNDDINTCLR24 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR25_Pos  (25UL)                    /*!< EPNDDINTCLR25 (Bit 25)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR25_Msk  (0x2000000UL)             /*!< EPNDDINTCLR25 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR26_Pos  (26UL)                    /*!< EPNDDINTCLR26 (Bit 26)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR26_Msk  (0x4000000UL)             /*!< EPNDDINTCLR26 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR27_Pos  (27UL)                    /*!< EPNDDINTCLR27 (Bit 27)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR27_Msk  (0x8000000UL)             /*!< EPNDDINTCLR27 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR28_Pos  (28UL)                    /*!< EPNDDINTCLR28 (Bit 28)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR28_Msk  (0x10000000UL)            /*!< EPNDDINTCLR28 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR29_Pos  (29UL)                    /*!< EPNDDINTCLR29 (Bit 29)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR29_Msk  (0x20000000UL)            /*!< EPNDDINTCLR29 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR30_Pos  (30UL)                    /*!< EPNDDINTCLR30 (Bit 30)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR30_Msk  (0x40000000UL)            /*!< EPNDDINTCLR30 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTCLR_EPNDDINTCLR31_Pos  (31UL)                    /*!< EPNDDINTCLR31 (Bit 31)                                */
#define USB_NDDRINTCLR_EPNDDINTCLR31_Msk  (0x80000000UL)            /*!< EPNDDINTCLR31 (Bitfield-Mask: 0x01)                   */
/* ======================================================  NDDRINTSET  ======================================================= */
#define USB_NDDRINTSET_EPNDDINTSET0_Pos   (0UL)                     /*!< EPNDDINTSET0 (Bit 0)                                  */
#define USB_NDDRINTSET_EPNDDINTSET0_Msk   (0x1UL)                   /*!< EPNDDINTSET0 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET1_Pos   (1UL)                     /*!< EPNDDINTSET1 (Bit 1)                                  */
#define USB_NDDRINTSET_EPNDDINTSET1_Msk   (0x2UL)                   /*!< EPNDDINTSET1 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET2_Pos   (2UL)                     /*!< EPNDDINTSET2 (Bit 2)                                  */
#define USB_NDDRINTSET_EPNDDINTSET2_Msk   (0x4UL)                   /*!< EPNDDINTSET2 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET3_Pos   (3UL)                     /*!< EPNDDINTSET3 (Bit 3)                                  */
#define USB_NDDRINTSET_EPNDDINTSET3_Msk   (0x8UL)                   /*!< EPNDDINTSET3 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET4_Pos   (4UL)                     /*!< EPNDDINTSET4 (Bit 4)                                  */
#define USB_NDDRINTSET_EPNDDINTSET4_Msk   (0x10UL)                  /*!< EPNDDINTSET4 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET5_Pos   (5UL)                     /*!< EPNDDINTSET5 (Bit 5)                                  */
#define USB_NDDRINTSET_EPNDDINTSET5_Msk   (0x20UL)                  /*!< EPNDDINTSET5 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET6_Pos   (6UL)                     /*!< EPNDDINTSET6 (Bit 6)                                  */
#define USB_NDDRINTSET_EPNDDINTSET6_Msk   (0x40UL)                  /*!< EPNDDINTSET6 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET7_Pos   (7UL)                     /*!< EPNDDINTSET7 (Bit 7)                                  */
#define USB_NDDRINTSET_EPNDDINTSET7_Msk   (0x80UL)                  /*!< EPNDDINTSET7 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET8_Pos   (8UL)                     /*!< EPNDDINTSET8 (Bit 8)                                  */
