lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_NDDRINTSET_EPNDDINTSET8_Msk   (0x100UL)                 /*!< EPNDDINTSET8 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET9_Pos   (9UL)                     /*!< EPNDDINTSET9 (Bit 9)                                  */
#define USB_NDDRINTSET_EPNDDINTSET9_Msk   (0x200UL)                 /*!< EPNDDINTSET9 (Bitfield-Mask: 0x01)                    */
#define USB_NDDRINTSET_EPNDDINTSET10_Pos  (10UL)                    /*!< EPNDDINTSET10 (Bit 10)                                */
#define USB_NDDRINTSET_EPNDDINTSET10_Msk  (0x400UL)                 /*!< EPNDDINTSET10 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET11_Pos  (11UL)                    /*!< EPNDDINTSET11 (Bit 11)                                */
#define USB_NDDRINTSET_EPNDDINTSET11_Msk  (0x800UL)                 /*!< EPNDDINTSET11 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET12_Pos  (12UL)                    /*!< EPNDDINTSET12 (Bit 12)                                */
#define USB_NDDRINTSET_EPNDDINTSET12_Msk  (0x1000UL)                /*!< EPNDDINTSET12 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET13_Pos  (13UL)                    /*!< EPNDDINTSET13 (Bit 13)                                */
#define USB_NDDRINTSET_EPNDDINTSET13_Msk  (0x2000UL)                /*!< EPNDDINTSET13 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET14_Pos  (14UL)                    /*!< EPNDDINTSET14 (Bit 14)                                */
#define USB_NDDRINTSET_EPNDDINTSET14_Msk  (0x4000UL)                /*!< EPNDDINTSET14 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET15_Pos  (15UL)                    /*!< EPNDDINTSET15 (Bit 15)                                */
#define USB_NDDRINTSET_EPNDDINTSET15_Msk  (0x8000UL)                /*!< EPNDDINTSET15 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET16_Pos  (16UL)                    /*!< EPNDDINTSET16 (Bit 16)                                */
#define USB_NDDRINTSET_EPNDDINTSET16_Msk  (0x10000UL)               /*!< EPNDDINTSET16 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET17_Pos  (17UL)                    /*!< EPNDDINTSET17 (Bit 17)                                */
#define USB_NDDRINTSET_EPNDDINTSET17_Msk  (0x20000UL)               /*!< EPNDDINTSET17 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET18_Pos  (18UL)                    /*!< EPNDDINTSET18 (Bit 18)                                */
#define USB_NDDRINTSET_EPNDDINTSET18_Msk  (0x40000UL)               /*!< EPNDDINTSET18 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET19_Pos  (19UL)                    /*!< EPNDDINTSET19 (Bit 19)                                */
#define USB_NDDRINTSET_EPNDDINTSET19_Msk  (0x80000UL)               /*!< EPNDDINTSET19 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET20_Pos  (20UL)                    /*!< EPNDDINTSET20 (Bit 20)                                */
#define USB_NDDRINTSET_EPNDDINTSET20_Msk  (0x100000UL)              /*!< EPNDDINTSET20 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET21_Pos  (21UL)                    /*!< EPNDDINTSET21 (Bit 21)                                */
#define USB_NDDRINTSET_EPNDDINTSET21_Msk  (0x200000UL)              /*!< EPNDDINTSET21 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET22_Pos  (22UL)                    /*!< EPNDDINTSET22 (Bit 22)                                */
#define USB_NDDRINTSET_EPNDDINTSET22_Msk  (0x400000UL)              /*!< EPNDDINTSET22 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET23_Pos  (23UL)                    /*!< EPNDDINTSET23 (Bit 23)                                */
#define USB_NDDRINTSET_EPNDDINTSET23_Msk  (0x800000UL)              /*!< EPNDDINTSET23 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET24_Pos  (24UL)                    /*!< EPNDDINTSET24 (Bit 24)                                */
#define USB_NDDRINTSET_EPNDDINTSET24_Msk  (0x1000000UL)             /*!< EPNDDINTSET24 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET25_Pos  (25UL)                    /*!< EPNDDINTSET25 (Bit 25)                                */
#define USB_NDDRINTSET_EPNDDINTSET25_Msk  (0x2000000UL)             /*!< EPNDDINTSET25 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET26_Pos  (26UL)                    /*!< EPNDDINTSET26 (Bit 26)                                */
#define USB_NDDRINTSET_EPNDDINTSET26_Msk  (0x4000000UL)             /*!< EPNDDINTSET26 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET27_Pos  (27UL)                    /*!< EPNDDINTSET27 (Bit 27)                                */
#define USB_NDDRINTSET_EPNDDINTSET27_Msk  (0x8000000UL)             /*!< EPNDDINTSET27 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET28_Pos  (28UL)                    /*!< EPNDDINTSET28 (Bit 28)                                */
#define USB_NDDRINTSET_EPNDDINTSET28_Msk  (0x10000000UL)            /*!< EPNDDINTSET28 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET29_Pos  (29UL)                    /*!< EPNDDINTSET29 (Bit 29)                                */
#define USB_NDDRINTSET_EPNDDINTSET29_Msk  (0x20000000UL)            /*!< EPNDDINTSET29 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET30_Pos  (30UL)                    /*!< EPNDDINTSET30 (Bit 30)                                */
#define USB_NDDRINTSET_EPNDDINTSET30_Msk  (0x40000000UL)            /*!< EPNDDINTSET30 (Bitfield-Mask: 0x01)                   */
#define USB_NDDRINTSET_EPNDDINTSET31_Pos  (31UL)                    /*!< EPNDDINTSET31 (Bit 31)                                */
#define USB_NDDRINTSET_EPNDDINTSET31_Msk  (0x80000000UL)            /*!< EPNDDINTSET31 (Bitfield-Mask: 0x01)                   */
/* ======================================================  SYSERRINTST  ====================================================== */
#define USB_SYSERRINTST_EPERRINTST0_Pos   (0UL)                     /*!< EPERRINTST0 (Bit 0)                                   */
#define USB_SYSERRINTST_EPERRINTST0_Msk   (0x1UL)                   /*!< EPERRINTST0 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST1_Pos   (1UL)                     /*!< EPERRINTST1 (Bit 1)                                   */
#define USB_SYSERRINTST_EPERRINTST1_Msk   (0x2UL)                   /*!< EPERRINTST1 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST2_Pos   (2UL)                     /*!< EPERRINTST2 (Bit 2)                                   */
#define USB_SYSERRINTST_EPERRINTST2_Msk   (0x4UL)                   /*!< EPERRINTST2 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST3_Pos   (3UL)                     /*!< EPERRINTST3 (Bit 3)                                   */
#define USB_SYSERRINTST_EPERRINTST3_Msk   (0x8UL)                   /*!< EPERRINTST3 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST4_Pos   (4UL)                     /*!< EPERRINTST4 (Bit 4)                                   */
#define USB_SYSERRINTST_EPERRINTST4_Msk   (0x10UL)                  /*!< EPERRINTST4 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST5_Pos   (5UL)                     /*!< EPERRINTST5 (Bit 5)                                   */
#define USB_SYSERRINTST_EPERRINTST5_Msk   (0x20UL)                  /*!< EPERRINTST5 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST6_Pos   (6UL)                     /*!< EPERRINTST6 (Bit 6)                                   */
#define USB_SYSERRINTST_EPERRINTST6_Msk   (0x40UL)                  /*!< EPERRINTST6 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST7_Pos   (7UL)                     /*!< EPERRINTST7 (Bit 7)                                   */
#define USB_SYSERRINTST_EPERRINTST7_Msk   (0x80UL)                  /*!< EPERRINTST7 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST8_Pos   (8UL)                     /*!< EPERRINTST8 (Bit 8)                                   */
#define USB_SYSERRINTST_EPERRINTST8_Msk   (0x100UL)                 /*!< EPERRINTST8 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST9_Pos   (9UL)                     /*!< EPERRINTST9 (Bit 9)                                   */
#define USB_SYSERRINTST_EPERRINTST9_Msk   (0x200UL)                 /*!< EPERRINTST9 (Bitfield-Mask: 0x01)                     */
#define USB_SYSERRINTST_EPERRINTST10_Pos  (10UL)                    /*!< EPERRINTST10 (Bit 10)                                 */
#define USB_SYSERRINTST_EPERRINTST10_Msk  (0x400UL)                 /*!< EPERRINTST10 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST11_Pos  (11UL)                    /*!< EPERRINTST11 (Bit 11)                                 */
#define USB_SYSERRINTST_EPERRINTST11_Msk  (0x800UL)                 /*!< EPERRINTST11 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST12_Pos  (12UL)                    /*!< EPERRINTST12 (Bit 12)                                 */
#define USB_SYSERRINTST_EPERRINTST12_Msk  (0x1000UL)                /*!< EPERRINTST12 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST13_Pos  (13UL)                    /*!< EPERRINTST13 (Bit 13)                                 */
#define USB_SYSERRINTST_EPERRINTST13_Msk  (0x2000UL)                /*!< EPERRINTST13 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST14_Pos  (14UL)                    /*!< EPERRINTST14 (Bit 14)                                 */
#define USB_SYSERRINTST_EPERRINTST14_Msk  (0x4000UL)                /*!< EPERRINTST14 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST15_Pos  (15UL)                    /*!< EPERRINTST15 (Bit 15)                                 */
#define USB_SYSERRINTST_EPERRINTST15_Msk  (0x8000UL)                /*!< EPERRINTST15 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST16_Pos  (16UL)                    /*!< EPERRINTST16 (Bit 16)                                 */
#define USB_SYSERRINTST_EPERRINTST16_Msk  (0x10000UL)               /*!< EPERRINTST16 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST17_Pos  (17UL)                    /*!< EPERRINTST17 (Bit 17)                                 */
#define USB_SYSERRINTST_EPERRINTST17_Msk  (0x20000UL)               /*!< EPERRINTST17 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST18_Pos  (18UL)                    /*!< EPERRINTST18 (Bit 18)                                 */
#define USB_SYSERRINTST_EPERRINTST18_Msk  (0x40000UL)               /*!< EPERRINTST18 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST19_Pos  (19UL)                    /*!< EPERRINTST19 (Bit 19)                                 */
#define USB_SYSERRINTST_EPERRINTST19_Msk  (0x80000UL)               /*!< EPERRINTST19 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST20_Pos  (20UL)                    /*!< EPERRINTST20 (Bit 20)                                 */
#define USB_SYSERRINTST_EPERRINTST20_Msk  (0x100000UL)              /*!< EPERRINTST20 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST21_Pos  (21UL)                    /*!< EPERRINTST21 (Bit 21)                                 */
#define USB_SYSERRINTST_EPERRINTST21_Msk  (0x200000UL)              /*!< EPERRINTST21 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST22_Pos  (22UL)                    /*!< EPERRINTST22 (Bit 22)                                 */
#define USB_SYSERRINTST_EPERRINTST22_Msk  (0x400000UL)              /*!< EPERRINTST22 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST23_Pos  (23UL)                    /*!< EPERRINTST23 (Bit 23)                                 */
#define USB_SYSERRINTST_EPERRINTST23_Msk  (0x800000UL)              /*!< EPERRINTST23 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST24_Pos  (24UL)                    /*!< EPERRINTST24 (Bit 24)                                 */
#define USB_SYSERRINTST_EPERRINTST24_Msk  (0x1000000UL)             /*!< EPERRINTST24 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST25_Pos  (25UL)                    /*!< EPERRINTST25 (Bit 25)                                 */
#define USB_SYSERRINTST_EPERRINTST25_Msk  (0x2000000UL)             /*!< EPERRINTST25 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST26_Pos  (26UL)                    /*!< EPERRINTST26 (Bit 26)                                 */
#define USB_SYSERRINTST_EPERRINTST26_Msk  (0x4000000UL)             /*!< EPERRINTST26 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST27_Pos  (27UL)                    /*!< EPERRINTST27 (Bit 27)                                 */
#define USB_SYSERRINTST_EPERRINTST27_Msk  (0x8000000UL)             /*!< EPERRINTST27 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST28_Pos  (28UL)                    /*!< EPERRINTST28 (Bit 28)                                 */
#define USB_SYSERRINTST_EPERRINTST28_Msk  (0x10000000UL)            /*!< EPERRINTST28 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST29_Pos  (29UL)                    /*!< EPERRINTST29 (Bit 29)                                 */
#define USB_SYSERRINTST_EPERRINTST29_Msk  (0x20000000UL)            /*!< EPERRINTST29 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST30_Pos  (30UL)                    /*!< EPERRINTST30 (Bit 30)                                 */
#define USB_SYSERRINTST_EPERRINTST30_Msk  (0x40000000UL)            /*!< EPERRINTST30 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTST_EPERRINTST31_Pos  (31UL)                    /*!< EPERRINTST31 (Bit 31)                                 */
#define USB_SYSERRINTST_EPERRINTST31_Msk  (0x80000000UL)            /*!< EPERRINTST31 (Bitfield-Mask: 0x01)                    */
/* =====================================================  SYSERRINTCLR  ====================================================== */
#define USB_SYSERRINTCLR_EPERRINTCLR0_Pos (0UL)                     /*!< EPERRINTCLR0 (Bit 0)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR0_Msk (0x1UL)                   /*!< EPERRINTCLR0 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR1_Pos (1UL)                     /*!< EPERRINTCLR1 (Bit 1)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR1_Msk (0x2UL)                   /*!< EPERRINTCLR1 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR2_Pos (2UL)                     /*!< EPERRINTCLR2 (Bit 2)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR2_Msk (0x4UL)                   /*!< EPERRINTCLR2 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR3_Pos (3UL)                     /*!< EPERRINTCLR3 (Bit 3)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR3_Msk (0x8UL)                   /*!< EPERRINTCLR3 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR4_Pos (4UL)                     /*!< EPERRINTCLR4 (Bit 4)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR4_Msk (0x10UL)                  /*!< EPERRINTCLR4 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR5_Pos (5UL)                     /*!< EPERRINTCLR5 (Bit 5)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR5_Msk (0x20UL)                  /*!< EPERRINTCLR5 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR6_Pos (6UL)                     /*!< EPERRINTCLR6 (Bit 6)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR6_Msk (0x40UL)                  /*!< EPERRINTCLR6 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR7_Pos (7UL)                     /*!< EPERRINTCLR7 (Bit 7)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR7_Msk (0x80UL)                  /*!< EPERRINTCLR7 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR8_Pos (8UL)                     /*!< EPERRINTCLR8 (Bit 8)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR8_Msk (0x100UL)                 /*!< EPERRINTCLR8 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR9_Pos (9UL)                     /*!< EPERRINTCLR9 (Bit 9)                                  */
#define USB_SYSERRINTCLR_EPERRINTCLR9_Msk (0x200UL)                 /*!< EPERRINTCLR9 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTCLR_EPERRINTCLR10_Pos (10UL)                   /*!< EPERRINTCLR10 (Bit 10)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR10_Msk (0x400UL)                /*!< EPERRINTCLR10 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR11_Pos (11UL)                   /*!< EPERRINTCLR11 (Bit 11)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR11_Msk (0x800UL)                /*!< EPERRINTCLR11 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR12_Pos (12UL)                   /*!< EPERRINTCLR12 (Bit 12)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR12_Msk (0x1000UL)               /*!< EPERRINTCLR12 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR13_Pos (13UL)                   /*!< EPERRINTCLR13 (Bit 13)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR13_Msk (0x2000UL)               /*!< EPERRINTCLR13 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR14_Pos (14UL)                   /*!< EPERRINTCLR14 (Bit 14)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR14_Msk (0x4000UL)               /*!< EPERRINTCLR14 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR15_Pos (15UL)                   /*!< EPERRINTCLR15 (Bit 15)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR15_Msk (0x8000UL)               /*!< EPERRINTCLR15 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR16_Pos (16UL)                   /*!< EPERRINTCLR16 (Bit 16)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR16_Msk (0x10000UL)              /*!< EPERRINTCLR16 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR17_Pos (17UL)                   /*!< EPERRINTCLR17 (Bit 17)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR17_Msk (0x20000UL)              /*!< EPERRINTCLR17 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR18_Pos (18UL)                   /*!< EPERRINTCLR18 (Bit 18)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR18_Msk (0x40000UL)              /*!< EPERRINTCLR18 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR19_Pos (19UL)                   /*!< EPERRINTCLR19 (Bit 19)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR19_Msk (0x80000UL)              /*!< EPERRINTCLR19 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR20_Pos (20UL)                   /*!< EPERRINTCLR20 (Bit 20)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR20_Msk (0x100000UL)             /*!< EPERRINTCLR20 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR21_Pos (21UL)                   /*!< EPERRINTCLR21 (Bit 21)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR21_Msk (0x200000UL)             /*!< EPERRINTCLR21 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR22_Pos (22UL)                   /*!< EPERRINTCLR22 (Bit 22)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR22_Msk (0x400000UL)             /*!< EPERRINTCLR22 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR23_Pos (23UL)                   /*!< EPERRINTCLR23 (Bit 23)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR23_Msk (0x800000UL)             /*!< EPERRINTCLR23 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR24_Pos (24UL)                   /*!< EPERRINTCLR24 (Bit 24)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR24_Msk (0x1000000UL)            /*!< EPERRINTCLR24 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR25_Pos (25UL)                   /*!< EPERRINTCLR25 (Bit 25)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR25_Msk (0x2000000UL)            /*!< EPERRINTCLR25 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR26_Pos (26UL)                   /*!< EPERRINTCLR26 (Bit 26)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR26_Msk (0x4000000UL)            /*!< EPERRINTCLR26 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR27_Pos (27UL)                   /*!< EPERRINTCLR27 (Bit 27)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR27_Msk (0x8000000UL)            /*!< EPERRINTCLR27 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR28_Pos (28UL)                   /*!< EPERRINTCLR28 (Bit 28)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR28_Msk (0x10000000UL)           /*!< EPERRINTCLR28 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR29_Pos (29UL)                   /*!< EPERRINTCLR29 (Bit 29)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR29_Msk (0x20000000UL)           /*!< EPERRINTCLR29 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR30_Pos (30UL)                   /*!< EPERRINTCLR30 (Bit 30)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR30_Msk (0x40000000UL)           /*!< EPERRINTCLR30 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTCLR_EPERRINTCLR31_Pos (31UL)                   /*!< EPERRINTCLR31 (Bit 31)                                */
#define USB_SYSERRINTCLR_EPERRINTCLR31_Msk (0x80000000UL)           /*!< EPERRINTCLR31 (Bitfield-Mask: 0x01)                   */
/* =====================================================  SYSERRINTSET  ====================================================== */
#define USB_SYSERRINTSET_EPERRINTSET0_Pos (0UL)                     /*!< EPERRINTSET0 (Bit 0)                                  */
#define USB_SYSERRINTSET_EPERRINTSET0_Msk (0x1UL)                   /*!< EPERRINTSET0 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET1_Pos (1UL)                     /*!< EPERRINTSET1 (Bit 1)                                  */
#define USB_SYSERRINTSET_EPERRINTSET1_Msk (0x2UL)                   /*!< EPERRINTSET1 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET2_Pos (2UL)                     /*!< EPERRINTSET2 (Bit 2)                                  */
#define USB_SYSERRINTSET_EPERRINTSET2_Msk (0x4UL)                   /*!< EPERRINTSET2 (Bitfield-Mask: 0x01)                    */
