lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define USB_SYSERRINTSET_EPERRINTSET3_Pos (3UL)                     /*!< EPERRINTSET3 (Bit 3)                                  */
#define USB_SYSERRINTSET_EPERRINTSET3_Msk (0x8UL)                   /*!< EPERRINTSET3 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET4_Pos (4UL)                     /*!< EPERRINTSET4 (Bit 4)                                  */
#define USB_SYSERRINTSET_EPERRINTSET4_Msk (0x10UL)                  /*!< EPERRINTSET4 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET5_Pos (5UL)                     /*!< EPERRINTSET5 (Bit 5)                                  */
#define USB_SYSERRINTSET_EPERRINTSET5_Msk (0x20UL)                  /*!< EPERRINTSET5 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET6_Pos (6UL)                     /*!< EPERRINTSET6 (Bit 6)                                  */
#define USB_SYSERRINTSET_EPERRINTSET6_Msk (0x40UL)                  /*!< EPERRINTSET6 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET7_Pos (7UL)                     /*!< EPERRINTSET7 (Bit 7)                                  */
#define USB_SYSERRINTSET_EPERRINTSET7_Msk (0x80UL)                  /*!< EPERRINTSET7 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET8_Pos (8UL)                     /*!< EPERRINTSET8 (Bit 8)                                  */
#define USB_SYSERRINTSET_EPERRINTSET8_Msk (0x100UL)                 /*!< EPERRINTSET8 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET9_Pos (9UL)                     /*!< EPERRINTSET9 (Bit 9)                                  */
#define USB_SYSERRINTSET_EPERRINTSET9_Msk (0x200UL)                 /*!< EPERRINTSET9 (Bitfield-Mask: 0x01)                    */
#define USB_SYSERRINTSET_EPERRINTSET10_Pos (10UL)                   /*!< EPERRINTSET10 (Bit 10)                                */
#define USB_SYSERRINTSET_EPERRINTSET10_Msk (0x400UL)                /*!< EPERRINTSET10 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET11_Pos (11UL)                   /*!< EPERRINTSET11 (Bit 11)                                */
#define USB_SYSERRINTSET_EPERRINTSET11_Msk (0x800UL)                /*!< EPERRINTSET11 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET12_Pos (12UL)                   /*!< EPERRINTSET12 (Bit 12)                                */
#define USB_SYSERRINTSET_EPERRINTSET12_Msk (0x1000UL)               /*!< EPERRINTSET12 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET13_Pos (13UL)                   /*!< EPERRINTSET13 (Bit 13)                                */
#define USB_SYSERRINTSET_EPERRINTSET13_Msk (0x2000UL)               /*!< EPERRINTSET13 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET14_Pos (14UL)                   /*!< EPERRINTSET14 (Bit 14)                                */
#define USB_SYSERRINTSET_EPERRINTSET14_Msk (0x4000UL)               /*!< EPERRINTSET14 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET15_Pos (15UL)                   /*!< EPERRINTSET15 (Bit 15)                                */
#define USB_SYSERRINTSET_EPERRINTSET15_Msk (0x8000UL)               /*!< EPERRINTSET15 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET16_Pos (16UL)                   /*!< EPERRINTSET16 (Bit 16)                                */
#define USB_SYSERRINTSET_EPERRINTSET16_Msk (0x10000UL)              /*!< EPERRINTSET16 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET17_Pos (17UL)                   /*!< EPERRINTSET17 (Bit 17)                                */
#define USB_SYSERRINTSET_EPERRINTSET17_Msk (0x20000UL)              /*!< EPERRINTSET17 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET18_Pos (18UL)                   /*!< EPERRINTSET18 (Bit 18)                                */
#define USB_SYSERRINTSET_EPERRINTSET18_Msk (0x40000UL)              /*!< EPERRINTSET18 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET19_Pos (19UL)                   /*!< EPERRINTSET19 (Bit 19)                                */
#define USB_SYSERRINTSET_EPERRINTSET19_Msk (0x80000UL)              /*!< EPERRINTSET19 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET20_Pos (20UL)                   /*!< EPERRINTSET20 (Bit 20)                                */
#define USB_SYSERRINTSET_EPERRINTSET20_Msk (0x100000UL)             /*!< EPERRINTSET20 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET21_Pos (21UL)                   /*!< EPERRINTSET21 (Bit 21)                                */
#define USB_SYSERRINTSET_EPERRINTSET21_Msk (0x200000UL)             /*!< EPERRINTSET21 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET22_Pos (22UL)                   /*!< EPERRINTSET22 (Bit 22)                                */
#define USB_SYSERRINTSET_EPERRINTSET22_Msk (0x400000UL)             /*!< EPERRINTSET22 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET23_Pos (23UL)                   /*!< EPERRINTSET23 (Bit 23)                                */
#define USB_SYSERRINTSET_EPERRINTSET23_Msk (0x800000UL)             /*!< EPERRINTSET23 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET24_Pos (24UL)                   /*!< EPERRINTSET24 (Bit 24)                                */
#define USB_SYSERRINTSET_EPERRINTSET24_Msk (0x1000000UL)            /*!< EPERRINTSET24 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET25_Pos (25UL)                   /*!< EPERRINTSET25 (Bit 25)                                */
#define USB_SYSERRINTSET_EPERRINTSET25_Msk (0x2000000UL)            /*!< EPERRINTSET25 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET26_Pos (26UL)                   /*!< EPERRINTSET26 (Bit 26)                                */
#define USB_SYSERRINTSET_EPERRINTSET26_Msk (0x4000000UL)            /*!< EPERRINTSET26 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET27_Pos (27UL)                   /*!< EPERRINTSET27 (Bit 27)                                */
#define USB_SYSERRINTSET_EPERRINTSET27_Msk (0x8000000UL)            /*!< EPERRINTSET27 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET28_Pos (28UL)                   /*!< EPERRINTSET28 (Bit 28)                                */
#define USB_SYSERRINTSET_EPERRINTSET28_Msk (0x10000000UL)           /*!< EPERRINTSET28 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET29_Pos (29UL)                   /*!< EPERRINTSET29 (Bit 29)                                */
#define USB_SYSERRINTSET_EPERRINTSET29_Msk (0x20000000UL)           /*!< EPERRINTSET29 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET30_Pos (30UL)                   /*!< EPERRINTSET30 (Bit 30)                                */
#define USB_SYSERRINTSET_EPERRINTSET30_Msk (0x40000000UL)           /*!< EPERRINTSET30 (Bitfield-Mask: 0x01)                   */
#define USB_SYSERRINTSET_EPERRINTSET31_Pos (31UL)                   /*!< EPERRINTSET31 (Bit 31)                                */
#define USB_SYSERRINTSET_EPERRINTSET31_Msk (0x80000000UL)           /*!< EPERRINTSET31 (Bitfield-Mask: 0x01)                   */
/* ========================================================  I2C_RX  ========================================================= */
#define USB_I2C_RX_RXDATA_Pos             (0UL)                     /*!< RXDATA (Bit 0)                                        */
#define USB_I2C_RX_RXDATA_Msk             (0xffUL)                  /*!< RXDATA (Bitfield-Mask: 0xff)                          */
/* ========================================================  I2C_WO  ========================================================= */
#define USB_I2C_WO_TXDATA_Pos             (0UL)                     /*!< TXDATA (Bit 0)                                        */
#define USB_I2C_WO_TXDATA_Msk             (0xffUL)                  /*!< TXDATA (Bitfield-Mask: 0xff)                          */
#define USB_I2C_WO_START_Pos              (8UL)                     /*!< START (Bit 8)                                         */
#define USB_I2C_WO_START_Msk              (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define USB_I2C_WO_STOP_Pos               (9UL)                     /*!< STOP (Bit 9)                                          */
#define USB_I2C_WO_STOP_Msk               (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
/* ========================================================  I2C_STS  ======================================================== */
#define USB_I2C_STS_TDI_Pos               (0UL)                     /*!< TDI (Bit 0)                                           */
#define USB_I2C_STS_TDI_Msk               (0x1UL)                   /*!< TDI (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_AFI_Pos               (1UL)                     /*!< AFI (Bit 1)                                           */
#define USB_I2C_STS_AFI_Msk               (0x2UL)                   /*!< AFI (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_NAI_Pos               (2UL)                     /*!< NAI (Bit 2)                                           */
#define USB_I2C_STS_NAI_Msk               (0x4UL)                   /*!< NAI (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_DRMI_Pos              (3UL)                     /*!< DRMI (Bit 3)                                          */
#define USB_I2C_STS_DRMI_Msk              (0x8UL)                   /*!< DRMI (Bitfield-Mask: 0x01)                            */
#define USB_I2C_STS_DRSI_Pos              (4UL)                     /*!< DRSI (Bit 4)                                          */
#define USB_I2C_STS_DRSI_Msk              (0x10UL)                  /*!< DRSI (Bitfield-Mask: 0x01)                            */
#define USB_I2C_STS_Active_Pos            (5UL)                     /*!< Active (Bit 5)                                        */
#define USB_I2C_STS_Active_Msk            (0x20UL)                  /*!< Active (Bitfield-Mask: 0x01)                          */
#define USB_I2C_STS_SCL_Pos               (6UL)                     /*!< SCL (Bit 6)                                           */
#define USB_I2C_STS_SCL_Msk               (0x40UL)                  /*!< SCL (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_SDA_Pos               (7UL)                     /*!< SDA (Bit 7)                                           */
#define USB_I2C_STS_SDA_Msk               (0x80UL)                  /*!< SDA (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_RFF_Pos               (8UL)                     /*!< RFF (Bit 8)                                           */
#define USB_I2C_STS_RFF_Msk               (0x100UL)                 /*!< RFF (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_RFE_Pos               (9UL)                     /*!< RFE (Bit 9)                                           */
#define USB_I2C_STS_RFE_Msk               (0x200UL)                 /*!< RFE (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_TFF_Pos               (10UL)                    /*!< TFF (Bit 10)                                          */
#define USB_I2C_STS_TFF_Msk               (0x400UL)                 /*!< TFF (Bitfield-Mask: 0x01)                             */
#define USB_I2C_STS_TFE_Pos               (11UL)                    /*!< TFE (Bit 11)                                          */
#define USB_I2C_STS_TFE_Msk               (0x800UL)                 /*!< TFE (Bitfield-Mask: 0x01)                             */
/* ========================================================  I2C_CTL  ======================================================== */
#define USB_I2C_CTL_TDIE_Pos              (0UL)                     /*!< TDIE (Bit 0)                                          */
#define USB_I2C_CTL_TDIE_Msk              (0x1UL)                   /*!< TDIE (Bitfield-Mask: 0x01)                            */
#define USB_I2C_CTL_AFIE_Pos              (1UL)                     /*!< AFIE (Bit 1)                                          */
#define USB_I2C_CTL_AFIE_Msk              (0x2UL)                   /*!< AFIE (Bitfield-Mask: 0x01)                            */
#define USB_I2C_CTL_NAIE_Pos              (2UL)                     /*!< NAIE (Bit 2)                                          */
#define USB_I2C_CTL_NAIE_Msk              (0x4UL)                   /*!< NAIE (Bitfield-Mask: 0x01)                            */
#define USB_I2C_CTL_DRMIE_Pos             (3UL)                     /*!< DRMIE (Bit 3)                                         */
#define USB_I2C_CTL_DRMIE_Msk             (0x8UL)                   /*!< DRMIE (Bitfield-Mask: 0x01)                           */
#define USB_I2C_CTL_DRSIE_Pos             (4UL)                     /*!< DRSIE (Bit 4)                                         */
#define USB_I2C_CTL_DRSIE_Msk             (0x10UL)                  /*!< DRSIE (Bitfield-Mask: 0x01)                           */
#define USB_I2C_CTL_REFIE_Pos             (5UL)                     /*!< REFIE (Bit 5)                                         */
#define USB_I2C_CTL_REFIE_Msk             (0x20UL)                  /*!< REFIE (Bitfield-Mask: 0x01)                           */
#define USB_I2C_CTL_RFDAIE_Pos            (6UL)                     /*!< RFDAIE (Bit 6)                                        */
#define USB_I2C_CTL_RFDAIE_Msk            (0x40UL)                  /*!< RFDAIE (Bitfield-Mask: 0x01)                          */
#define USB_I2C_CTL_TFFIE_Pos             (7UL)                     /*!< TFFIE (Bit 7)                                         */
#define USB_I2C_CTL_TFFIE_Msk             (0x80UL)                  /*!< TFFIE (Bitfield-Mask: 0x01)                           */
#define USB_I2C_CTL_SRST_Pos              (8UL)                     /*!< SRST (Bit 8)                                          */
#define USB_I2C_CTL_SRST_Msk              (0x100UL)                 /*!< SRST (Bitfield-Mask: 0x01)                            */
/* =======================================================  I2C_CLKHI  ======================================================= */
#define USB_I2C_CLKHI_CDHI_Pos            (0UL)                     /*!< CDHI (Bit 0)                                          */
#define USB_I2C_CLKHI_CDHI_Msk            (0xffUL)                  /*!< CDHI (Bitfield-Mask: 0xff)                            */
/* =======================================================  I2C_CLKLO  ======================================================= */
#define USB_I2C_CLKLO_CDLO_Pos            (0UL)                     /*!< CDLO (Bit 0)                                          */
#define USB_I2C_CLKLO_CDLO_Msk            (0xffUL)                  /*!< CDLO (Bitfield-Mask: 0xff)                            */
/* ======================================================  USBCLKCTRL  ======================================================= */
#define USB_USBCLKCTRL_DEV_CLK_EN_Pos     (1UL)                     /*!< DEV_CLK_EN (Bit 1)                                    */
#define USB_USBCLKCTRL_DEV_CLK_EN_Msk     (0x2UL)                   /*!< DEV_CLK_EN (Bitfield-Mask: 0x01)                      */
#define USB_USBCLKCTRL_PORTSEL_CLK_EN_Pos (3UL)                     /*!< PORTSEL_CLK_EN (Bit 3)                                */
#define USB_USBCLKCTRL_PORTSEL_CLK_EN_Msk (0x8UL)                   /*!< PORTSEL_CLK_EN (Bitfield-Mask: 0x01)                  */
#define USB_USBCLKCTRL_AHB_CLK_EN_Pos     (4UL)                     /*!< AHB_CLK_EN (Bit 4)                                    */
#define USB_USBCLKCTRL_AHB_CLK_EN_Msk     (0x10UL)                  /*!< AHB_CLK_EN (Bitfield-Mask: 0x01)                      */
/* ======================================================  OTGCLKCTRL  ======================================================= */
#define USB_OTGCLKCTRL_HOST_CLK_EN_Pos    (0UL)                     /*!< HOST_CLK_EN (Bit 0)                                   */
#define USB_OTGCLKCTRL_HOST_CLK_EN_Msk    (0x1UL)                   /*!< HOST_CLK_EN (Bitfield-Mask: 0x01)                     */
#define USB_OTGCLKCTRL_DEV_CLK_EN_Pos     (1UL)                     /*!< DEV_CLK_EN (Bit 1)                                    */
#define USB_OTGCLKCTRL_DEV_CLK_EN_Msk     (0x2UL)                   /*!< DEV_CLK_EN (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKCTRL_I2C_CLK_EN_Pos     (2UL)                     /*!< I2C_CLK_EN (Bit 2)                                    */
#define USB_OTGCLKCTRL_I2C_CLK_EN_Msk     (0x4UL)                   /*!< I2C_CLK_EN (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKCTRL_OTG_CLK_EN_Pos     (3UL)                     /*!< OTG_CLK_EN (Bit 3)                                    */
#define USB_OTGCLKCTRL_OTG_CLK_EN_Msk     (0x8UL)                   /*!< OTG_CLK_EN (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKCTRL_AHB_CLK_EN_Pos     (4UL)                     /*!< AHB_CLK_EN (Bit 4)                                    */
#define USB_OTGCLKCTRL_AHB_CLK_EN_Msk     (0x10UL)                  /*!< AHB_CLK_EN (Bitfield-Mask: 0x01)                      */
/* =======================================================  USBCLKST  ======================================================== */
#define USB_USBCLKST_DEV_CLK_ON_Pos       (1UL)                     /*!< DEV_CLK_ON (Bit 1)                                    */
#define USB_USBCLKST_DEV_CLK_ON_Msk       (0x2UL)                   /*!< DEV_CLK_ON (Bitfield-Mask: 0x01)                      */
#define USB_USBCLKST_PORTSEL_CLK_ON_Pos   (3UL)                     /*!< PORTSEL_CLK_ON (Bit 3)                                */
#define USB_USBCLKST_PORTSEL_CLK_ON_Msk   (0x8UL)                   /*!< PORTSEL_CLK_ON (Bitfield-Mask: 0x01)                  */
#define USB_USBCLKST_AHB_CLK_ON_Pos       (4UL)                     /*!< AHB_CLK_ON (Bit 4)                                    */
#define USB_USBCLKST_AHB_CLK_ON_Msk       (0x10UL)                  /*!< AHB_CLK_ON (Bitfield-Mask: 0x01)                      */
/* =======================================================  OTGCLKST  ======================================================== */
#define USB_OTGCLKST_HOST_CLK_ON_Pos      (0UL)                     /*!< HOST_CLK_ON (Bit 0)                                   */
#define USB_OTGCLKST_HOST_CLK_ON_Msk      (0x1UL)                   /*!< HOST_CLK_ON (Bitfield-Mask: 0x01)                     */
#define USB_OTGCLKST_DEV_CLK_ON_Pos       (1UL)                     /*!< DEV_CLK_ON (Bit 1)                                    */
#define USB_OTGCLKST_DEV_CLK_ON_Msk       (0x2UL)                   /*!< DEV_CLK_ON (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKST_I2C_CLK_ON_Pos       (2UL)                     /*!< I2C_CLK_ON (Bit 2)                                    */
#define USB_OTGCLKST_I2C_CLK_ON_Msk       (0x4UL)                   /*!< I2C_CLK_ON (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKST_OTG_CLK_ON_Pos       (3UL)                     /*!< OTG_CLK_ON (Bit 3)                                    */
#define USB_OTGCLKST_OTG_CLK_ON_Msk       (0x8UL)                   /*!< OTG_CLK_ON (Bitfield-Mask: 0x01)                      */
#define USB_OTGCLKST_AHB_CLK_ON_Pos       (4UL)                     /*!< AHB_CLK_ON (Bit 4)                                    */
#define USB_OTGCLKST_AHB_CLK_ON_Msk       (0x10UL)                  /*!< AHB_CLK_ON (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                         LPC_GPIO                                          ================ */
/* =========================================================================================================================== */

