lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_DIR2_PINDIR26_Msk            (0x4000000UL)             /*!< PINDIR26 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR2_PINDIR27_Pos            (27UL)                    /*!< PINDIR27 (Bit 27)                                     */
#define GPIO_DIR2_PINDIR27_Msk            (0x8000000UL)             /*!< PINDIR27 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR2_PINDIR28_Pos            (28UL)                    /*!< PINDIR28 (Bit 28)                                     */
#define GPIO_DIR2_PINDIR28_Msk            (0x10000000UL)            /*!< PINDIR28 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR2_PINDIR29_Pos            (29UL)                    /*!< PINDIR29 (Bit 29)                                     */
#define GPIO_DIR2_PINDIR29_Msk            (0x20000000UL)            /*!< PINDIR29 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR2_PINDIR30_Pos            (30UL)                    /*!< PINDIR30 (Bit 30)                                     */
#define GPIO_DIR2_PINDIR30_Msk            (0x40000000UL)            /*!< PINDIR30 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR2_PINDIR31_Pos            (31UL)                    /*!< PINDIR31 (Bit 31)                                     */
#define GPIO_DIR2_PINDIR31_Msk            (0x80000000UL)            /*!< PINDIR31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  DIR3  ========================================================== */
#define GPIO_DIR3_PINDIR0_Pos             (0UL)                     /*!< PINDIR0 (Bit 0)                                       */
#define GPIO_DIR3_PINDIR0_Msk             (0x1UL)                   /*!< PINDIR0 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR1_Pos             (1UL)                     /*!< PINDIR1 (Bit 1)                                       */
#define GPIO_DIR3_PINDIR1_Msk             (0x2UL)                   /*!< PINDIR1 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR2_Pos             (2UL)                     /*!< PINDIR2 (Bit 2)                                       */
#define GPIO_DIR3_PINDIR2_Msk             (0x4UL)                   /*!< PINDIR2 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR3_Pos             (3UL)                     /*!< PINDIR3 (Bit 3)                                       */
#define GPIO_DIR3_PINDIR3_Msk             (0x8UL)                   /*!< PINDIR3 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR4_Pos             (4UL)                     /*!< PINDIR4 (Bit 4)                                       */
#define GPIO_DIR3_PINDIR4_Msk             (0x10UL)                  /*!< PINDIR4 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR5_Pos             (5UL)                     /*!< PINDIR5 (Bit 5)                                       */
#define GPIO_DIR3_PINDIR5_Msk             (0x20UL)                  /*!< PINDIR5 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR6_Pos             (6UL)                     /*!< PINDIR6 (Bit 6)                                       */
#define GPIO_DIR3_PINDIR6_Msk             (0x40UL)                  /*!< PINDIR6 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR7_Pos             (7UL)                     /*!< PINDIR7 (Bit 7)                                       */
#define GPIO_DIR3_PINDIR7_Msk             (0x80UL)                  /*!< PINDIR7 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR8_Pos             (8UL)                     /*!< PINDIR8 (Bit 8)                                       */
#define GPIO_DIR3_PINDIR8_Msk             (0x100UL)                 /*!< PINDIR8 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR9_Pos             (9UL)                     /*!< PINDIR9 (Bit 9)                                       */
#define GPIO_DIR3_PINDIR9_Msk             (0x200UL)                 /*!< PINDIR9 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR3_PINDIR10_Pos            (10UL)                    /*!< PINDIR10 (Bit 10)                                     */
#define GPIO_DIR3_PINDIR10_Msk            (0x400UL)                 /*!< PINDIR10 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR11_Pos            (11UL)                    /*!< PINDIR11 (Bit 11)                                     */
#define GPIO_DIR3_PINDIR11_Msk            (0x800UL)                 /*!< PINDIR11 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR12_Pos            (12UL)                    /*!< PINDIR12 (Bit 12)                                     */
#define GPIO_DIR3_PINDIR12_Msk            (0x1000UL)                /*!< PINDIR12 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR13_Pos            (13UL)                    /*!< PINDIR13 (Bit 13)                                     */
#define GPIO_DIR3_PINDIR13_Msk            (0x2000UL)                /*!< PINDIR13 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR14_Pos            (14UL)                    /*!< PINDIR14 (Bit 14)                                     */
#define GPIO_DIR3_PINDIR14_Msk            (0x4000UL)                /*!< PINDIR14 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR15_Pos            (15UL)                    /*!< PINDIR15 (Bit 15)                                     */
#define GPIO_DIR3_PINDIR15_Msk            (0x8000UL)                /*!< PINDIR15 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR16_Pos            (16UL)                    /*!< PINDIR16 (Bit 16)                                     */
#define GPIO_DIR3_PINDIR16_Msk            (0x10000UL)               /*!< PINDIR16 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR17_Pos            (17UL)                    /*!< PINDIR17 (Bit 17)                                     */
#define GPIO_DIR3_PINDIR17_Msk            (0x20000UL)               /*!< PINDIR17 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR18_Pos            (18UL)                    /*!< PINDIR18 (Bit 18)                                     */
#define GPIO_DIR3_PINDIR18_Msk            (0x40000UL)               /*!< PINDIR18 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR19_Pos            (19UL)                    /*!< PINDIR19 (Bit 19)                                     */
#define GPIO_DIR3_PINDIR19_Msk            (0x80000UL)               /*!< PINDIR19 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR20_Pos            (20UL)                    /*!< PINDIR20 (Bit 20)                                     */
#define GPIO_DIR3_PINDIR20_Msk            (0x100000UL)              /*!< PINDIR20 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR21_Pos            (21UL)                    /*!< PINDIR21 (Bit 21)                                     */
#define GPIO_DIR3_PINDIR21_Msk            (0x200000UL)              /*!< PINDIR21 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR22_Pos            (22UL)                    /*!< PINDIR22 (Bit 22)                                     */
#define GPIO_DIR3_PINDIR22_Msk            (0x400000UL)              /*!< PINDIR22 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR23_Pos            (23UL)                    /*!< PINDIR23 (Bit 23)                                     */
#define GPIO_DIR3_PINDIR23_Msk            (0x800000UL)              /*!< PINDIR23 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR24_Pos            (24UL)                    /*!< PINDIR24 (Bit 24)                                     */
#define GPIO_DIR3_PINDIR24_Msk            (0x1000000UL)             /*!< PINDIR24 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR25_Pos            (25UL)                    /*!< PINDIR25 (Bit 25)                                     */
#define GPIO_DIR3_PINDIR25_Msk            (0x2000000UL)             /*!< PINDIR25 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR26_Pos            (26UL)                    /*!< PINDIR26 (Bit 26)                                     */
#define GPIO_DIR3_PINDIR26_Msk            (0x4000000UL)             /*!< PINDIR26 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR27_Pos            (27UL)                    /*!< PINDIR27 (Bit 27)                                     */
#define GPIO_DIR3_PINDIR27_Msk            (0x8000000UL)             /*!< PINDIR27 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR28_Pos            (28UL)                    /*!< PINDIR28 (Bit 28)                                     */
#define GPIO_DIR3_PINDIR28_Msk            (0x10000000UL)            /*!< PINDIR28 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR29_Pos            (29UL)                    /*!< PINDIR29 (Bit 29)                                     */
#define GPIO_DIR3_PINDIR29_Msk            (0x20000000UL)            /*!< PINDIR29 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR30_Pos            (30UL)                    /*!< PINDIR30 (Bit 30)                                     */
#define GPIO_DIR3_PINDIR30_Msk            (0x40000000UL)            /*!< PINDIR30 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR3_PINDIR31_Pos            (31UL)                    /*!< PINDIR31 (Bit 31)                                     */
#define GPIO_DIR3_PINDIR31_Msk            (0x80000000UL)            /*!< PINDIR31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  DIR4  ========================================================== */
#define GPIO_DIR4_PINDIR0_Pos             (0UL)                     /*!< PINDIR0 (Bit 0)                                       */
#define GPIO_DIR4_PINDIR0_Msk             (0x1UL)                   /*!< PINDIR0 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR1_Pos             (1UL)                     /*!< PINDIR1 (Bit 1)                                       */
#define GPIO_DIR4_PINDIR1_Msk             (0x2UL)                   /*!< PINDIR1 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR2_Pos             (2UL)                     /*!< PINDIR2 (Bit 2)                                       */
#define GPIO_DIR4_PINDIR2_Msk             (0x4UL)                   /*!< PINDIR2 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR3_Pos             (3UL)                     /*!< PINDIR3 (Bit 3)                                       */
#define GPIO_DIR4_PINDIR3_Msk             (0x8UL)                   /*!< PINDIR3 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR4_Pos             (4UL)                     /*!< PINDIR4 (Bit 4)                                       */
#define GPIO_DIR4_PINDIR4_Msk             (0x10UL)                  /*!< PINDIR4 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR5_Pos             (5UL)                     /*!< PINDIR5 (Bit 5)                                       */
#define GPIO_DIR4_PINDIR5_Msk             (0x20UL)                  /*!< PINDIR5 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR6_Pos             (6UL)                     /*!< PINDIR6 (Bit 6)                                       */
#define GPIO_DIR4_PINDIR6_Msk             (0x40UL)                  /*!< PINDIR6 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR7_Pos             (7UL)                     /*!< PINDIR7 (Bit 7)                                       */
#define GPIO_DIR4_PINDIR7_Msk             (0x80UL)                  /*!< PINDIR7 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR8_Pos             (8UL)                     /*!< PINDIR8 (Bit 8)                                       */
#define GPIO_DIR4_PINDIR8_Msk             (0x100UL)                 /*!< PINDIR8 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR9_Pos             (9UL)                     /*!< PINDIR9 (Bit 9)                                       */
#define GPIO_DIR4_PINDIR9_Msk             (0x200UL)                 /*!< PINDIR9 (Bitfield-Mask: 0x01)                         */
#define GPIO_DIR4_PINDIR10_Pos            (10UL)                    /*!< PINDIR10 (Bit 10)                                     */
#define GPIO_DIR4_PINDIR10_Msk            (0x400UL)                 /*!< PINDIR10 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR11_Pos            (11UL)                    /*!< PINDIR11 (Bit 11)                                     */
#define GPIO_DIR4_PINDIR11_Msk            (0x800UL)                 /*!< PINDIR11 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR12_Pos            (12UL)                    /*!< PINDIR12 (Bit 12)                                     */
#define GPIO_DIR4_PINDIR12_Msk            (0x1000UL)                /*!< PINDIR12 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR13_Pos            (13UL)                    /*!< PINDIR13 (Bit 13)                                     */
#define GPIO_DIR4_PINDIR13_Msk            (0x2000UL)                /*!< PINDIR13 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR14_Pos            (14UL)                    /*!< PINDIR14 (Bit 14)                                     */
#define GPIO_DIR4_PINDIR14_Msk            (0x4000UL)                /*!< PINDIR14 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR15_Pos            (15UL)                    /*!< PINDIR15 (Bit 15)                                     */
#define GPIO_DIR4_PINDIR15_Msk            (0x8000UL)                /*!< PINDIR15 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR16_Pos            (16UL)                    /*!< PINDIR16 (Bit 16)                                     */
#define GPIO_DIR4_PINDIR16_Msk            (0x10000UL)               /*!< PINDIR16 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR17_Pos            (17UL)                    /*!< PINDIR17 (Bit 17)                                     */
#define GPIO_DIR4_PINDIR17_Msk            (0x20000UL)               /*!< PINDIR17 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR18_Pos            (18UL)                    /*!< PINDIR18 (Bit 18)                                     */
#define GPIO_DIR4_PINDIR18_Msk            (0x40000UL)               /*!< PINDIR18 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR19_Pos            (19UL)                    /*!< PINDIR19 (Bit 19)                                     */
#define GPIO_DIR4_PINDIR19_Msk            (0x80000UL)               /*!< PINDIR19 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR20_Pos            (20UL)                    /*!< PINDIR20 (Bit 20)                                     */
#define GPIO_DIR4_PINDIR20_Msk            (0x100000UL)              /*!< PINDIR20 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR21_Pos            (21UL)                    /*!< PINDIR21 (Bit 21)                                     */
#define GPIO_DIR4_PINDIR21_Msk            (0x200000UL)              /*!< PINDIR21 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR22_Pos            (22UL)                    /*!< PINDIR22 (Bit 22)                                     */
#define GPIO_DIR4_PINDIR22_Msk            (0x400000UL)              /*!< PINDIR22 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR23_Pos            (23UL)                    /*!< PINDIR23 (Bit 23)                                     */
#define GPIO_DIR4_PINDIR23_Msk            (0x800000UL)              /*!< PINDIR23 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR24_Pos            (24UL)                    /*!< PINDIR24 (Bit 24)                                     */
#define GPIO_DIR4_PINDIR24_Msk            (0x1000000UL)             /*!< PINDIR24 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR25_Pos            (25UL)                    /*!< PINDIR25 (Bit 25)                                     */
#define GPIO_DIR4_PINDIR25_Msk            (0x2000000UL)             /*!< PINDIR25 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR26_Pos            (26UL)                    /*!< PINDIR26 (Bit 26)                                     */
#define GPIO_DIR4_PINDIR26_Msk            (0x4000000UL)             /*!< PINDIR26 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR27_Pos            (27UL)                    /*!< PINDIR27 (Bit 27)                                     */
#define GPIO_DIR4_PINDIR27_Msk            (0x8000000UL)             /*!< PINDIR27 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR28_Pos            (28UL)                    /*!< PINDIR28 (Bit 28)                                     */
#define GPIO_DIR4_PINDIR28_Msk            (0x10000000UL)            /*!< PINDIR28 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR29_Pos            (29UL)                    /*!< PINDIR29 (Bit 29)                                     */
#define GPIO_DIR4_PINDIR29_Msk            (0x20000000UL)            /*!< PINDIR29 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR30_Pos            (30UL)                    /*!< PINDIR30 (Bit 30)                                     */
#define GPIO_DIR4_PINDIR30_Msk            (0x40000000UL)            /*!< PINDIR30 (Bitfield-Mask: 0x01)                        */
#define GPIO_DIR4_PINDIR31_Pos            (31UL)                    /*!< PINDIR31 (Bit 31)                                     */
#define GPIO_DIR4_PINDIR31_Msk            (0x80000000UL)            /*!< PINDIR31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  MASK0  ========================================================= */
#define GPIO_MASK0_PINMASK0_Pos           (0UL)                     /*!< PINMASK0 (Bit 0)                                      */
#define GPIO_MASK0_PINMASK0_Msk           (0x1UL)                   /*!< PINMASK0 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK1_Pos           (1UL)                     /*!< PINMASK1 (Bit 1)                                      */
#define GPIO_MASK0_PINMASK1_Msk           (0x2UL)                   /*!< PINMASK1 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK2_Pos           (2UL)                     /*!< PINMASK2 (Bit 2)                                      */
#define GPIO_MASK0_PINMASK2_Msk           (0x4UL)                   /*!< PINMASK2 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK3_Pos           (3UL)                     /*!< PINMASK3 (Bit 3)                                      */
#define GPIO_MASK0_PINMASK3_Msk           (0x8UL)                   /*!< PINMASK3 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK4_Pos           (4UL)                     /*!< PINMASK4 (Bit 4)                                      */
#define GPIO_MASK0_PINMASK4_Msk           (0x10UL)                  /*!< PINMASK4 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK5_Pos           (5UL)                     /*!< PINMASK5 (Bit 5)                                      */
#define GPIO_MASK0_PINMASK5_Msk           (0x20UL)                  /*!< PINMASK5 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK6_Pos           (6UL)                     /*!< PINMASK6 (Bit 6)                                      */
#define GPIO_MASK0_PINMASK6_Msk           (0x40UL)                  /*!< PINMASK6 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK7_Pos           (7UL)                     /*!< PINMASK7 (Bit 7)                                      */
#define GPIO_MASK0_PINMASK7_Msk           (0x80UL)                  /*!< PINMASK7 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK8_Pos           (8UL)                     /*!< PINMASK8 (Bit 8)                                      */
#define GPIO_MASK0_PINMASK8_Msk           (0x100UL)                 /*!< PINMASK8 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK9_Pos           (9UL)                     /*!< PINMASK9 (Bit 9)                                      */
#define GPIO_MASK0_PINMASK9_Msk           (0x200UL)                 /*!< PINMASK9 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK0_PINMASK10_Pos          (10UL)                    /*!< PINMASK10 (Bit 10)                                    */
#define GPIO_MASK0_PINMASK10_Msk          (0x400UL)                 /*!< PINMASK10 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK11_Pos          (11UL)                    /*!< PINMASK11 (Bit 11)                                    */
#define GPIO_MASK0_PINMASK11_Msk          (0x800UL)                 /*!< PINMASK11 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK12_Pos          (12UL)                    /*!< PINMASK12 (Bit 12)                                    */
#define GPIO_MASK0_PINMASK12_Msk          (0x1000UL)                /*!< PINMASK12 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK13_Pos          (13UL)                    /*!< PINMASK13 (Bit 13)                                    */
#define GPIO_MASK0_PINMASK13_Msk          (0x2000UL)                /*!< PINMASK13 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK14_Pos          (14UL)                    /*!< PINMASK14 (Bit 14)                                    */
#define GPIO_MASK0_PINMASK14_Msk          (0x4000UL)                /*!< PINMASK14 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK15_Pos          (15UL)                    /*!< PINMASK15 (Bit 15)                                    */
#define GPIO_MASK0_PINMASK15_Msk          (0x8000UL)                /*!< PINMASK15 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK16_Pos          (16UL)                    /*!< PINMASK16 (Bit 16)                                    */
#define GPIO_MASK0_PINMASK16_Msk          (0x10000UL)               /*!< PINMASK16 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK17_Pos          (17UL)                    /*!< PINMASK17 (Bit 17)                                    */
#define GPIO_MASK0_PINMASK17_Msk          (0x20000UL)               /*!< PINMASK17 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK18_Pos          (18UL)                    /*!< PINMASK18 (Bit 18)                                    */
#define GPIO_MASK0_PINMASK18_Msk          (0x40000UL)               /*!< PINMASK18 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK19_Pos          (19UL)                    /*!< PINMASK19 (Bit 19)                                    */
#define GPIO_MASK0_PINMASK19_Msk          (0x80000UL)               /*!< PINMASK19 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK20_Pos          (20UL)                    /*!< PINMASK20 (Bit 20)                                    */
#define GPIO_MASK0_PINMASK20_Msk          (0x100000UL)              /*!< PINMASK20 (Bitfield-Mask: 0x01)                       */
