lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_MASK0_PINMASK21_Pos          (21UL)                    /*!< PINMASK21 (Bit 21)                                    */
#define GPIO_MASK0_PINMASK21_Msk          (0x200000UL)              /*!< PINMASK21 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK22_Pos          (22UL)                    /*!< PINMASK22 (Bit 22)                                    */
#define GPIO_MASK0_PINMASK22_Msk          (0x400000UL)              /*!< PINMASK22 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK23_Pos          (23UL)                    /*!< PINMASK23 (Bit 23)                                    */
#define GPIO_MASK0_PINMASK23_Msk          (0x800000UL)              /*!< PINMASK23 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK24_Pos          (24UL)                    /*!< PINMASK24 (Bit 24)                                    */
#define GPIO_MASK0_PINMASK24_Msk          (0x1000000UL)             /*!< PINMASK24 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK25_Pos          (25UL)                    /*!< PINMASK25 (Bit 25)                                    */
#define GPIO_MASK0_PINMASK25_Msk          (0x2000000UL)             /*!< PINMASK25 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK26_Pos          (26UL)                    /*!< PINMASK26 (Bit 26)                                    */
#define GPIO_MASK0_PINMASK26_Msk          (0x4000000UL)             /*!< PINMASK26 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK27_Pos          (27UL)                    /*!< PINMASK27 (Bit 27)                                    */
#define GPIO_MASK0_PINMASK27_Msk          (0x8000000UL)             /*!< PINMASK27 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK28_Pos          (28UL)                    /*!< PINMASK28 (Bit 28)                                    */
#define GPIO_MASK0_PINMASK28_Msk          (0x10000000UL)            /*!< PINMASK28 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK29_Pos          (29UL)                    /*!< PINMASK29 (Bit 29)                                    */
#define GPIO_MASK0_PINMASK29_Msk          (0x20000000UL)            /*!< PINMASK29 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK30_Pos          (30UL)                    /*!< PINMASK30 (Bit 30)                                    */
#define GPIO_MASK0_PINMASK30_Msk          (0x40000000UL)            /*!< PINMASK30 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK0_PINMASK31_Pos          (31UL)                    /*!< PINMASK31 (Bit 31)                                    */
#define GPIO_MASK0_PINMASK31_Msk          (0x80000000UL)            /*!< PINMASK31 (Bitfield-Mask: 0x01)                       */
/* =========================================================  MASK1  ========================================================= */
#define GPIO_MASK1_PINMASK0_Pos           (0UL)                     /*!< PINMASK0 (Bit 0)                                      */
#define GPIO_MASK1_PINMASK0_Msk           (0x1UL)                   /*!< PINMASK0 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK1_Pos           (1UL)                     /*!< PINMASK1 (Bit 1)                                      */
#define GPIO_MASK1_PINMASK1_Msk           (0x2UL)                   /*!< PINMASK1 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK2_Pos           (2UL)                     /*!< PINMASK2 (Bit 2)                                      */
#define GPIO_MASK1_PINMASK2_Msk           (0x4UL)                   /*!< PINMASK2 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK3_Pos           (3UL)                     /*!< PINMASK3 (Bit 3)                                      */
#define GPIO_MASK1_PINMASK3_Msk           (0x8UL)                   /*!< PINMASK3 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK4_Pos           (4UL)                     /*!< PINMASK4 (Bit 4)                                      */
#define GPIO_MASK1_PINMASK4_Msk           (0x10UL)                  /*!< PINMASK4 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK5_Pos           (5UL)                     /*!< PINMASK5 (Bit 5)                                      */
#define GPIO_MASK1_PINMASK5_Msk           (0x20UL)                  /*!< PINMASK5 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK6_Pos           (6UL)                     /*!< PINMASK6 (Bit 6)                                      */
#define GPIO_MASK1_PINMASK6_Msk           (0x40UL)                  /*!< PINMASK6 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK7_Pos           (7UL)                     /*!< PINMASK7 (Bit 7)                                      */
#define GPIO_MASK1_PINMASK7_Msk           (0x80UL)                  /*!< PINMASK7 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK8_Pos           (8UL)                     /*!< PINMASK8 (Bit 8)                                      */
#define GPIO_MASK1_PINMASK8_Msk           (0x100UL)                 /*!< PINMASK8 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK9_Pos           (9UL)                     /*!< PINMASK9 (Bit 9)                                      */
#define GPIO_MASK1_PINMASK9_Msk           (0x200UL)                 /*!< PINMASK9 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK1_PINMASK10_Pos          (10UL)                    /*!< PINMASK10 (Bit 10)                                    */
#define GPIO_MASK1_PINMASK10_Msk          (0x400UL)                 /*!< PINMASK10 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK11_Pos          (11UL)                    /*!< PINMASK11 (Bit 11)                                    */
#define GPIO_MASK1_PINMASK11_Msk          (0x800UL)                 /*!< PINMASK11 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK12_Pos          (12UL)                    /*!< PINMASK12 (Bit 12)                                    */
#define GPIO_MASK1_PINMASK12_Msk          (0x1000UL)                /*!< PINMASK12 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK13_Pos          (13UL)                    /*!< PINMASK13 (Bit 13)                                    */
#define GPIO_MASK1_PINMASK13_Msk          (0x2000UL)                /*!< PINMASK13 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK14_Pos          (14UL)                    /*!< PINMASK14 (Bit 14)                                    */
#define GPIO_MASK1_PINMASK14_Msk          (0x4000UL)                /*!< PINMASK14 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK15_Pos          (15UL)                    /*!< PINMASK15 (Bit 15)                                    */
#define GPIO_MASK1_PINMASK15_Msk          (0x8000UL)                /*!< PINMASK15 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK16_Pos          (16UL)                    /*!< PINMASK16 (Bit 16)                                    */
#define GPIO_MASK1_PINMASK16_Msk          (0x10000UL)               /*!< PINMASK16 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK17_Pos          (17UL)                    /*!< PINMASK17 (Bit 17)                                    */
#define GPIO_MASK1_PINMASK17_Msk          (0x20000UL)               /*!< PINMASK17 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK18_Pos          (18UL)                    /*!< PINMASK18 (Bit 18)                                    */
#define GPIO_MASK1_PINMASK18_Msk          (0x40000UL)               /*!< PINMASK18 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK19_Pos          (19UL)                    /*!< PINMASK19 (Bit 19)                                    */
#define GPIO_MASK1_PINMASK19_Msk          (0x80000UL)               /*!< PINMASK19 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK20_Pos          (20UL)                    /*!< PINMASK20 (Bit 20)                                    */
#define GPIO_MASK1_PINMASK20_Msk          (0x100000UL)              /*!< PINMASK20 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK21_Pos          (21UL)                    /*!< PINMASK21 (Bit 21)                                    */
#define GPIO_MASK1_PINMASK21_Msk          (0x200000UL)              /*!< PINMASK21 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK22_Pos          (22UL)                    /*!< PINMASK22 (Bit 22)                                    */
#define GPIO_MASK1_PINMASK22_Msk          (0x400000UL)              /*!< PINMASK22 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK23_Pos          (23UL)                    /*!< PINMASK23 (Bit 23)                                    */
#define GPIO_MASK1_PINMASK23_Msk          (0x800000UL)              /*!< PINMASK23 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK24_Pos          (24UL)                    /*!< PINMASK24 (Bit 24)                                    */
#define GPIO_MASK1_PINMASK24_Msk          (0x1000000UL)             /*!< PINMASK24 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK25_Pos          (25UL)                    /*!< PINMASK25 (Bit 25)                                    */
#define GPIO_MASK1_PINMASK25_Msk          (0x2000000UL)             /*!< PINMASK25 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK26_Pos          (26UL)                    /*!< PINMASK26 (Bit 26)                                    */
#define GPIO_MASK1_PINMASK26_Msk          (0x4000000UL)             /*!< PINMASK26 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK27_Pos          (27UL)                    /*!< PINMASK27 (Bit 27)                                    */
#define GPIO_MASK1_PINMASK27_Msk          (0x8000000UL)             /*!< PINMASK27 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK28_Pos          (28UL)                    /*!< PINMASK28 (Bit 28)                                    */
#define GPIO_MASK1_PINMASK28_Msk          (0x10000000UL)            /*!< PINMASK28 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK29_Pos          (29UL)                    /*!< PINMASK29 (Bit 29)                                    */
#define GPIO_MASK1_PINMASK29_Msk          (0x20000000UL)            /*!< PINMASK29 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK30_Pos          (30UL)                    /*!< PINMASK30 (Bit 30)                                    */
#define GPIO_MASK1_PINMASK30_Msk          (0x40000000UL)            /*!< PINMASK30 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK1_PINMASK31_Pos          (31UL)                    /*!< PINMASK31 (Bit 31)                                    */
#define GPIO_MASK1_PINMASK31_Msk          (0x80000000UL)            /*!< PINMASK31 (Bitfield-Mask: 0x01)                       */
/* =========================================================  MASK2  ========================================================= */
#define GPIO_MASK2_PINMASK0_Pos           (0UL)                     /*!< PINMASK0 (Bit 0)                                      */
#define GPIO_MASK2_PINMASK0_Msk           (0x1UL)                   /*!< PINMASK0 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK1_Pos           (1UL)                     /*!< PINMASK1 (Bit 1)                                      */
#define GPIO_MASK2_PINMASK1_Msk           (0x2UL)                   /*!< PINMASK1 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK2_Pos           (2UL)                     /*!< PINMASK2 (Bit 2)                                      */
#define GPIO_MASK2_PINMASK2_Msk           (0x4UL)                   /*!< PINMASK2 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK3_Pos           (3UL)                     /*!< PINMASK3 (Bit 3)                                      */
#define GPIO_MASK2_PINMASK3_Msk           (0x8UL)                   /*!< PINMASK3 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK4_Pos           (4UL)                     /*!< PINMASK4 (Bit 4)                                      */
#define GPIO_MASK2_PINMASK4_Msk           (0x10UL)                  /*!< PINMASK4 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK5_Pos           (5UL)                     /*!< PINMASK5 (Bit 5)                                      */
#define GPIO_MASK2_PINMASK5_Msk           (0x20UL)                  /*!< PINMASK5 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK6_Pos           (6UL)                     /*!< PINMASK6 (Bit 6)                                      */
#define GPIO_MASK2_PINMASK6_Msk           (0x40UL)                  /*!< PINMASK6 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK7_Pos           (7UL)                     /*!< PINMASK7 (Bit 7)                                      */
#define GPIO_MASK2_PINMASK7_Msk           (0x80UL)                  /*!< PINMASK7 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK8_Pos           (8UL)                     /*!< PINMASK8 (Bit 8)                                      */
#define GPIO_MASK2_PINMASK8_Msk           (0x100UL)                 /*!< PINMASK8 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK9_Pos           (9UL)                     /*!< PINMASK9 (Bit 9)                                      */
#define GPIO_MASK2_PINMASK9_Msk           (0x200UL)                 /*!< PINMASK9 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK2_PINMASK10_Pos          (10UL)                    /*!< PINMASK10 (Bit 10)                                    */
#define GPIO_MASK2_PINMASK10_Msk          (0x400UL)                 /*!< PINMASK10 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK11_Pos          (11UL)                    /*!< PINMASK11 (Bit 11)                                    */
#define GPIO_MASK2_PINMASK11_Msk          (0x800UL)                 /*!< PINMASK11 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK12_Pos          (12UL)                    /*!< PINMASK12 (Bit 12)                                    */
#define GPIO_MASK2_PINMASK12_Msk          (0x1000UL)                /*!< PINMASK12 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK13_Pos          (13UL)                    /*!< PINMASK13 (Bit 13)                                    */
#define GPIO_MASK2_PINMASK13_Msk          (0x2000UL)                /*!< PINMASK13 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK14_Pos          (14UL)                    /*!< PINMASK14 (Bit 14)                                    */
#define GPIO_MASK2_PINMASK14_Msk          (0x4000UL)                /*!< PINMASK14 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK15_Pos          (15UL)                    /*!< PINMASK15 (Bit 15)                                    */
#define GPIO_MASK2_PINMASK15_Msk          (0x8000UL)                /*!< PINMASK15 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK16_Pos          (16UL)                    /*!< PINMASK16 (Bit 16)                                    */
#define GPIO_MASK2_PINMASK16_Msk          (0x10000UL)               /*!< PINMASK16 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK17_Pos          (17UL)                    /*!< PINMASK17 (Bit 17)                                    */
#define GPIO_MASK2_PINMASK17_Msk          (0x20000UL)               /*!< PINMASK17 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK18_Pos          (18UL)                    /*!< PINMASK18 (Bit 18)                                    */
#define GPIO_MASK2_PINMASK18_Msk          (0x40000UL)               /*!< PINMASK18 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK19_Pos          (19UL)                    /*!< PINMASK19 (Bit 19)                                    */
#define GPIO_MASK2_PINMASK19_Msk          (0x80000UL)               /*!< PINMASK19 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK20_Pos          (20UL)                    /*!< PINMASK20 (Bit 20)                                    */
#define GPIO_MASK2_PINMASK20_Msk          (0x100000UL)              /*!< PINMASK20 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK21_Pos          (21UL)                    /*!< PINMASK21 (Bit 21)                                    */
#define GPIO_MASK2_PINMASK21_Msk          (0x200000UL)              /*!< PINMASK21 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK22_Pos          (22UL)                    /*!< PINMASK22 (Bit 22)                                    */
#define GPIO_MASK2_PINMASK22_Msk          (0x400000UL)              /*!< PINMASK22 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK23_Pos          (23UL)                    /*!< PINMASK23 (Bit 23)                                    */
#define GPIO_MASK2_PINMASK23_Msk          (0x800000UL)              /*!< PINMASK23 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK24_Pos          (24UL)                    /*!< PINMASK24 (Bit 24)                                    */
#define GPIO_MASK2_PINMASK24_Msk          (0x1000000UL)             /*!< PINMASK24 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK25_Pos          (25UL)                    /*!< PINMASK25 (Bit 25)                                    */
#define GPIO_MASK2_PINMASK25_Msk          (0x2000000UL)             /*!< PINMASK25 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK26_Pos          (26UL)                    /*!< PINMASK26 (Bit 26)                                    */
#define GPIO_MASK2_PINMASK26_Msk          (0x4000000UL)             /*!< PINMASK26 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK27_Pos          (27UL)                    /*!< PINMASK27 (Bit 27)                                    */
#define GPIO_MASK2_PINMASK27_Msk          (0x8000000UL)             /*!< PINMASK27 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK28_Pos          (28UL)                    /*!< PINMASK28 (Bit 28)                                    */
#define GPIO_MASK2_PINMASK28_Msk          (0x10000000UL)            /*!< PINMASK28 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK29_Pos          (29UL)                    /*!< PINMASK29 (Bit 29)                                    */
#define GPIO_MASK2_PINMASK29_Msk          (0x20000000UL)            /*!< PINMASK29 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK30_Pos          (30UL)                    /*!< PINMASK30 (Bit 30)                                    */
#define GPIO_MASK2_PINMASK30_Msk          (0x40000000UL)            /*!< PINMASK30 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK2_PINMASK31_Pos          (31UL)                    /*!< PINMASK31 (Bit 31)                                    */
#define GPIO_MASK2_PINMASK31_Msk          (0x80000000UL)            /*!< PINMASK31 (Bitfield-Mask: 0x01)                       */
/* =========================================================  MASK3  ========================================================= */
#define GPIO_MASK3_PINMASK0_Pos           (0UL)                     /*!< PINMASK0 (Bit 0)                                      */
#define GPIO_MASK3_PINMASK0_Msk           (0x1UL)                   /*!< PINMASK0 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK1_Pos           (1UL)                     /*!< PINMASK1 (Bit 1)                                      */
#define GPIO_MASK3_PINMASK1_Msk           (0x2UL)                   /*!< PINMASK1 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK2_Pos           (2UL)                     /*!< PINMASK2 (Bit 2)                                      */
#define GPIO_MASK3_PINMASK2_Msk           (0x4UL)                   /*!< PINMASK2 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK3_Pos           (3UL)                     /*!< PINMASK3 (Bit 3)                                      */
#define GPIO_MASK3_PINMASK3_Msk           (0x8UL)                   /*!< PINMASK3 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK4_Pos           (4UL)                     /*!< PINMASK4 (Bit 4)                                      */
#define GPIO_MASK3_PINMASK4_Msk           (0x10UL)                  /*!< PINMASK4 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK5_Pos           (5UL)                     /*!< PINMASK5 (Bit 5)                                      */
#define GPIO_MASK3_PINMASK5_Msk           (0x20UL)                  /*!< PINMASK5 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK6_Pos           (6UL)                     /*!< PINMASK6 (Bit 6)                                      */
#define GPIO_MASK3_PINMASK6_Msk           (0x40UL)                  /*!< PINMASK6 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK7_Pos           (7UL)                     /*!< PINMASK7 (Bit 7)                                      */
#define GPIO_MASK3_PINMASK7_Msk           (0x80UL)                  /*!< PINMASK7 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK8_Pos           (8UL)                     /*!< PINMASK8 (Bit 8)                                      */
#define GPIO_MASK3_PINMASK8_Msk           (0x100UL)                 /*!< PINMASK8 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK9_Pos           (9UL)                     /*!< PINMASK9 (Bit 9)                                      */
#define GPIO_MASK3_PINMASK9_Msk           (0x200UL)                 /*!< PINMASK9 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK3_PINMASK10_Pos          (10UL)                    /*!< PINMASK10 (Bit 10)                                    */
#define GPIO_MASK3_PINMASK10_Msk          (0x400UL)                 /*!< PINMASK10 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK11_Pos          (11UL)                    /*!< PINMASK11 (Bit 11)                                    */
#define GPIO_MASK3_PINMASK11_Msk          (0x800UL)                 /*!< PINMASK11 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK12_Pos          (12UL)                    /*!< PINMASK12 (Bit 12)                                    */
#define GPIO_MASK3_PINMASK12_Msk          (0x1000UL)                /*!< PINMASK12 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK13_Pos          (13UL)                    /*!< PINMASK13 (Bit 13)                                    */
#define GPIO_MASK3_PINMASK13_Msk          (0x2000UL)                /*!< PINMASK13 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK14_Pos          (14UL)                    /*!< PINMASK14 (Bit 14)                                    */
#define GPIO_MASK3_PINMASK14_Msk          (0x4000UL)                /*!< PINMASK14 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK15_Pos          (15UL)                    /*!< PINMASK15 (Bit 15)                                    */
