lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_MASK3_PINMASK15_Msk          (0x8000UL)                /*!< PINMASK15 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK16_Pos          (16UL)                    /*!< PINMASK16 (Bit 16)                                    */
#define GPIO_MASK3_PINMASK16_Msk          (0x10000UL)               /*!< PINMASK16 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK17_Pos          (17UL)                    /*!< PINMASK17 (Bit 17)                                    */
#define GPIO_MASK3_PINMASK17_Msk          (0x20000UL)               /*!< PINMASK17 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK18_Pos          (18UL)                    /*!< PINMASK18 (Bit 18)                                    */
#define GPIO_MASK3_PINMASK18_Msk          (0x40000UL)               /*!< PINMASK18 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK19_Pos          (19UL)                    /*!< PINMASK19 (Bit 19)                                    */
#define GPIO_MASK3_PINMASK19_Msk          (0x80000UL)               /*!< PINMASK19 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK20_Pos          (20UL)                    /*!< PINMASK20 (Bit 20)                                    */
#define GPIO_MASK3_PINMASK20_Msk          (0x100000UL)              /*!< PINMASK20 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK21_Pos          (21UL)                    /*!< PINMASK21 (Bit 21)                                    */
#define GPIO_MASK3_PINMASK21_Msk          (0x200000UL)              /*!< PINMASK21 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK22_Pos          (22UL)                    /*!< PINMASK22 (Bit 22)                                    */
#define GPIO_MASK3_PINMASK22_Msk          (0x400000UL)              /*!< PINMASK22 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK23_Pos          (23UL)                    /*!< PINMASK23 (Bit 23)                                    */
#define GPIO_MASK3_PINMASK23_Msk          (0x800000UL)              /*!< PINMASK23 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK24_Pos          (24UL)                    /*!< PINMASK24 (Bit 24)                                    */
#define GPIO_MASK3_PINMASK24_Msk          (0x1000000UL)             /*!< PINMASK24 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK25_Pos          (25UL)                    /*!< PINMASK25 (Bit 25)                                    */
#define GPIO_MASK3_PINMASK25_Msk          (0x2000000UL)             /*!< PINMASK25 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK26_Pos          (26UL)                    /*!< PINMASK26 (Bit 26)                                    */
#define GPIO_MASK3_PINMASK26_Msk          (0x4000000UL)             /*!< PINMASK26 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK27_Pos          (27UL)                    /*!< PINMASK27 (Bit 27)                                    */
#define GPIO_MASK3_PINMASK27_Msk          (0x8000000UL)             /*!< PINMASK27 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK28_Pos          (28UL)                    /*!< PINMASK28 (Bit 28)                                    */
#define GPIO_MASK3_PINMASK28_Msk          (0x10000000UL)            /*!< PINMASK28 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK29_Pos          (29UL)                    /*!< PINMASK29 (Bit 29)                                    */
#define GPIO_MASK3_PINMASK29_Msk          (0x20000000UL)            /*!< PINMASK29 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK30_Pos          (30UL)                    /*!< PINMASK30 (Bit 30)                                    */
#define GPIO_MASK3_PINMASK30_Msk          (0x40000000UL)            /*!< PINMASK30 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK3_PINMASK31_Pos          (31UL)                    /*!< PINMASK31 (Bit 31)                                    */
#define GPIO_MASK3_PINMASK31_Msk          (0x80000000UL)            /*!< PINMASK31 (Bitfield-Mask: 0x01)                       */
/* =========================================================  MASK4  ========================================================= */
#define GPIO_MASK4_PINMASK0_Pos           (0UL)                     /*!< PINMASK0 (Bit 0)                                      */
#define GPIO_MASK4_PINMASK0_Msk           (0x1UL)                   /*!< PINMASK0 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK1_Pos           (1UL)                     /*!< PINMASK1 (Bit 1)                                      */
#define GPIO_MASK4_PINMASK1_Msk           (0x2UL)                   /*!< PINMASK1 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK2_Pos           (2UL)                     /*!< PINMASK2 (Bit 2)                                      */
#define GPIO_MASK4_PINMASK2_Msk           (0x4UL)                   /*!< PINMASK2 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK3_Pos           (3UL)                     /*!< PINMASK3 (Bit 3)                                      */
#define GPIO_MASK4_PINMASK3_Msk           (0x8UL)                   /*!< PINMASK3 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK4_Pos           (4UL)                     /*!< PINMASK4 (Bit 4)                                      */
#define GPIO_MASK4_PINMASK4_Msk           (0x10UL)                  /*!< PINMASK4 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK5_Pos           (5UL)                     /*!< PINMASK5 (Bit 5)                                      */
#define GPIO_MASK4_PINMASK5_Msk           (0x20UL)                  /*!< PINMASK5 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK6_Pos           (6UL)                     /*!< PINMASK6 (Bit 6)                                      */
#define GPIO_MASK4_PINMASK6_Msk           (0x40UL)                  /*!< PINMASK6 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK7_Pos           (7UL)                     /*!< PINMASK7 (Bit 7)                                      */
#define GPIO_MASK4_PINMASK7_Msk           (0x80UL)                  /*!< PINMASK7 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK8_Pos           (8UL)                     /*!< PINMASK8 (Bit 8)                                      */
#define GPIO_MASK4_PINMASK8_Msk           (0x100UL)                 /*!< PINMASK8 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK9_Pos           (9UL)                     /*!< PINMASK9 (Bit 9)                                      */
#define GPIO_MASK4_PINMASK9_Msk           (0x200UL)                 /*!< PINMASK9 (Bitfield-Mask: 0x01)                        */
#define GPIO_MASK4_PINMASK10_Pos          (10UL)                    /*!< PINMASK10 (Bit 10)                                    */
#define GPIO_MASK4_PINMASK10_Msk          (0x400UL)                 /*!< PINMASK10 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK11_Pos          (11UL)                    /*!< PINMASK11 (Bit 11)                                    */
#define GPIO_MASK4_PINMASK11_Msk          (0x800UL)                 /*!< PINMASK11 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK12_Pos          (12UL)                    /*!< PINMASK12 (Bit 12)                                    */
#define GPIO_MASK4_PINMASK12_Msk          (0x1000UL)                /*!< PINMASK12 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK13_Pos          (13UL)                    /*!< PINMASK13 (Bit 13)                                    */
#define GPIO_MASK4_PINMASK13_Msk          (0x2000UL)                /*!< PINMASK13 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK14_Pos          (14UL)                    /*!< PINMASK14 (Bit 14)                                    */
#define GPIO_MASK4_PINMASK14_Msk          (0x4000UL)                /*!< PINMASK14 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK15_Pos          (15UL)                    /*!< PINMASK15 (Bit 15)                                    */
#define GPIO_MASK4_PINMASK15_Msk          (0x8000UL)                /*!< PINMASK15 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK16_Pos          (16UL)                    /*!< PINMASK16 (Bit 16)                                    */
#define GPIO_MASK4_PINMASK16_Msk          (0x10000UL)               /*!< PINMASK16 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK17_Pos          (17UL)                    /*!< PINMASK17 (Bit 17)                                    */
#define GPIO_MASK4_PINMASK17_Msk          (0x20000UL)               /*!< PINMASK17 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK18_Pos          (18UL)                    /*!< PINMASK18 (Bit 18)                                    */
#define GPIO_MASK4_PINMASK18_Msk          (0x40000UL)               /*!< PINMASK18 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK19_Pos          (19UL)                    /*!< PINMASK19 (Bit 19)                                    */
#define GPIO_MASK4_PINMASK19_Msk          (0x80000UL)               /*!< PINMASK19 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK20_Pos          (20UL)                    /*!< PINMASK20 (Bit 20)                                    */
#define GPIO_MASK4_PINMASK20_Msk          (0x100000UL)              /*!< PINMASK20 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK21_Pos          (21UL)                    /*!< PINMASK21 (Bit 21)                                    */
#define GPIO_MASK4_PINMASK21_Msk          (0x200000UL)              /*!< PINMASK21 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK22_Pos          (22UL)                    /*!< PINMASK22 (Bit 22)                                    */
#define GPIO_MASK4_PINMASK22_Msk          (0x400000UL)              /*!< PINMASK22 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK23_Pos          (23UL)                    /*!< PINMASK23 (Bit 23)                                    */
#define GPIO_MASK4_PINMASK23_Msk          (0x800000UL)              /*!< PINMASK23 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK24_Pos          (24UL)                    /*!< PINMASK24 (Bit 24)                                    */
#define GPIO_MASK4_PINMASK24_Msk          (0x1000000UL)             /*!< PINMASK24 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK25_Pos          (25UL)                    /*!< PINMASK25 (Bit 25)                                    */
#define GPIO_MASK4_PINMASK25_Msk          (0x2000000UL)             /*!< PINMASK25 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK26_Pos          (26UL)                    /*!< PINMASK26 (Bit 26)                                    */
#define GPIO_MASK4_PINMASK26_Msk          (0x4000000UL)             /*!< PINMASK26 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK27_Pos          (27UL)                    /*!< PINMASK27 (Bit 27)                                    */
#define GPIO_MASK4_PINMASK27_Msk          (0x8000000UL)             /*!< PINMASK27 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK28_Pos          (28UL)                    /*!< PINMASK28 (Bit 28)                                    */
#define GPIO_MASK4_PINMASK28_Msk          (0x10000000UL)            /*!< PINMASK28 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK29_Pos          (29UL)                    /*!< PINMASK29 (Bit 29)                                    */
#define GPIO_MASK4_PINMASK29_Msk          (0x20000000UL)            /*!< PINMASK29 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK30_Pos          (30UL)                    /*!< PINMASK30 (Bit 30)                                    */
#define GPIO_MASK4_PINMASK30_Msk          (0x40000000UL)            /*!< PINMASK30 (Bitfield-Mask: 0x01)                       */
#define GPIO_MASK4_PINMASK31_Pos          (31UL)                    /*!< PINMASK31 (Bit 31)                                    */
#define GPIO_MASK4_PINMASK31_Msk          (0x80000000UL)            /*!< PINMASK31 (Bitfield-Mask: 0x01)                       */
/* =========================================================  PIN0  ========================================================== */
#define GPIO_PIN0_PINVAL0_Pos             (0UL)                     /*!< PINVAL0 (Bit 0)                                       */
#define GPIO_PIN0_PINVAL0_Msk             (0x1UL)                   /*!< PINVAL0 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL1_Pos             (1UL)                     /*!< PINVAL1 (Bit 1)                                       */
#define GPIO_PIN0_PINVAL1_Msk             (0x2UL)                   /*!< PINVAL1 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL2_Pos             (2UL)                     /*!< PINVAL2 (Bit 2)                                       */
#define GPIO_PIN0_PINVAL2_Msk             (0x4UL)                   /*!< PINVAL2 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL3_Pos             (3UL)                     /*!< PINVAL3 (Bit 3)                                       */
#define GPIO_PIN0_PINVAL3_Msk             (0x8UL)                   /*!< PINVAL3 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL4_Pos             (4UL)                     /*!< PINVAL4 (Bit 4)                                       */
#define GPIO_PIN0_PINVAL4_Msk             (0x10UL)                  /*!< PINVAL4 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL5_Pos             (5UL)                     /*!< PINVAL5 (Bit 5)                                       */
#define GPIO_PIN0_PINVAL5_Msk             (0x20UL)                  /*!< PINVAL5 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL6_Pos             (6UL)                     /*!< PINVAL6 (Bit 6)                                       */
#define GPIO_PIN0_PINVAL6_Msk             (0x40UL)                  /*!< PINVAL6 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL7_Pos             (7UL)                     /*!< PINVAL7 (Bit 7)                                       */
#define GPIO_PIN0_PINVAL7_Msk             (0x80UL)                  /*!< PINVAL7 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL8_Pos             (8UL)                     /*!< PINVAL8 (Bit 8)                                       */
#define GPIO_PIN0_PINVAL8_Msk             (0x100UL)                 /*!< PINVAL8 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL9_Pos             (9UL)                     /*!< PINVAL9 (Bit 9)                                       */
#define GPIO_PIN0_PINVAL9_Msk             (0x200UL)                 /*!< PINVAL9 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN0_PINVAL10_Pos            (10UL)                    /*!< PINVAL10 (Bit 10)                                     */
#define GPIO_PIN0_PINVAL10_Msk            (0x400UL)                 /*!< PINVAL10 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL11_Pos            (11UL)                    /*!< PINVAL11 (Bit 11)                                     */
#define GPIO_PIN0_PINVAL11_Msk            (0x800UL)                 /*!< PINVAL11 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL12_Pos            (12UL)                    /*!< PINVAL12 (Bit 12)                                     */
#define GPIO_PIN0_PINVAL12_Msk            (0x1000UL)                /*!< PINVAL12 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL13_Pos            (13UL)                    /*!< PINVAL13 (Bit 13)                                     */
#define GPIO_PIN0_PINVAL13_Msk            (0x2000UL)                /*!< PINVAL13 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL14_Pos            (14UL)                    /*!< PINVAL14 (Bit 14)                                     */
#define GPIO_PIN0_PINVAL14_Msk            (0x4000UL)                /*!< PINVAL14 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL15_Pos            (15UL)                    /*!< PINVAL15 (Bit 15)                                     */
#define GPIO_PIN0_PINVAL15_Msk            (0x8000UL)                /*!< PINVAL15 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL16_Pos            (16UL)                    /*!< PINVAL16 (Bit 16)                                     */
#define GPIO_PIN0_PINVAL16_Msk            (0x10000UL)               /*!< PINVAL16 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL17_Pos            (17UL)                    /*!< PINVAL17 (Bit 17)                                     */
#define GPIO_PIN0_PINVAL17_Msk            (0x20000UL)               /*!< PINVAL17 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL18_Pos            (18UL)                    /*!< PINVAL18 (Bit 18)                                     */
#define GPIO_PIN0_PINVAL18_Msk            (0x40000UL)               /*!< PINVAL18 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL19_Pos            (19UL)                    /*!< PINVAL19 (Bit 19)                                     */
#define GPIO_PIN0_PINVAL19_Msk            (0x80000UL)               /*!< PINVAL19 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL20_Pos            (20UL)                    /*!< PINVAL20 (Bit 20)                                     */
#define GPIO_PIN0_PINVAL20_Msk            (0x100000UL)              /*!< PINVAL20 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL21_Pos            (21UL)                    /*!< PINVAL21 (Bit 21)                                     */
#define GPIO_PIN0_PINVAL21_Msk            (0x200000UL)              /*!< PINVAL21 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL22_Pos            (22UL)                    /*!< PINVAL22 (Bit 22)                                     */
#define GPIO_PIN0_PINVAL22_Msk            (0x400000UL)              /*!< PINVAL22 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL23_Pos            (23UL)                    /*!< PINVAL23 (Bit 23)                                     */
#define GPIO_PIN0_PINVAL23_Msk            (0x800000UL)              /*!< PINVAL23 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL24_Pos            (24UL)                    /*!< PINVAL24 (Bit 24)                                     */
#define GPIO_PIN0_PINVAL24_Msk            (0x1000000UL)             /*!< PINVAL24 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL25_Pos            (25UL)                    /*!< PINVAL25 (Bit 25)                                     */
#define GPIO_PIN0_PINVAL25_Msk            (0x2000000UL)             /*!< PINVAL25 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL26_Pos            (26UL)                    /*!< PINVAL26 (Bit 26)                                     */
#define GPIO_PIN0_PINVAL26_Msk            (0x4000000UL)             /*!< PINVAL26 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL27_Pos            (27UL)                    /*!< PINVAL27 (Bit 27)                                     */
#define GPIO_PIN0_PINVAL27_Msk            (0x8000000UL)             /*!< PINVAL27 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL28_Pos            (28UL)                    /*!< PINVAL28 (Bit 28)                                     */
#define GPIO_PIN0_PINVAL28_Msk            (0x10000000UL)            /*!< PINVAL28 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL29_Pos            (29UL)                    /*!< PINVAL29 (Bit 29)                                     */
#define GPIO_PIN0_PINVAL29_Msk            (0x20000000UL)            /*!< PINVAL29 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL30_Pos            (30UL)                    /*!< PINVAL30 (Bit 30)                                     */
#define GPIO_PIN0_PINVAL30_Msk            (0x40000000UL)            /*!< PINVAL30 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN0_PINVAL31_Pos            (31UL)                    /*!< PINVAL31 (Bit 31)                                     */
#define GPIO_PIN0_PINVAL31_Msk            (0x80000000UL)            /*!< PINVAL31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  PIN1  ========================================================== */
#define GPIO_PIN1_PINVAL0_Pos             (0UL)                     /*!< PINVAL0 (Bit 0)                                       */
#define GPIO_PIN1_PINVAL0_Msk             (0x1UL)                   /*!< PINVAL0 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL1_Pos             (1UL)                     /*!< PINVAL1 (Bit 1)                                       */
#define GPIO_PIN1_PINVAL1_Msk             (0x2UL)                   /*!< PINVAL1 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL2_Pos             (2UL)                     /*!< PINVAL2 (Bit 2)                                       */
#define GPIO_PIN1_PINVAL2_Msk             (0x4UL)                   /*!< PINVAL2 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL3_Pos             (3UL)                     /*!< PINVAL3 (Bit 3)                                       */
#define GPIO_PIN1_PINVAL3_Msk             (0x8UL)                   /*!< PINVAL3 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL4_Pos             (4UL)                     /*!< PINVAL4 (Bit 4)                                       */
#define GPIO_PIN1_PINVAL4_Msk             (0x10UL)                  /*!< PINVAL4 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL5_Pos             (5UL)                     /*!< PINVAL5 (Bit 5)                                       */
#define GPIO_PIN1_PINVAL5_Msk             (0x20UL)                  /*!< PINVAL5 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL6_Pos             (6UL)                     /*!< PINVAL6 (Bit 6)                                       */
#define GPIO_PIN1_PINVAL6_Msk             (0x40UL)                  /*!< PINVAL6 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL7_Pos             (7UL)                     /*!< PINVAL7 (Bit 7)                                       */
#define GPIO_PIN1_PINVAL7_Msk             (0x80UL)                  /*!< PINVAL7 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL8_Pos             (8UL)                     /*!< PINVAL8 (Bit 8)                                       */
#define GPIO_PIN1_PINVAL8_Msk             (0x100UL)                 /*!< PINVAL8 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN1_PINVAL9_Pos             (9UL)                     /*!< PINVAL9 (Bit 9)                                       */
#define GPIO_PIN1_PINVAL9_Msk             (0x200UL)                 /*!< PINVAL9 (Bitfield-Mask: 0x01)                         */
