lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_PIN1_PINVAL10_Pos            (10UL)                    /*!< PINVAL10 (Bit 10)                                     */
#define GPIO_PIN1_PINVAL10_Msk            (0x400UL)                 /*!< PINVAL10 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL11_Pos            (11UL)                    /*!< PINVAL11 (Bit 11)                                     */
#define GPIO_PIN1_PINVAL11_Msk            (0x800UL)                 /*!< PINVAL11 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL12_Pos            (12UL)                    /*!< PINVAL12 (Bit 12)                                     */
#define GPIO_PIN1_PINVAL12_Msk            (0x1000UL)                /*!< PINVAL12 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL13_Pos            (13UL)                    /*!< PINVAL13 (Bit 13)                                     */
#define GPIO_PIN1_PINVAL13_Msk            (0x2000UL)                /*!< PINVAL13 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL14_Pos            (14UL)                    /*!< PINVAL14 (Bit 14)                                     */
#define GPIO_PIN1_PINVAL14_Msk            (0x4000UL)                /*!< PINVAL14 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL15_Pos            (15UL)                    /*!< PINVAL15 (Bit 15)                                     */
#define GPIO_PIN1_PINVAL15_Msk            (0x8000UL)                /*!< PINVAL15 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL16_Pos            (16UL)                    /*!< PINVAL16 (Bit 16)                                     */
#define GPIO_PIN1_PINVAL16_Msk            (0x10000UL)               /*!< PINVAL16 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL17_Pos            (17UL)                    /*!< PINVAL17 (Bit 17)                                     */
#define GPIO_PIN1_PINVAL17_Msk            (0x20000UL)               /*!< PINVAL17 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL18_Pos            (18UL)                    /*!< PINVAL18 (Bit 18)                                     */
#define GPIO_PIN1_PINVAL18_Msk            (0x40000UL)               /*!< PINVAL18 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL19_Pos            (19UL)                    /*!< PINVAL19 (Bit 19)                                     */
#define GPIO_PIN1_PINVAL19_Msk            (0x80000UL)               /*!< PINVAL19 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL20_Pos            (20UL)                    /*!< PINVAL20 (Bit 20)                                     */
#define GPIO_PIN1_PINVAL20_Msk            (0x100000UL)              /*!< PINVAL20 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL21_Pos            (21UL)                    /*!< PINVAL21 (Bit 21)                                     */
#define GPIO_PIN1_PINVAL21_Msk            (0x200000UL)              /*!< PINVAL21 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL22_Pos            (22UL)                    /*!< PINVAL22 (Bit 22)                                     */
#define GPIO_PIN1_PINVAL22_Msk            (0x400000UL)              /*!< PINVAL22 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL23_Pos            (23UL)                    /*!< PINVAL23 (Bit 23)                                     */
#define GPIO_PIN1_PINVAL23_Msk            (0x800000UL)              /*!< PINVAL23 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL24_Pos            (24UL)                    /*!< PINVAL24 (Bit 24)                                     */
#define GPIO_PIN1_PINVAL24_Msk            (0x1000000UL)             /*!< PINVAL24 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL25_Pos            (25UL)                    /*!< PINVAL25 (Bit 25)                                     */
#define GPIO_PIN1_PINVAL25_Msk            (0x2000000UL)             /*!< PINVAL25 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL26_Pos            (26UL)                    /*!< PINVAL26 (Bit 26)                                     */
#define GPIO_PIN1_PINVAL26_Msk            (0x4000000UL)             /*!< PINVAL26 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL27_Pos            (27UL)                    /*!< PINVAL27 (Bit 27)                                     */
#define GPIO_PIN1_PINVAL27_Msk            (0x8000000UL)             /*!< PINVAL27 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL28_Pos            (28UL)                    /*!< PINVAL28 (Bit 28)                                     */
#define GPIO_PIN1_PINVAL28_Msk            (0x10000000UL)            /*!< PINVAL28 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL29_Pos            (29UL)                    /*!< PINVAL29 (Bit 29)                                     */
#define GPIO_PIN1_PINVAL29_Msk            (0x20000000UL)            /*!< PINVAL29 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL30_Pos            (30UL)                    /*!< PINVAL30 (Bit 30)                                     */
#define GPIO_PIN1_PINVAL30_Msk            (0x40000000UL)            /*!< PINVAL30 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN1_PINVAL31_Pos            (31UL)                    /*!< PINVAL31 (Bit 31)                                     */
#define GPIO_PIN1_PINVAL31_Msk            (0x80000000UL)            /*!< PINVAL31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  PIN2  ========================================================== */
#define GPIO_PIN2_PINVAL0_Pos             (0UL)                     /*!< PINVAL0 (Bit 0)                                       */
#define GPIO_PIN2_PINVAL0_Msk             (0x1UL)                   /*!< PINVAL0 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL1_Pos             (1UL)                     /*!< PINVAL1 (Bit 1)                                       */
#define GPIO_PIN2_PINVAL1_Msk             (0x2UL)                   /*!< PINVAL1 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL2_Pos             (2UL)                     /*!< PINVAL2 (Bit 2)                                       */
#define GPIO_PIN2_PINVAL2_Msk             (0x4UL)                   /*!< PINVAL2 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL3_Pos             (3UL)                     /*!< PINVAL3 (Bit 3)                                       */
#define GPIO_PIN2_PINVAL3_Msk             (0x8UL)                   /*!< PINVAL3 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL4_Pos             (4UL)                     /*!< PINVAL4 (Bit 4)                                       */
#define GPIO_PIN2_PINVAL4_Msk             (0x10UL)                  /*!< PINVAL4 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL5_Pos             (5UL)                     /*!< PINVAL5 (Bit 5)                                       */
#define GPIO_PIN2_PINVAL5_Msk             (0x20UL)                  /*!< PINVAL5 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL6_Pos             (6UL)                     /*!< PINVAL6 (Bit 6)                                       */
#define GPIO_PIN2_PINVAL6_Msk             (0x40UL)                  /*!< PINVAL6 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL7_Pos             (7UL)                     /*!< PINVAL7 (Bit 7)                                       */
#define GPIO_PIN2_PINVAL7_Msk             (0x80UL)                  /*!< PINVAL7 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL8_Pos             (8UL)                     /*!< PINVAL8 (Bit 8)                                       */
#define GPIO_PIN2_PINVAL8_Msk             (0x100UL)                 /*!< PINVAL8 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL9_Pos             (9UL)                     /*!< PINVAL9 (Bit 9)                                       */
#define GPIO_PIN2_PINVAL9_Msk             (0x200UL)                 /*!< PINVAL9 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN2_PINVAL10_Pos            (10UL)                    /*!< PINVAL10 (Bit 10)                                     */
#define GPIO_PIN2_PINVAL10_Msk            (0x400UL)                 /*!< PINVAL10 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL11_Pos            (11UL)                    /*!< PINVAL11 (Bit 11)                                     */
#define GPIO_PIN2_PINVAL11_Msk            (0x800UL)                 /*!< PINVAL11 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL12_Pos            (12UL)                    /*!< PINVAL12 (Bit 12)                                     */
#define GPIO_PIN2_PINVAL12_Msk            (0x1000UL)                /*!< PINVAL12 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL13_Pos            (13UL)                    /*!< PINVAL13 (Bit 13)                                     */
#define GPIO_PIN2_PINVAL13_Msk            (0x2000UL)                /*!< PINVAL13 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL14_Pos            (14UL)                    /*!< PINVAL14 (Bit 14)                                     */
#define GPIO_PIN2_PINVAL14_Msk            (0x4000UL)                /*!< PINVAL14 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL15_Pos            (15UL)                    /*!< PINVAL15 (Bit 15)                                     */
#define GPIO_PIN2_PINVAL15_Msk            (0x8000UL)                /*!< PINVAL15 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL16_Pos            (16UL)                    /*!< PINVAL16 (Bit 16)                                     */
#define GPIO_PIN2_PINVAL16_Msk            (0x10000UL)               /*!< PINVAL16 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL17_Pos            (17UL)                    /*!< PINVAL17 (Bit 17)                                     */
#define GPIO_PIN2_PINVAL17_Msk            (0x20000UL)               /*!< PINVAL17 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL18_Pos            (18UL)                    /*!< PINVAL18 (Bit 18)                                     */
#define GPIO_PIN2_PINVAL18_Msk            (0x40000UL)               /*!< PINVAL18 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL19_Pos            (19UL)                    /*!< PINVAL19 (Bit 19)                                     */
#define GPIO_PIN2_PINVAL19_Msk            (0x80000UL)               /*!< PINVAL19 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL20_Pos            (20UL)                    /*!< PINVAL20 (Bit 20)                                     */
#define GPIO_PIN2_PINVAL20_Msk            (0x100000UL)              /*!< PINVAL20 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL21_Pos            (21UL)                    /*!< PINVAL21 (Bit 21)                                     */
#define GPIO_PIN2_PINVAL21_Msk            (0x200000UL)              /*!< PINVAL21 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL22_Pos            (22UL)                    /*!< PINVAL22 (Bit 22)                                     */
#define GPIO_PIN2_PINVAL22_Msk            (0x400000UL)              /*!< PINVAL22 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL23_Pos            (23UL)                    /*!< PINVAL23 (Bit 23)                                     */
#define GPIO_PIN2_PINVAL23_Msk            (0x800000UL)              /*!< PINVAL23 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL24_Pos            (24UL)                    /*!< PINVAL24 (Bit 24)                                     */
#define GPIO_PIN2_PINVAL24_Msk            (0x1000000UL)             /*!< PINVAL24 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL25_Pos            (25UL)                    /*!< PINVAL25 (Bit 25)                                     */
#define GPIO_PIN2_PINVAL25_Msk            (0x2000000UL)             /*!< PINVAL25 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL26_Pos            (26UL)                    /*!< PINVAL26 (Bit 26)                                     */
#define GPIO_PIN2_PINVAL26_Msk            (0x4000000UL)             /*!< PINVAL26 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL27_Pos            (27UL)                    /*!< PINVAL27 (Bit 27)                                     */
#define GPIO_PIN2_PINVAL27_Msk            (0x8000000UL)             /*!< PINVAL27 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL28_Pos            (28UL)                    /*!< PINVAL28 (Bit 28)                                     */
#define GPIO_PIN2_PINVAL28_Msk            (0x10000000UL)            /*!< PINVAL28 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL29_Pos            (29UL)                    /*!< PINVAL29 (Bit 29)                                     */
#define GPIO_PIN2_PINVAL29_Msk            (0x20000000UL)            /*!< PINVAL29 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL30_Pos            (30UL)                    /*!< PINVAL30 (Bit 30)                                     */
#define GPIO_PIN2_PINVAL30_Msk            (0x40000000UL)            /*!< PINVAL30 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN2_PINVAL31_Pos            (31UL)                    /*!< PINVAL31 (Bit 31)                                     */
#define GPIO_PIN2_PINVAL31_Msk            (0x80000000UL)            /*!< PINVAL31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  PIN3  ========================================================== */
#define GPIO_PIN3_PINVAL0_Pos             (0UL)                     /*!< PINVAL0 (Bit 0)                                       */
#define GPIO_PIN3_PINVAL0_Msk             (0x1UL)                   /*!< PINVAL0 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL1_Pos             (1UL)                     /*!< PINVAL1 (Bit 1)                                       */
#define GPIO_PIN3_PINVAL1_Msk             (0x2UL)                   /*!< PINVAL1 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL2_Pos             (2UL)                     /*!< PINVAL2 (Bit 2)                                       */
#define GPIO_PIN3_PINVAL2_Msk             (0x4UL)                   /*!< PINVAL2 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL3_Pos             (3UL)                     /*!< PINVAL3 (Bit 3)                                       */
#define GPIO_PIN3_PINVAL3_Msk             (0x8UL)                   /*!< PINVAL3 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL4_Pos             (4UL)                     /*!< PINVAL4 (Bit 4)                                       */
#define GPIO_PIN3_PINVAL4_Msk             (0x10UL)                  /*!< PINVAL4 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL5_Pos             (5UL)                     /*!< PINVAL5 (Bit 5)                                       */
#define GPIO_PIN3_PINVAL5_Msk             (0x20UL)                  /*!< PINVAL5 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL6_Pos             (6UL)                     /*!< PINVAL6 (Bit 6)                                       */
#define GPIO_PIN3_PINVAL6_Msk             (0x40UL)                  /*!< PINVAL6 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL7_Pos             (7UL)                     /*!< PINVAL7 (Bit 7)                                       */
#define GPIO_PIN3_PINVAL7_Msk             (0x80UL)                  /*!< PINVAL7 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL8_Pos             (8UL)                     /*!< PINVAL8 (Bit 8)                                       */
#define GPIO_PIN3_PINVAL8_Msk             (0x100UL)                 /*!< PINVAL8 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL9_Pos             (9UL)                     /*!< PINVAL9 (Bit 9)                                       */
#define GPIO_PIN3_PINVAL9_Msk             (0x200UL)                 /*!< PINVAL9 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN3_PINVAL10_Pos            (10UL)                    /*!< PINVAL10 (Bit 10)                                     */
#define GPIO_PIN3_PINVAL10_Msk            (0x400UL)                 /*!< PINVAL10 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL11_Pos            (11UL)                    /*!< PINVAL11 (Bit 11)                                     */
#define GPIO_PIN3_PINVAL11_Msk            (0x800UL)                 /*!< PINVAL11 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL12_Pos            (12UL)                    /*!< PINVAL12 (Bit 12)                                     */
#define GPIO_PIN3_PINVAL12_Msk            (0x1000UL)                /*!< PINVAL12 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL13_Pos            (13UL)                    /*!< PINVAL13 (Bit 13)                                     */
#define GPIO_PIN3_PINVAL13_Msk            (0x2000UL)                /*!< PINVAL13 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL14_Pos            (14UL)                    /*!< PINVAL14 (Bit 14)                                     */
#define GPIO_PIN3_PINVAL14_Msk            (0x4000UL)                /*!< PINVAL14 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL15_Pos            (15UL)                    /*!< PINVAL15 (Bit 15)                                     */
#define GPIO_PIN3_PINVAL15_Msk            (0x8000UL)                /*!< PINVAL15 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL16_Pos            (16UL)                    /*!< PINVAL16 (Bit 16)                                     */
#define GPIO_PIN3_PINVAL16_Msk            (0x10000UL)               /*!< PINVAL16 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL17_Pos            (17UL)                    /*!< PINVAL17 (Bit 17)                                     */
#define GPIO_PIN3_PINVAL17_Msk            (0x20000UL)               /*!< PINVAL17 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL18_Pos            (18UL)                    /*!< PINVAL18 (Bit 18)                                     */
#define GPIO_PIN3_PINVAL18_Msk            (0x40000UL)               /*!< PINVAL18 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL19_Pos            (19UL)                    /*!< PINVAL19 (Bit 19)                                     */
#define GPIO_PIN3_PINVAL19_Msk            (0x80000UL)               /*!< PINVAL19 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL20_Pos            (20UL)                    /*!< PINVAL20 (Bit 20)                                     */
#define GPIO_PIN3_PINVAL20_Msk            (0x100000UL)              /*!< PINVAL20 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL21_Pos            (21UL)                    /*!< PINVAL21 (Bit 21)                                     */
#define GPIO_PIN3_PINVAL21_Msk            (0x200000UL)              /*!< PINVAL21 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL22_Pos            (22UL)                    /*!< PINVAL22 (Bit 22)                                     */
#define GPIO_PIN3_PINVAL22_Msk            (0x400000UL)              /*!< PINVAL22 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL23_Pos            (23UL)                    /*!< PINVAL23 (Bit 23)                                     */
#define GPIO_PIN3_PINVAL23_Msk            (0x800000UL)              /*!< PINVAL23 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL24_Pos            (24UL)                    /*!< PINVAL24 (Bit 24)                                     */
#define GPIO_PIN3_PINVAL24_Msk            (0x1000000UL)             /*!< PINVAL24 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL25_Pos            (25UL)                    /*!< PINVAL25 (Bit 25)                                     */
#define GPIO_PIN3_PINVAL25_Msk            (0x2000000UL)             /*!< PINVAL25 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL26_Pos            (26UL)                    /*!< PINVAL26 (Bit 26)                                     */
#define GPIO_PIN3_PINVAL26_Msk            (0x4000000UL)             /*!< PINVAL26 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL27_Pos            (27UL)                    /*!< PINVAL27 (Bit 27)                                     */
#define GPIO_PIN3_PINVAL27_Msk            (0x8000000UL)             /*!< PINVAL27 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL28_Pos            (28UL)                    /*!< PINVAL28 (Bit 28)                                     */
#define GPIO_PIN3_PINVAL28_Msk            (0x10000000UL)            /*!< PINVAL28 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL29_Pos            (29UL)                    /*!< PINVAL29 (Bit 29)                                     */
#define GPIO_PIN3_PINVAL29_Msk            (0x20000000UL)            /*!< PINVAL29 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL30_Pos            (30UL)                    /*!< PINVAL30 (Bit 30)                                     */
#define GPIO_PIN3_PINVAL30_Msk            (0x40000000UL)            /*!< PINVAL30 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN3_PINVAL31_Pos            (31UL)                    /*!< PINVAL31 (Bit 31)                                     */
#define GPIO_PIN3_PINVAL31_Msk            (0x80000000UL)            /*!< PINVAL31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  PIN4  ========================================================== */
#define GPIO_PIN4_PINVAL0_Pos             (0UL)                     /*!< PINVAL0 (Bit 0)                                       */
#define GPIO_PIN4_PINVAL0_Msk             (0x1UL)                   /*!< PINVAL0 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL1_Pos             (1UL)                     /*!< PINVAL1 (Bit 1)                                       */
#define GPIO_PIN4_PINVAL1_Msk             (0x2UL)                   /*!< PINVAL1 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL2_Pos             (2UL)                     /*!< PINVAL2 (Bit 2)                                       */
#define GPIO_PIN4_PINVAL2_Msk             (0x4UL)                   /*!< PINVAL2 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL3_Pos             (3UL)                     /*!< PINVAL3 (Bit 3)                                       */
#define GPIO_PIN4_PINVAL3_Msk             (0x8UL)                   /*!< PINVAL3 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL4_Pos             (4UL)                     /*!< PINVAL4 (Bit 4)                                       */
