lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_PIN4_PINVAL4_Msk             (0x10UL)                  /*!< PINVAL4 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL5_Pos             (5UL)                     /*!< PINVAL5 (Bit 5)                                       */
#define GPIO_PIN4_PINVAL5_Msk             (0x20UL)                  /*!< PINVAL5 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL6_Pos             (6UL)                     /*!< PINVAL6 (Bit 6)                                       */
#define GPIO_PIN4_PINVAL6_Msk             (0x40UL)                  /*!< PINVAL6 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL7_Pos             (7UL)                     /*!< PINVAL7 (Bit 7)                                       */
#define GPIO_PIN4_PINVAL7_Msk             (0x80UL)                  /*!< PINVAL7 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL8_Pos             (8UL)                     /*!< PINVAL8 (Bit 8)                                       */
#define GPIO_PIN4_PINVAL8_Msk             (0x100UL)                 /*!< PINVAL8 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL9_Pos             (9UL)                     /*!< PINVAL9 (Bit 9)                                       */
#define GPIO_PIN4_PINVAL9_Msk             (0x200UL)                 /*!< PINVAL9 (Bitfield-Mask: 0x01)                         */
#define GPIO_PIN4_PINVAL10_Pos            (10UL)                    /*!< PINVAL10 (Bit 10)                                     */
#define GPIO_PIN4_PINVAL10_Msk            (0x400UL)                 /*!< PINVAL10 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL11_Pos            (11UL)                    /*!< PINVAL11 (Bit 11)                                     */
#define GPIO_PIN4_PINVAL11_Msk            (0x800UL)                 /*!< PINVAL11 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL12_Pos            (12UL)                    /*!< PINVAL12 (Bit 12)                                     */
#define GPIO_PIN4_PINVAL12_Msk            (0x1000UL)                /*!< PINVAL12 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL13_Pos            (13UL)                    /*!< PINVAL13 (Bit 13)                                     */
#define GPIO_PIN4_PINVAL13_Msk            (0x2000UL)                /*!< PINVAL13 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL14_Pos            (14UL)                    /*!< PINVAL14 (Bit 14)                                     */
#define GPIO_PIN4_PINVAL14_Msk            (0x4000UL)                /*!< PINVAL14 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL15_Pos            (15UL)                    /*!< PINVAL15 (Bit 15)                                     */
#define GPIO_PIN4_PINVAL15_Msk            (0x8000UL)                /*!< PINVAL15 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL16_Pos            (16UL)                    /*!< PINVAL16 (Bit 16)                                     */
#define GPIO_PIN4_PINVAL16_Msk            (0x10000UL)               /*!< PINVAL16 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL17_Pos            (17UL)                    /*!< PINVAL17 (Bit 17)                                     */
#define GPIO_PIN4_PINVAL17_Msk            (0x20000UL)               /*!< PINVAL17 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL18_Pos            (18UL)                    /*!< PINVAL18 (Bit 18)                                     */
#define GPIO_PIN4_PINVAL18_Msk            (0x40000UL)               /*!< PINVAL18 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL19_Pos            (19UL)                    /*!< PINVAL19 (Bit 19)                                     */
#define GPIO_PIN4_PINVAL19_Msk            (0x80000UL)               /*!< PINVAL19 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL20_Pos            (20UL)                    /*!< PINVAL20 (Bit 20)                                     */
#define GPIO_PIN4_PINVAL20_Msk            (0x100000UL)              /*!< PINVAL20 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL21_Pos            (21UL)                    /*!< PINVAL21 (Bit 21)                                     */
#define GPIO_PIN4_PINVAL21_Msk            (0x200000UL)              /*!< PINVAL21 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL22_Pos            (22UL)                    /*!< PINVAL22 (Bit 22)                                     */
#define GPIO_PIN4_PINVAL22_Msk            (0x400000UL)              /*!< PINVAL22 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL23_Pos            (23UL)                    /*!< PINVAL23 (Bit 23)                                     */
#define GPIO_PIN4_PINVAL23_Msk            (0x800000UL)              /*!< PINVAL23 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL24_Pos            (24UL)                    /*!< PINVAL24 (Bit 24)                                     */
#define GPIO_PIN4_PINVAL24_Msk            (0x1000000UL)             /*!< PINVAL24 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL25_Pos            (25UL)                    /*!< PINVAL25 (Bit 25)                                     */
#define GPIO_PIN4_PINVAL25_Msk            (0x2000000UL)             /*!< PINVAL25 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL26_Pos            (26UL)                    /*!< PINVAL26 (Bit 26)                                     */
#define GPIO_PIN4_PINVAL26_Msk            (0x4000000UL)             /*!< PINVAL26 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL27_Pos            (27UL)                    /*!< PINVAL27 (Bit 27)                                     */
#define GPIO_PIN4_PINVAL27_Msk            (0x8000000UL)             /*!< PINVAL27 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL28_Pos            (28UL)                    /*!< PINVAL28 (Bit 28)                                     */
#define GPIO_PIN4_PINVAL28_Msk            (0x10000000UL)            /*!< PINVAL28 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL29_Pos            (29UL)                    /*!< PINVAL29 (Bit 29)                                     */
#define GPIO_PIN4_PINVAL29_Msk            (0x20000000UL)            /*!< PINVAL29 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL30_Pos            (30UL)                    /*!< PINVAL30 (Bit 30)                                     */
#define GPIO_PIN4_PINVAL30_Msk            (0x40000000UL)            /*!< PINVAL30 (Bitfield-Mask: 0x01)                        */
#define GPIO_PIN4_PINVAL31_Pos            (31UL)                    /*!< PINVAL31 (Bit 31)                                     */
#define GPIO_PIN4_PINVAL31_Msk            (0x80000000UL)            /*!< PINVAL31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SET0  ========================================================== */
#define GPIO_SET0_PINSET0_Pos             (0UL)                     /*!< PINSET0 (Bit 0)                                       */
#define GPIO_SET0_PINSET0_Msk             (0x1UL)                   /*!< PINSET0 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET1_Pos             (1UL)                     /*!< PINSET1 (Bit 1)                                       */
#define GPIO_SET0_PINSET1_Msk             (0x2UL)                   /*!< PINSET1 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET2_Pos             (2UL)                     /*!< PINSET2 (Bit 2)                                       */
#define GPIO_SET0_PINSET2_Msk             (0x4UL)                   /*!< PINSET2 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET3_Pos             (3UL)                     /*!< PINSET3 (Bit 3)                                       */
#define GPIO_SET0_PINSET3_Msk             (0x8UL)                   /*!< PINSET3 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET4_Pos             (4UL)                     /*!< PINSET4 (Bit 4)                                       */
#define GPIO_SET0_PINSET4_Msk             (0x10UL)                  /*!< PINSET4 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET5_Pos             (5UL)                     /*!< PINSET5 (Bit 5)                                       */
#define GPIO_SET0_PINSET5_Msk             (0x20UL)                  /*!< PINSET5 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET6_Pos             (6UL)                     /*!< PINSET6 (Bit 6)                                       */
#define GPIO_SET0_PINSET6_Msk             (0x40UL)                  /*!< PINSET6 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET7_Pos             (7UL)                     /*!< PINSET7 (Bit 7)                                       */
#define GPIO_SET0_PINSET7_Msk             (0x80UL)                  /*!< PINSET7 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET8_Pos             (8UL)                     /*!< PINSET8 (Bit 8)                                       */
#define GPIO_SET0_PINSET8_Msk             (0x100UL)                 /*!< PINSET8 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET9_Pos             (9UL)                     /*!< PINSET9 (Bit 9)                                       */
#define GPIO_SET0_PINSET9_Msk             (0x200UL)                 /*!< PINSET9 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET0_PINSET10_Pos            (10UL)                    /*!< PINSET10 (Bit 10)                                     */
#define GPIO_SET0_PINSET10_Msk            (0x400UL)                 /*!< PINSET10 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET11_Pos            (11UL)                    /*!< PINSET11 (Bit 11)                                     */
#define GPIO_SET0_PINSET11_Msk            (0x800UL)                 /*!< PINSET11 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET12_Pos            (12UL)                    /*!< PINSET12 (Bit 12)                                     */
#define GPIO_SET0_PINSET12_Msk            (0x1000UL)                /*!< PINSET12 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET13_Pos            (13UL)                    /*!< PINSET13 (Bit 13)                                     */
#define GPIO_SET0_PINSET13_Msk            (0x2000UL)                /*!< PINSET13 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET14_Pos            (14UL)                    /*!< PINSET14 (Bit 14)                                     */
#define GPIO_SET0_PINSET14_Msk            (0x4000UL)                /*!< PINSET14 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET15_Pos            (15UL)                    /*!< PINSET15 (Bit 15)                                     */
#define GPIO_SET0_PINSET15_Msk            (0x8000UL)                /*!< PINSET15 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET16_Pos            (16UL)                    /*!< PINSET16 (Bit 16)                                     */
#define GPIO_SET0_PINSET16_Msk            (0x10000UL)               /*!< PINSET16 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET17_Pos            (17UL)                    /*!< PINSET17 (Bit 17)                                     */
#define GPIO_SET0_PINSET17_Msk            (0x20000UL)               /*!< PINSET17 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET18_Pos            (18UL)                    /*!< PINSET18 (Bit 18)                                     */
#define GPIO_SET0_PINSET18_Msk            (0x40000UL)               /*!< PINSET18 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET19_Pos            (19UL)                    /*!< PINSET19 (Bit 19)                                     */
#define GPIO_SET0_PINSET19_Msk            (0x80000UL)               /*!< PINSET19 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET20_Pos            (20UL)                    /*!< PINSET20 (Bit 20)                                     */
#define GPIO_SET0_PINSET20_Msk            (0x100000UL)              /*!< PINSET20 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET21_Pos            (21UL)                    /*!< PINSET21 (Bit 21)                                     */
#define GPIO_SET0_PINSET21_Msk            (0x200000UL)              /*!< PINSET21 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET22_Pos            (22UL)                    /*!< PINSET22 (Bit 22)                                     */
#define GPIO_SET0_PINSET22_Msk            (0x400000UL)              /*!< PINSET22 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET23_Pos            (23UL)                    /*!< PINSET23 (Bit 23)                                     */
#define GPIO_SET0_PINSET23_Msk            (0x800000UL)              /*!< PINSET23 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET24_Pos            (24UL)                    /*!< PINSET24 (Bit 24)                                     */
#define GPIO_SET0_PINSET24_Msk            (0x1000000UL)             /*!< PINSET24 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET25_Pos            (25UL)                    /*!< PINSET25 (Bit 25)                                     */
#define GPIO_SET0_PINSET25_Msk            (0x2000000UL)             /*!< PINSET25 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET26_Pos            (26UL)                    /*!< PINSET26 (Bit 26)                                     */
#define GPIO_SET0_PINSET26_Msk            (0x4000000UL)             /*!< PINSET26 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET27_Pos            (27UL)                    /*!< PINSET27 (Bit 27)                                     */
#define GPIO_SET0_PINSET27_Msk            (0x8000000UL)             /*!< PINSET27 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET28_Pos            (28UL)                    /*!< PINSET28 (Bit 28)                                     */
#define GPIO_SET0_PINSET28_Msk            (0x10000000UL)            /*!< PINSET28 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET29_Pos            (29UL)                    /*!< PINSET29 (Bit 29)                                     */
#define GPIO_SET0_PINSET29_Msk            (0x20000000UL)            /*!< PINSET29 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET30_Pos            (30UL)                    /*!< PINSET30 (Bit 30)                                     */
#define GPIO_SET0_PINSET30_Msk            (0x40000000UL)            /*!< PINSET30 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET0_PINSET31_Pos            (31UL)                    /*!< PINSET31 (Bit 31)                                     */
#define GPIO_SET0_PINSET31_Msk            (0x80000000UL)            /*!< PINSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SET1  ========================================================== */
#define GPIO_SET1_PINSET0_Pos             (0UL)                     /*!< PINSET0 (Bit 0)                                       */
#define GPIO_SET1_PINSET0_Msk             (0x1UL)                   /*!< PINSET0 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET1_Pos             (1UL)                     /*!< PINSET1 (Bit 1)                                       */
#define GPIO_SET1_PINSET1_Msk             (0x2UL)                   /*!< PINSET1 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET2_Pos             (2UL)                     /*!< PINSET2 (Bit 2)                                       */
#define GPIO_SET1_PINSET2_Msk             (0x4UL)                   /*!< PINSET2 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET3_Pos             (3UL)                     /*!< PINSET3 (Bit 3)                                       */
#define GPIO_SET1_PINSET3_Msk             (0x8UL)                   /*!< PINSET3 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET4_Pos             (4UL)                     /*!< PINSET4 (Bit 4)                                       */
#define GPIO_SET1_PINSET4_Msk             (0x10UL)                  /*!< PINSET4 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET5_Pos             (5UL)                     /*!< PINSET5 (Bit 5)                                       */
#define GPIO_SET1_PINSET5_Msk             (0x20UL)                  /*!< PINSET5 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET6_Pos             (6UL)                     /*!< PINSET6 (Bit 6)                                       */
#define GPIO_SET1_PINSET6_Msk             (0x40UL)                  /*!< PINSET6 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET7_Pos             (7UL)                     /*!< PINSET7 (Bit 7)                                       */
#define GPIO_SET1_PINSET7_Msk             (0x80UL)                  /*!< PINSET7 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET8_Pos             (8UL)                     /*!< PINSET8 (Bit 8)                                       */
#define GPIO_SET1_PINSET8_Msk             (0x100UL)                 /*!< PINSET8 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET9_Pos             (9UL)                     /*!< PINSET9 (Bit 9)                                       */
#define GPIO_SET1_PINSET9_Msk             (0x200UL)                 /*!< PINSET9 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET1_PINSET10_Pos            (10UL)                    /*!< PINSET10 (Bit 10)                                     */
#define GPIO_SET1_PINSET10_Msk            (0x400UL)                 /*!< PINSET10 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET11_Pos            (11UL)                    /*!< PINSET11 (Bit 11)                                     */
#define GPIO_SET1_PINSET11_Msk            (0x800UL)                 /*!< PINSET11 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET12_Pos            (12UL)                    /*!< PINSET12 (Bit 12)                                     */
#define GPIO_SET1_PINSET12_Msk            (0x1000UL)                /*!< PINSET12 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET13_Pos            (13UL)                    /*!< PINSET13 (Bit 13)                                     */
#define GPIO_SET1_PINSET13_Msk            (0x2000UL)                /*!< PINSET13 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET14_Pos            (14UL)                    /*!< PINSET14 (Bit 14)                                     */
#define GPIO_SET1_PINSET14_Msk            (0x4000UL)                /*!< PINSET14 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET15_Pos            (15UL)                    /*!< PINSET15 (Bit 15)                                     */
#define GPIO_SET1_PINSET15_Msk            (0x8000UL)                /*!< PINSET15 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET16_Pos            (16UL)                    /*!< PINSET16 (Bit 16)                                     */
#define GPIO_SET1_PINSET16_Msk            (0x10000UL)               /*!< PINSET16 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET17_Pos            (17UL)                    /*!< PINSET17 (Bit 17)                                     */
#define GPIO_SET1_PINSET17_Msk            (0x20000UL)               /*!< PINSET17 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET18_Pos            (18UL)                    /*!< PINSET18 (Bit 18)                                     */
#define GPIO_SET1_PINSET18_Msk            (0x40000UL)               /*!< PINSET18 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET19_Pos            (19UL)                    /*!< PINSET19 (Bit 19)                                     */
#define GPIO_SET1_PINSET19_Msk            (0x80000UL)               /*!< PINSET19 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET20_Pos            (20UL)                    /*!< PINSET20 (Bit 20)                                     */
#define GPIO_SET1_PINSET20_Msk            (0x100000UL)              /*!< PINSET20 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET21_Pos            (21UL)                    /*!< PINSET21 (Bit 21)                                     */
#define GPIO_SET1_PINSET21_Msk            (0x200000UL)              /*!< PINSET21 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET22_Pos            (22UL)                    /*!< PINSET22 (Bit 22)                                     */
#define GPIO_SET1_PINSET22_Msk            (0x400000UL)              /*!< PINSET22 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET23_Pos            (23UL)                    /*!< PINSET23 (Bit 23)                                     */
#define GPIO_SET1_PINSET23_Msk            (0x800000UL)              /*!< PINSET23 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET24_Pos            (24UL)                    /*!< PINSET24 (Bit 24)                                     */
#define GPIO_SET1_PINSET24_Msk            (0x1000000UL)             /*!< PINSET24 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET25_Pos            (25UL)                    /*!< PINSET25 (Bit 25)                                     */
#define GPIO_SET1_PINSET25_Msk            (0x2000000UL)             /*!< PINSET25 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET26_Pos            (26UL)                    /*!< PINSET26 (Bit 26)                                     */
#define GPIO_SET1_PINSET26_Msk            (0x4000000UL)             /*!< PINSET26 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET27_Pos            (27UL)                    /*!< PINSET27 (Bit 27)                                     */
#define GPIO_SET1_PINSET27_Msk            (0x8000000UL)             /*!< PINSET27 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET28_Pos            (28UL)                    /*!< PINSET28 (Bit 28)                                     */
#define GPIO_SET1_PINSET28_Msk            (0x10000000UL)            /*!< PINSET28 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET29_Pos            (29UL)                    /*!< PINSET29 (Bit 29)                                     */
#define GPIO_SET1_PINSET29_Msk            (0x20000000UL)            /*!< PINSET29 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET30_Pos            (30UL)                    /*!< PINSET30 (Bit 30)                                     */
#define GPIO_SET1_PINSET30_Msk            (0x40000000UL)            /*!< PINSET30 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET1_PINSET31_Pos            (31UL)                    /*!< PINSET31 (Bit 31)                                     */
