lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_SET1_PINSET31_Msk            (0x80000000UL)            /*!< PINSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SET2  ========================================================== */
#define GPIO_SET2_PINSET0_Pos             (0UL)                     /*!< PINSET0 (Bit 0)                                       */
#define GPIO_SET2_PINSET0_Msk             (0x1UL)                   /*!< PINSET0 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET1_Pos             (1UL)                     /*!< PINSET1 (Bit 1)                                       */
#define GPIO_SET2_PINSET1_Msk             (0x2UL)                   /*!< PINSET1 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET2_Pos             (2UL)                     /*!< PINSET2 (Bit 2)                                       */
#define GPIO_SET2_PINSET2_Msk             (0x4UL)                   /*!< PINSET2 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET3_Pos             (3UL)                     /*!< PINSET3 (Bit 3)                                       */
#define GPIO_SET2_PINSET3_Msk             (0x8UL)                   /*!< PINSET3 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET4_Pos             (4UL)                     /*!< PINSET4 (Bit 4)                                       */
#define GPIO_SET2_PINSET4_Msk             (0x10UL)                  /*!< PINSET4 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET5_Pos             (5UL)                     /*!< PINSET5 (Bit 5)                                       */
#define GPIO_SET2_PINSET5_Msk             (0x20UL)                  /*!< PINSET5 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET6_Pos             (6UL)                     /*!< PINSET6 (Bit 6)                                       */
#define GPIO_SET2_PINSET6_Msk             (0x40UL)                  /*!< PINSET6 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET7_Pos             (7UL)                     /*!< PINSET7 (Bit 7)                                       */
#define GPIO_SET2_PINSET7_Msk             (0x80UL)                  /*!< PINSET7 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET8_Pos             (8UL)                     /*!< PINSET8 (Bit 8)                                       */
#define GPIO_SET2_PINSET8_Msk             (0x100UL)                 /*!< PINSET8 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET9_Pos             (9UL)                     /*!< PINSET9 (Bit 9)                                       */
#define GPIO_SET2_PINSET9_Msk             (0x200UL)                 /*!< PINSET9 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET2_PINSET10_Pos            (10UL)                    /*!< PINSET10 (Bit 10)                                     */
#define GPIO_SET2_PINSET10_Msk            (0x400UL)                 /*!< PINSET10 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET11_Pos            (11UL)                    /*!< PINSET11 (Bit 11)                                     */
#define GPIO_SET2_PINSET11_Msk            (0x800UL)                 /*!< PINSET11 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET12_Pos            (12UL)                    /*!< PINSET12 (Bit 12)                                     */
#define GPIO_SET2_PINSET12_Msk            (0x1000UL)                /*!< PINSET12 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET13_Pos            (13UL)                    /*!< PINSET13 (Bit 13)                                     */
#define GPIO_SET2_PINSET13_Msk            (0x2000UL)                /*!< PINSET13 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET14_Pos            (14UL)                    /*!< PINSET14 (Bit 14)                                     */
#define GPIO_SET2_PINSET14_Msk            (0x4000UL)                /*!< PINSET14 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET15_Pos            (15UL)                    /*!< PINSET15 (Bit 15)                                     */
#define GPIO_SET2_PINSET15_Msk            (0x8000UL)                /*!< PINSET15 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET16_Pos            (16UL)                    /*!< PINSET16 (Bit 16)                                     */
#define GPIO_SET2_PINSET16_Msk            (0x10000UL)               /*!< PINSET16 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET17_Pos            (17UL)                    /*!< PINSET17 (Bit 17)                                     */
#define GPIO_SET2_PINSET17_Msk            (0x20000UL)               /*!< PINSET17 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET18_Pos            (18UL)                    /*!< PINSET18 (Bit 18)                                     */
#define GPIO_SET2_PINSET18_Msk            (0x40000UL)               /*!< PINSET18 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET19_Pos            (19UL)                    /*!< PINSET19 (Bit 19)                                     */
#define GPIO_SET2_PINSET19_Msk            (0x80000UL)               /*!< PINSET19 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET20_Pos            (20UL)                    /*!< PINSET20 (Bit 20)                                     */
#define GPIO_SET2_PINSET20_Msk            (0x100000UL)              /*!< PINSET20 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET21_Pos            (21UL)                    /*!< PINSET21 (Bit 21)                                     */
#define GPIO_SET2_PINSET21_Msk            (0x200000UL)              /*!< PINSET21 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET22_Pos            (22UL)                    /*!< PINSET22 (Bit 22)                                     */
#define GPIO_SET2_PINSET22_Msk            (0x400000UL)              /*!< PINSET22 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET23_Pos            (23UL)                    /*!< PINSET23 (Bit 23)                                     */
#define GPIO_SET2_PINSET23_Msk            (0x800000UL)              /*!< PINSET23 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET24_Pos            (24UL)                    /*!< PINSET24 (Bit 24)                                     */
#define GPIO_SET2_PINSET24_Msk            (0x1000000UL)             /*!< PINSET24 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET25_Pos            (25UL)                    /*!< PINSET25 (Bit 25)                                     */
#define GPIO_SET2_PINSET25_Msk            (0x2000000UL)             /*!< PINSET25 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET26_Pos            (26UL)                    /*!< PINSET26 (Bit 26)                                     */
#define GPIO_SET2_PINSET26_Msk            (0x4000000UL)             /*!< PINSET26 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET27_Pos            (27UL)                    /*!< PINSET27 (Bit 27)                                     */
#define GPIO_SET2_PINSET27_Msk            (0x8000000UL)             /*!< PINSET27 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET28_Pos            (28UL)                    /*!< PINSET28 (Bit 28)                                     */
#define GPIO_SET2_PINSET28_Msk            (0x10000000UL)            /*!< PINSET28 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET29_Pos            (29UL)                    /*!< PINSET29 (Bit 29)                                     */
#define GPIO_SET2_PINSET29_Msk            (0x20000000UL)            /*!< PINSET29 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET30_Pos            (30UL)                    /*!< PINSET30 (Bit 30)                                     */
#define GPIO_SET2_PINSET30_Msk            (0x40000000UL)            /*!< PINSET30 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET2_PINSET31_Pos            (31UL)                    /*!< PINSET31 (Bit 31)                                     */
#define GPIO_SET2_PINSET31_Msk            (0x80000000UL)            /*!< PINSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SET3  ========================================================== */
#define GPIO_SET3_PINSET0_Pos             (0UL)                     /*!< PINSET0 (Bit 0)                                       */
#define GPIO_SET3_PINSET0_Msk             (0x1UL)                   /*!< PINSET0 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET1_Pos             (1UL)                     /*!< PINSET1 (Bit 1)                                       */
#define GPIO_SET3_PINSET1_Msk             (0x2UL)                   /*!< PINSET1 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET2_Pos             (2UL)                     /*!< PINSET2 (Bit 2)                                       */
#define GPIO_SET3_PINSET2_Msk             (0x4UL)                   /*!< PINSET2 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET3_Pos             (3UL)                     /*!< PINSET3 (Bit 3)                                       */
#define GPIO_SET3_PINSET3_Msk             (0x8UL)                   /*!< PINSET3 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET4_Pos             (4UL)                     /*!< PINSET4 (Bit 4)                                       */
#define GPIO_SET3_PINSET4_Msk             (0x10UL)                  /*!< PINSET4 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET5_Pos             (5UL)                     /*!< PINSET5 (Bit 5)                                       */
#define GPIO_SET3_PINSET5_Msk             (0x20UL)                  /*!< PINSET5 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET6_Pos             (6UL)                     /*!< PINSET6 (Bit 6)                                       */
#define GPIO_SET3_PINSET6_Msk             (0x40UL)                  /*!< PINSET6 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET7_Pos             (7UL)                     /*!< PINSET7 (Bit 7)                                       */
#define GPIO_SET3_PINSET7_Msk             (0x80UL)                  /*!< PINSET7 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET8_Pos             (8UL)                     /*!< PINSET8 (Bit 8)                                       */
#define GPIO_SET3_PINSET8_Msk             (0x100UL)                 /*!< PINSET8 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET9_Pos             (9UL)                     /*!< PINSET9 (Bit 9)                                       */
#define GPIO_SET3_PINSET9_Msk             (0x200UL)                 /*!< PINSET9 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET3_PINSET10_Pos            (10UL)                    /*!< PINSET10 (Bit 10)                                     */
#define GPIO_SET3_PINSET10_Msk            (0x400UL)                 /*!< PINSET10 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET11_Pos            (11UL)                    /*!< PINSET11 (Bit 11)                                     */
#define GPIO_SET3_PINSET11_Msk            (0x800UL)                 /*!< PINSET11 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET12_Pos            (12UL)                    /*!< PINSET12 (Bit 12)                                     */
#define GPIO_SET3_PINSET12_Msk            (0x1000UL)                /*!< PINSET12 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET13_Pos            (13UL)                    /*!< PINSET13 (Bit 13)                                     */
#define GPIO_SET3_PINSET13_Msk            (0x2000UL)                /*!< PINSET13 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET14_Pos            (14UL)                    /*!< PINSET14 (Bit 14)                                     */
#define GPIO_SET3_PINSET14_Msk            (0x4000UL)                /*!< PINSET14 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET15_Pos            (15UL)                    /*!< PINSET15 (Bit 15)                                     */
#define GPIO_SET3_PINSET15_Msk            (0x8000UL)                /*!< PINSET15 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET16_Pos            (16UL)                    /*!< PINSET16 (Bit 16)                                     */
#define GPIO_SET3_PINSET16_Msk            (0x10000UL)               /*!< PINSET16 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET17_Pos            (17UL)                    /*!< PINSET17 (Bit 17)                                     */
#define GPIO_SET3_PINSET17_Msk            (0x20000UL)               /*!< PINSET17 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET18_Pos            (18UL)                    /*!< PINSET18 (Bit 18)                                     */
#define GPIO_SET3_PINSET18_Msk            (0x40000UL)               /*!< PINSET18 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET19_Pos            (19UL)                    /*!< PINSET19 (Bit 19)                                     */
#define GPIO_SET3_PINSET19_Msk            (0x80000UL)               /*!< PINSET19 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET20_Pos            (20UL)                    /*!< PINSET20 (Bit 20)                                     */
#define GPIO_SET3_PINSET20_Msk            (0x100000UL)              /*!< PINSET20 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET21_Pos            (21UL)                    /*!< PINSET21 (Bit 21)                                     */
#define GPIO_SET3_PINSET21_Msk            (0x200000UL)              /*!< PINSET21 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET22_Pos            (22UL)                    /*!< PINSET22 (Bit 22)                                     */
#define GPIO_SET3_PINSET22_Msk            (0x400000UL)              /*!< PINSET22 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET23_Pos            (23UL)                    /*!< PINSET23 (Bit 23)                                     */
#define GPIO_SET3_PINSET23_Msk            (0x800000UL)              /*!< PINSET23 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET24_Pos            (24UL)                    /*!< PINSET24 (Bit 24)                                     */
#define GPIO_SET3_PINSET24_Msk            (0x1000000UL)             /*!< PINSET24 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET25_Pos            (25UL)                    /*!< PINSET25 (Bit 25)                                     */
#define GPIO_SET3_PINSET25_Msk            (0x2000000UL)             /*!< PINSET25 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET26_Pos            (26UL)                    /*!< PINSET26 (Bit 26)                                     */
#define GPIO_SET3_PINSET26_Msk            (0x4000000UL)             /*!< PINSET26 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET27_Pos            (27UL)                    /*!< PINSET27 (Bit 27)                                     */
#define GPIO_SET3_PINSET27_Msk            (0x8000000UL)             /*!< PINSET27 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET28_Pos            (28UL)                    /*!< PINSET28 (Bit 28)                                     */
#define GPIO_SET3_PINSET28_Msk            (0x10000000UL)            /*!< PINSET28 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET29_Pos            (29UL)                    /*!< PINSET29 (Bit 29)                                     */
#define GPIO_SET3_PINSET29_Msk            (0x20000000UL)            /*!< PINSET29 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET30_Pos            (30UL)                    /*!< PINSET30 (Bit 30)                                     */
#define GPIO_SET3_PINSET30_Msk            (0x40000000UL)            /*!< PINSET30 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET3_PINSET31_Pos            (31UL)                    /*!< PINSET31 (Bit 31)                                     */
#define GPIO_SET3_PINSET31_Msk            (0x80000000UL)            /*!< PINSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SET4  ========================================================== */
#define GPIO_SET4_PINSET0_Pos             (0UL)                     /*!< PINSET0 (Bit 0)                                       */
#define GPIO_SET4_PINSET0_Msk             (0x1UL)                   /*!< PINSET0 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET1_Pos             (1UL)                     /*!< PINSET1 (Bit 1)                                       */
#define GPIO_SET4_PINSET1_Msk             (0x2UL)                   /*!< PINSET1 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET2_Pos             (2UL)                     /*!< PINSET2 (Bit 2)                                       */
#define GPIO_SET4_PINSET2_Msk             (0x4UL)                   /*!< PINSET2 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET3_Pos             (3UL)                     /*!< PINSET3 (Bit 3)                                       */
#define GPIO_SET4_PINSET3_Msk             (0x8UL)                   /*!< PINSET3 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET4_Pos             (4UL)                     /*!< PINSET4 (Bit 4)                                       */
#define GPIO_SET4_PINSET4_Msk             (0x10UL)                  /*!< PINSET4 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET5_Pos             (5UL)                     /*!< PINSET5 (Bit 5)                                       */
#define GPIO_SET4_PINSET5_Msk             (0x20UL)                  /*!< PINSET5 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET6_Pos             (6UL)                     /*!< PINSET6 (Bit 6)                                       */
#define GPIO_SET4_PINSET6_Msk             (0x40UL)                  /*!< PINSET6 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET7_Pos             (7UL)                     /*!< PINSET7 (Bit 7)                                       */
#define GPIO_SET4_PINSET7_Msk             (0x80UL)                  /*!< PINSET7 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET8_Pos             (8UL)                     /*!< PINSET8 (Bit 8)                                       */
#define GPIO_SET4_PINSET8_Msk             (0x100UL)                 /*!< PINSET8 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET9_Pos             (9UL)                     /*!< PINSET9 (Bit 9)                                       */
#define GPIO_SET4_PINSET9_Msk             (0x200UL)                 /*!< PINSET9 (Bitfield-Mask: 0x01)                         */
#define GPIO_SET4_PINSET10_Pos            (10UL)                    /*!< PINSET10 (Bit 10)                                     */
#define GPIO_SET4_PINSET10_Msk            (0x400UL)                 /*!< PINSET10 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET11_Pos            (11UL)                    /*!< PINSET11 (Bit 11)                                     */
#define GPIO_SET4_PINSET11_Msk            (0x800UL)                 /*!< PINSET11 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET12_Pos            (12UL)                    /*!< PINSET12 (Bit 12)                                     */
#define GPIO_SET4_PINSET12_Msk            (0x1000UL)                /*!< PINSET12 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET13_Pos            (13UL)                    /*!< PINSET13 (Bit 13)                                     */
#define GPIO_SET4_PINSET13_Msk            (0x2000UL)                /*!< PINSET13 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET14_Pos            (14UL)                    /*!< PINSET14 (Bit 14)                                     */
#define GPIO_SET4_PINSET14_Msk            (0x4000UL)                /*!< PINSET14 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET15_Pos            (15UL)                    /*!< PINSET15 (Bit 15)                                     */
#define GPIO_SET4_PINSET15_Msk            (0x8000UL)                /*!< PINSET15 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET16_Pos            (16UL)                    /*!< PINSET16 (Bit 16)                                     */
#define GPIO_SET4_PINSET16_Msk            (0x10000UL)               /*!< PINSET16 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET17_Pos            (17UL)                    /*!< PINSET17 (Bit 17)                                     */
#define GPIO_SET4_PINSET17_Msk            (0x20000UL)               /*!< PINSET17 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET18_Pos            (18UL)                    /*!< PINSET18 (Bit 18)                                     */
#define GPIO_SET4_PINSET18_Msk            (0x40000UL)               /*!< PINSET18 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET19_Pos            (19UL)                    /*!< PINSET19 (Bit 19)                                     */
#define GPIO_SET4_PINSET19_Msk            (0x80000UL)               /*!< PINSET19 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET20_Pos            (20UL)                    /*!< PINSET20 (Bit 20)                                     */
#define GPIO_SET4_PINSET20_Msk            (0x100000UL)              /*!< PINSET20 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET21_Pos            (21UL)                    /*!< PINSET21 (Bit 21)                                     */
#define GPIO_SET4_PINSET21_Msk            (0x200000UL)              /*!< PINSET21 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET22_Pos            (22UL)                    /*!< PINSET22 (Bit 22)                                     */
#define GPIO_SET4_PINSET22_Msk            (0x400000UL)              /*!< PINSET22 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET23_Pos            (23UL)                    /*!< PINSET23 (Bit 23)                                     */
#define GPIO_SET4_PINSET23_Msk            (0x800000UL)              /*!< PINSET23 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET24_Pos            (24UL)                    /*!< PINSET24 (Bit 24)                                     */
#define GPIO_SET4_PINSET24_Msk            (0x1000000UL)             /*!< PINSET24 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET25_Pos            (25UL)                    /*!< PINSET25 (Bit 25)                                     */
#define GPIO_SET4_PINSET25_Msk            (0x2000000UL)             /*!< PINSET25 (Bitfield-Mask: 0x01)                        */
