lnls-dig/openMMC/port/ucontroller/nxp/lpc17xx/bootloader/inc/LPC176x5x.h
#define GPIO_SET4_PINSET26_Pos            (26UL)                    /*!< PINSET26 (Bit 26)                                     */
#define GPIO_SET4_PINSET26_Msk            (0x4000000UL)             /*!< PINSET26 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET27_Pos            (27UL)                    /*!< PINSET27 (Bit 27)                                     */
#define GPIO_SET4_PINSET27_Msk            (0x8000000UL)             /*!< PINSET27 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET28_Pos            (28UL)                    /*!< PINSET28 (Bit 28)                                     */
#define GPIO_SET4_PINSET28_Msk            (0x10000000UL)            /*!< PINSET28 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET29_Pos            (29UL)                    /*!< PINSET29 (Bit 29)                                     */
#define GPIO_SET4_PINSET29_Msk            (0x20000000UL)            /*!< PINSET29 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET30_Pos            (30UL)                    /*!< PINSET30 (Bit 30)                                     */
#define GPIO_SET4_PINSET30_Msk            (0x40000000UL)            /*!< PINSET30 (Bitfield-Mask: 0x01)                        */
#define GPIO_SET4_PINSET31_Pos            (31UL)                    /*!< PINSET31 (Bit 31)                                     */
#define GPIO_SET4_PINSET31_Msk            (0x80000000UL)            /*!< PINSET31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  CLR0  ========================================================== */
#define GPIO_CLR0_PINCLR0_Pos             (0UL)                     /*!< PINCLR0 (Bit 0)                                       */
#define GPIO_CLR0_PINCLR0_Msk             (0x1UL)                   /*!< PINCLR0 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR1_Pos             (1UL)                     /*!< PINCLR1 (Bit 1)                                       */
#define GPIO_CLR0_PINCLR1_Msk             (0x2UL)                   /*!< PINCLR1 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR2_Pos             (2UL)                     /*!< PINCLR2 (Bit 2)                                       */
#define GPIO_CLR0_PINCLR2_Msk             (0x4UL)                   /*!< PINCLR2 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR3_Pos             (3UL)                     /*!< PINCLR3 (Bit 3)                                       */
#define GPIO_CLR0_PINCLR3_Msk             (0x8UL)                   /*!< PINCLR3 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR4_Pos             (4UL)                     /*!< PINCLR4 (Bit 4)                                       */
#define GPIO_CLR0_PINCLR4_Msk             (0x10UL)                  /*!< PINCLR4 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR5_Pos             (5UL)                     /*!< PINCLR5 (Bit 5)                                       */
#define GPIO_CLR0_PINCLR5_Msk             (0x20UL)                  /*!< PINCLR5 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR6_Pos             (6UL)                     /*!< PINCLR6 (Bit 6)                                       */
#define GPIO_CLR0_PINCLR6_Msk             (0x40UL)                  /*!< PINCLR6 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR7_Pos             (7UL)                     /*!< PINCLR7 (Bit 7)                                       */
#define GPIO_CLR0_PINCLR7_Msk             (0x80UL)                  /*!< PINCLR7 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR8_Pos             (8UL)                     /*!< PINCLR8 (Bit 8)                                       */
#define GPIO_CLR0_PINCLR8_Msk             (0x100UL)                 /*!< PINCLR8 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR9_Pos             (9UL)                     /*!< PINCLR9 (Bit 9)                                       */
#define GPIO_CLR0_PINCLR9_Msk             (0x200UL)                 /*!< PINCLR9 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR0_PINCLR10_Pos            (10UL)                    /*!< PINCLR10 (Bit 10)                                     */
#define GPIO_CLR0_PINCLR10_Msk            (0x400UL)                 /*!< PINCLR10 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR11_Pos            (11UL)                    /*!< PINCLR11 (Bit 11)                                     */
#define GPIO_CLR0_PINCLR11_Msk            (0x800UL)                 /*!< PINCLR11 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR12_Pos            (12UL)                    /*!< PINCLR12 (Bit 12)                                     */
#define GPIO_CLR0_PINCLR12_Msk            (0x1000UL)                /*!< PINCLR12 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR13_Pos            (13UL)                    /*!< PINCLR13 (Bit 13)                                     */
#define GPIO_CLR0_PINCLR13_Msk            (0x2000UL)                /*!< PINCLR13 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR14_Pos            (14UL)                    /*!< PINCLR14 (Bit 14)                                     */
#define GPIO_CLR0_PINCLR14_Msk            (0x4000UL)                /*!< PINCLR14 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR15_Pos            (15UL)                    /*!< PINCLR15 (Bit 15)                                     */
#define GPIO_CLR0_PINCLR15_Msk            (0x8000UL)                /*!< PINCLR15 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR16_Pos            (16UL)                    /*!< PINCLR16 (Bit 16)                                     */
#define GPIO_CLR0_PINCLR16_Msk            (0x10000UL)               /*!< PINCLR16 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR17_Pos            (17UL)                    /*!< PINCLR17 (Bit 17)                                     */
#define GPIO_CLR0_PINCLR17_Msk            (0x20000UL)               /*!< PINCLR17 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR18_Pos            (18UL)                    /*!< PINCLR18 (Bit 18)                                     */
#define GPIO_CLR0_PINCLR18_Msk            (0x40000UL)               /*!< PINCLR18 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR19_Pos            (19UL)                    /*!< PINCLR19 (Bit 19)                                     */
#define GPIO_CLR0_PINCLR19_Msk            (0x80000UL)               /*!< PINCLR19 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR20_Pos            (20UL)                    /*!< PINCLR20 (Bit 20)                                     */
#define GPIO_CLR0_PINCLR20_Msk            (0x100000UL)              /*!< PINCLR20 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR21_Pos            (21UL)                    /*!< PINCLR21 (Bit 21)                                     */
#define GPIO_CLR0_PINCLR21_Msk            (0x200000UL)              /*!< PINCLR21 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR22_Pos            (22UL)                    /*!< PINCLR22 (Bit 22)                                     */
#define GPIO_CLR0_PINCLR22_Msk            (0x400000UL)              /*!< PINCLR22 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR23_Pos            (23UL)                    /*!< PINCLR23 (Bit 23)                                     */
#define GPIO_CLR0_PINCLR23_Msk            (0x800000UL)              /*!< PINCLR23 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR24_Pos            (24UL)                    /*!< PINCLR24 (Bit 24)                                     */
#define GPIO_CLR0_PINCLR24_Msk            (0x1000000UL)             /*!< PINCLR24 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR25_Pos            (25UL)                    /*!< PINCLR25 (Bit 25)                                     */
#define GPIO_CLR0_PINCLR25_Msk            (0x2000000UL)             /*!< PINCLR25 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR26_Pos            (26UL)                    /*!< PINCLR26 (Bit 26)                                     */
#define GPIO_CLR0_PINCLR26_Msk            (0x4000000UL)             /*!< PINCLR26 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR27_Pos            (27UL)                    /*!< PINCLR27 (Bit 27)                                     */
#define GPIO_CLR0_PINCLR27_Msk            (0x8000000UL)             /*!< PINCLR27 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR28_Pos            (28UL)                    /*!< PINCLR28 (Bit 28)                                     */
#define GPIO_CLR0_PINCLR28_Msk            (0x10000000UL)            /*!< PINCLR28 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR29_Pos            (29UL)                    /*!< PINCLR29 (Bit 29)                                     */
#define GPIO_CLR0_PINCLR29_Msk            (0x20000000UL)            /*!< PINCLR29 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR30_Pos            (30UL)                    /*!< PINCLR30 (Bit 30)                                     */
#define GPIO_CLR0_PINCLR30_Msk            (0x40000000UL)            /*!< PINCLR30 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR0_PINCLR31_Pos            (31UL)                    /*!< PINCLR31 (Bit 31)                                     */
#define GPIO_CLR0_PINCLR31_Msk            (0x80000000UL)            /*!< PINCLR31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  CLR1  ========================================================== */
#define GPIO_CLR1_PINCLR0_Pos             (0UL)                     /*!< PINCLR0 (Bit 0)                                       */
#define GPIO_CLR1_PINCLR0_Msk             (0x1UL)                   /*!< PINCLR0 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR1_Pos             (1UL)                     /*!< PINCLR1 (Bit 1)                                       */
#define GPIO_CLR1_PINCLR1_Msk             (0x2UL)                   /*!< PINCLR1 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR2_Pos             (2UL)                     /*!< PINCLR2 (Bit 2)                                       */
#define GPIO_CLR1_PINCLR2_Msk             (0x4UL)                   /*!< PINCLR2 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR3_Pos             (3UL)                     /*!< PINCLR3 (Bit 3)                                       */
#define GPIO_CLR1_PINCLR3_Msk             (0x8UL)                   /*!< PINCLR3 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR4_Pos             (4UL)                     /*!< PINCLR4 (Bit 4)                                       */
#define GPIO_CLR1_PINCLR4_Msk             (0x10UL)                  /*!< PINCLR4 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR5_Pos             (5UL)                     /*!< PINCLR5 (Bit 5)                                       */
#define GPIO_CLR1_PINCLR5_Msk             (0x20UL)                  /*!< PINCLR5 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR6_Pos             (6UL)                     /*!< PINCLR6 (Bit 6)                                       */
#define GPIO_CLR1_PINCLR6_Msk             (0x40UL)                  /*!< PINCLR6 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR7_Pos             (7UL)                     /*!< PINCLR7 (Bit 7)                                       */
#define GPIO_CLR1_PINCLR7_Msk             (0x80UL)                  /*!< PINCLR7 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR8_Pos             (8UL)                     /*!< PINCLR8 (Bit 8)                                       */
#define GPIO_CLR1_PINCLR8_Msk             (0x100UL)                 /*!< PINCLR8 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR9_Pos             (9UL)                     /*!< PINCLR9 (Bit 9)                                       */
#define GPIO_CLR1_PINCLR9_Msk             (0x200UL)                 /*!< PINCLR9 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR1_PINCLR10_Pos            (10UL)                    /*!< PINCLR10 (Bit 10)                                     */
#define GPIO_CLR1_PINCLR10_Msk            (0x400UL)                 /*!< PINCLR10 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR11_Pos            (11UL)                    /*!< PINCLR11 (Bit 11)                                     */
#define GPIO_CLR1_PINCLR11_Msk            (0x800UL)                 /*!< PINCLR11 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR12_Pos            (12UL)                    /*!< PINCLR12 (Bit 12)                                     */
#define GPIO_CLR1_PINCLR12_Msk            (0x1000UL)                /*!< PINCLR12 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR13_Pos            (13UL)                    /*!< PINCLR13 (Bit 13)                                     */
#define GPIO_CLR1_PINCLR13_Msk            (0x2000UL)                /*!< PINCLR13 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR14_Pos            (14UL)                    /*!< PINCLR14 (Bit 14)                                     */
#define GPIO_CLR1_PINCLR14_Msk            (0x4000UL)                /*!< PINCLR14 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR15_Pos            (15UL)                    /*!< PINCLR15 (Bit 15)                                     */
#define GPIO_CLR1_PINCLR15_Msk            (0x8000UL)                /*!< PINCLR15 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR16_Pos            (16UL)                    /*!< PINCLR16 (Bit 16)                                     */
#define GPIO_CLR1_PINCLR16_Msk            (0x10000UL)               /*!< PINCLR16 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR17_Pos            (17UL)                    /*!< PINCLR17 (Bit 17)                                     */
#define GPIO_CLR1_PINCLR17_Msk            (0x20000UL)               /*!< PINCLR17 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR18_Pos            (18UL)                    /*!< PINCLR18 (Bit 18)                                     */
#define GPIO_CLR1_PINCLR18_Msk            (0x40000UL)               /*!< PINCLR18 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR19_Pos            (19UL)                    /*!< PINCLR19 (Bit 19)                                     */
#define GPIO_CLR1_PINCLR19_Msk            (0x80000UL)               /*!< PINCLR19 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR20_Pos            (20UL)                    /*!< PINCLR20 (Bit 20)                                     */
#define GPIO_CLR1_PINCLR20_Msk            (0x100000UL)              /*!< PINCLR20 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR21_Pos            (21UL)                    /*!< PINCLR21 (Bit 21)                                     */
#define GPIO_CLR1_PINCLR21_Msk            (0x200000UL)              /*!< PINCLR21 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR22_Pos            (22UL)                    /*!< PINCLR22 (Bit 22)                                     */
#define GPIO_CLR1_PINCLR22_Msk            (0x400000UL)              /*!< PINCLR22 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR23_Pos            (23UL)                    /*!< PINCLR23 (Bit 23)                                     */
#define GPIO_CLR1_PINCLR23_Msk            (0x800000UL)              /*!< PINCLR23 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR24_Pos            (24UL)                    /*!< PINCLR24 (Bit 24)                                     */
#define GPIO_CLR1_PINCLR24_Msk            (0x1000000UL)             /*!< PINCLR24 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR25_Pos            (25UL)                    /*!< PINCLR25 (Bit 25)                                     */
#define GPIO_CLR1_PINCLR25_Msk            (0x2000000UL)             /*!< PINCLR25 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR26_Pos            (26UL)                    /*!< PINCLR26 (Bit 26)                                     */
#define GPIO_CLR1_PINCLR26_Msk            (0x4000000UL)             /*!< PINCLR26 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR27_Pos            (27UL)                    /*!< PINCLR27 (Bit 27)                                     */
#define GPIO_CLR1_PINCLR27_Msk            (0x8000000UL)             /*!< PINCLR27 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR28_Pos            (28UL)                    /*!< PINCLR28 (Bit 28)                                     */
#define GPIO_CLR1_PINCLR28_Msk            (0x10000000UL)            /*!< PINCLR28 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR29_Pos            (29UL)                    /*!< PINCLR29 (Bit 29)                                     */
#define GPIO_CLR1_PINCLR29_Msk            (0x20000000UL)            /*!< PINCLR29 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR30_Pos            (30UL)                    /*!< PINCLR30 (Bit 30)                                     */
#define GPIO_CLR1_PINCLR30_Msk            (0x40000000UL)            /*!< PINCLR30 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR1_PINCLR31_Pos            (31UL)                    /*!< PINCLR31 (Bit 31)                                     */
#define GPIO_CLR1_PINCLR31_Msk            (0x80000000UL)            /*!< PINCLR31 (Bitfield-Mask: 0x01)                        */
/* =========================================================  CLR2  ========================================================== */
#define GPIO_CLR2_PINCLR0_Pos             (0UL)                     /*!< PINCLR0 (Bit 0)                                       */
#define GPIO_CLR2_PINCLR0_Msk             (0x1UL)                   /*!< PINCLR0 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR1_Pos             (1UL)                     /*!< PINCLR1 (Bit 1)                                       */
#define GPIO_CLR2_PINCLR1_Msk             (0x2UL)                   /*!< PINCLR1 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR2_Pos             (2UL)                     /*!< PINCLR2 (Bit 2)                                       */
#define GPIO_CLR2_PINCLR2_Msk             (0x4UL)                   /*!< PINCLR2 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR3_Pos             (3UL)                     /*!< PINCLR3 (Bit 3)                                       */
#define GPIO_CLR2_PINCLR3_Msk             (0x8UL)                   /*!< PINCLR3 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR4_Pos             (4UL)                     /*!< PINCLR4 (Bit 4)                                       */
#define GPIO_CLR2_PINCLR4_Msk             (0x10UL)                  /*!< PINCLR4 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR5_Pos             (5UL)                     /*!< PINCLR5 (Bit 5)                                       */
#define GPIO_CLR2_PINCLR5_Msk             (0x20UL)                  /*!< PINCLR5 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR6_Pos             (6UL)                     /*!< PINCLR6 (Bit 6)                                       */
#define GPIO_CLR2_PINCLR6_Msk             (0x40UL)                  /*!< PINCLR6 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR7_Pos             (7UL)                     /*!< PINCLR7 (Bit 7)                                       */
#define GPIO_CLR2_PINCLR7_Msk             (0x80UL)                  /*!< PINCLR7 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR8_Pos             (8UL)                     /*!< PINCLR8 (Bit 8)                                       */
#define GPIO_CLR2_PINCLR8_Msk             (0x100UL)                 /*!< PINCLR8 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR9_Pos             (9UL)                     /*!< PINCLR9 (Bit 9)                                       */
#define GPIO_CLR2_PINCLR9_Msk             (0x200UL)                 /*!< PINCLR9 (Bitfield-Mask: 0x01)                         */
#define GPIO_CLR2_PINCLR10_Pos            (10UL)                    /*!< PINCLR10 (Bit 10)                                     */
#define GPIO_CLR2_PINCLR10_Msk            (0x400UL)                 /*!< PINCLR10 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR11_Pos            (11UL)                    /*!< PINCLR11 (Bit 11)                                     */
#define GPIO_CLR2_PINCLR11_Msk            (0x800UL)                 /*!< PINCLR11 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR12_Pos            (12UL)                    /*!< PINCLR12 (Bit 12)                                     */
#define GPIO_CLR2_PINCLR12_Msk            (0x1000UL)                /*!< PINCLR12 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR13_Pos            (13UL)                    /*!< PINCLR13 (Bit 13)                                     */
#define GPIO_CLR2_PINCLR13_Msk            (0x2000UL)                /*!< PINCLR13 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR14_Pos            (14UL)                    /*!< PINCLR14 (Bit 14)                                     */
#define GPIO_CLR2_PINCLR14_Msk            (0x4000UL)                /*!< PINCLR14 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR15_Pos            (15UL)                    /*!< PINCLR15 (Bit 15)                                     */
#define GPIO_CLR2_PINCLR15_Msk            (0x8000UL)                /*!< PINCLR15 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR16_Pos            (16UL)                    /*!< PINCLR16 (Bit 16)                                     */
#define GPIO_CLR2_PINCLR16_Msk            (0x10000UL)               /*!< PINCLR16 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR17_Pos            (17UL)                    /*!< PINCLR17 (Bit 17)                                     */
#define GPIO_CLR2_PINCLR17_Msk            (0x20000UL)               /*!< PINCLR17 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR18_Pos            (18UL)                    /*!< PINCLR18 (Bit 18)                                     */
#define GPIO_CLR2_PINCLR18_Msk            (0x40000UL)               /*!< PINCLR18 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR19_Pos            (19UL)                    /*!< PINCLR19 (Bit 19)                                     */
#define GPIO_CLR2_PINCLR19_Msk            (0x80000UL)               /*!< PINCLR19 (Bitfield-Mask: 0x01)                        */
#define GPIO_CLR2_PINCLR20_Pos            (20UL)                    /*!< PINCLR20 (Bit 20)                                     */
